IDENTIFICATION DIVISION.
PROGRAM-ID.   SSPDFE.
AUTHOR.       CTS.
DATE-WRITTEN. 06-SEP-2023.
********************************************************************************
*
*       BATH DATAFEED (ISSUED AWARDS + REGNS)
*
********************************************************************************
* Amendment Log :                                                              *
*                                                                              *
* When        Who      What                                                    *
* ----------  -------  ------------------------------------------------------- *
*
* 06-Sep-2023 CTS      EC5718 - DFE Report Generation Process To Insert/Update 
*                      learners' details into DFE_REPORT_DETAILS table and to 
*                      capture any of it's changes of the mandatory columns
*                      in the DFE_REPORT_DETAILS_AUDIT_TRAIL table.  Generate
*                      BTEC and NVQ Learners details to the business thru FTP.
* 23-Apr-2024 CTS      EC5877 - Update in the Order By clause to have at_number
*                      as one of the columns in the BTEC Cursor.
********************************************************************************
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. VAX-11.
OBJECT-COMPUTER. VAX-11.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT  CSV-FILE-B    ASSIGN  SSPDFEB.
    SELECT  CSV-FILE-N    ASSIGN  SSPDFEN.
    SELECT  IGNORE-RPT    ASSIGN  SSPDFEI.
    SELECT  TOTALS-RPT    ASSIGN  SSPDFETOT.
*
DATA DIVISION.
FILE SECTION.
*
FD  CSV-FILE-B
    RECORD VARYING FROM 1 TO 950
    DEPENDING ON WS-REC-LENGTH.
01  DB-DETAIL-RECORD          PIC X(950).
*
FD  CSV-FILE-N
    RECORD VARYING FROM 1 TO 950
    DEPENDING ON WS-REC-LENGTH.
01  DN-DETAIL-RECORD          PIC X(950).
*
FD  IGNORE-RPT
    RECORD VARYING FROM 1 TO 80
    DEPENDING ON WS-REC-LENGTH.
01  DI-DETAIL-RECORD          PIC X(80).
*
FD  TOTALS-RPT
    LABEL RECORDS STANDARD.
01  TOT-RECORD                PIC X(132).
*
WORKING-STORAGE SECTION.
*                                               
01  SQLFPN GLOBAL.
           02  SQLFPN-FILE-LEN PIC S9(4) COMP-5 VALUE +37.
           02  SQLFPN-FILENAME PIC X(37) VALUE "/work/SampleFiles/ProCOBOL/SSPDFE.pco".

01  SQ0001 GLOBAL.
           02  FILLER PIC X(43) VALUE "alter SESSION SET OPTIMIZER_MODE = all_rows".

01  SQ0002 GLOBAL.
           02  FILLER PIC X(68) VALUE "select TO_CHAR(SYSDATE,'DD-MON-YYYY:HH24:MI')   into :b1  from DUAL ".

01  SQ0003 GLOBAL.
           02  FILLER PIC X(98) VALUE "select RV_DESCRIPTION   into :b1  from REF_VALUES where (RV_DOMAIN='SSDDFE' and RV_CODE='DFE_"&
    "RSC')".

01  SQ0004 GLOBAL.
           02  FILLER PIC X(105) VALUE "select NVL(TO_CHAR(FN_FIRST_ENTRY_DATE(TRUNC(SYSDATE)),'YYYY-MM-DD'),'2999-12-31')   into :b"&
    "1  from DUAL ".

01  SQ0005 GLOBAL.
           02  FILLER PIC X(51) VALUE "select FN_GET_ACAD_YEAR(:b1)   into :b2  from DUAL ".

01  SQ0006 GLOBAL.
           02  FILLER PIC X(60) VALUE "select TO_CHAR(SYSDATE,'DD-MON-YYYY')   into :b1  from DUAL ".

01  SQ0008 GLOBAL.
           02  FILLER PIC X(118) VALUE "select  CASE  WHEN TO_DATE(:b1,'YYYY-MM-DD')>TO_DATE(:b2,'DD-MON-YYYY') THEN 'Y' ELSE 'N'  E"&
    "ND    into :b3  from DUAL ".

01  SQ0010 GLOBAL.
           02  FILLER PIC X(68) VALUE "select TO_CHAR(SYSDATE,'DD-MON-YYYY:HH24:MI')   into :b7  from DUAL ".

01  SQ0011 GLOBAL.
           02  FILLER PIC X(68) VALUE "select TO_CHAR(SYSDATE,'DD-MON-YYYY:HH24:MI')   into :b1  from DUAL ".

01  SQ0013 GLOBAL.
           02  FILLER PIC X(47) VALUE "select DAUD_SEQ.nextval    into :b1  from DUAL ".

01  SQ0014 GLOBAL.
           02  FILLER PIC X(256) VALUE "insert into DATAFEED_AUDITS(DAUD_SEQUENCE,DAUD_MODULE,DAUD_MODULE_DESCR,DAUD_START,DAUD_END,"&
    "DAUD_AWARDED_FROM,DAUD_AWARDED_TO,DAUD_ACADEMIC_YEAR,DAUD_BTEC_NG_GRADING_DATE,DAUD_REGNS_FROM,DAUD_REGNS_TO,DAUD_OFQUAL_FROM,"&
    "DAUD_OFQUAL_TO) values (:b1,'SSDDFE','".

           02  FILLER PIC X(80) VALUE "BATH',SYSDATE,null ,:b2,:b3,null ,TO_DATE(:b4,'YYYY-MM-DD'),:b5,:b6,null ,null )".

01  SQ0016 GLOBAL.
           02  FILLER PIC X(68) VALUE "update DATAFEED_AUDITS  set DAUD_END=SYSDATE where DAUD_SEQUENCE=:b1".

01  SQ0017 GLOBAL.
           02  FILLER PIC X(94) VALUE "begin  PK_PROVDEF . PR_CHECK_STUDENT_DEFERRAL ( :b1 , :b2 , :b3:i3 , :b4:i4 , :b5:i5 ) ; END "&
    ";".

01  SQ0018 GLOBAL.
           02  FILLER PIC X(93) VALUE "begin  PK_OSCA1 . PR_Q_CERT_STATUS ( :b1 , NULL , :b2:i2 , :b3:i3 , :b4:i4 , :b5:i5 ) ; END ;".

01  SQ0019 GLOBAL.
           02  FILLER PIC X(61) VALUE "select FN_GET_DFE_RECORD_TYPE(:b1,:b2)   into :b3  from DUAL ".

01  SQ0020 GLOBAL.
           02  FILLER PIC X(256) VALUE "update DFE_REPORT_DETAILS  set DRD_REC_TYPE=:b1,DRD_UCI_REF=:b2,DRD_ULN=:b3,DRD_FORENAMES=DE"&
    "CODE(:b4,' ',null ,:b4),DRD_SURNAME=DECODE(:b5,' ',null ,:b5),DRD_SEX=:b6,DRD_BIRTH_DATE=:b7,DRD_NCN=:b8,DRD_URN=:b9,DRD_CENTR"&
    "E_ID=:b10,DRD_UKPRN=:b11,DRD_CENTRE_NA".

           02  FILLER PIC X(256) VALUE "ME=:b12,DRD_ADDRESS_1=DECODE(:b13,' ',null ,:b13),DRD_ADDRESS_2=DECODE(:b14,' ',null ,:b14),"&
    "DRD_ADDRESS_3=DECODE(:b15,' ',null ,:b15),DRD_ADDRESS_4=DECODE(:b16,' ',null ,:b16),DRD_POSTCODE=:b17,DRD_CENTRE_TYPE=:b18,DRD"&
    "_QUAL_NUM_TYPE=:b19,DRD_QUAL_NUMBER=:b".

           02  FILLER PIC X(256) VALUE "20,DRD_SPEC_CODE=:b21,DRD_SPEC_TITLE=:b22,DRD_QUAL_TYPE=:b23,DRD_REG_DATE=:b24,DRD_FIRST_ENT"&
    "RY_DATE=DECODE(:b25,'Y',:b26,DRD_FIRST_ENTRY_DATE),DRD_AWARD_DATE=DECODE(:b25,'Y',:b27,DRD_AWARD_DATE),DRD_QUAL_GRADE=:b28,DRD"&
    "_AMEND_CUTOFF_DATE=NVL(DRD_AMEND_CUTOF".

           02  FILLER PIC X(103) VALUE "F_DATE,TO_DATE(:b29,'DD-MON-YYYY')),DRD_USER_NAME=:b30,DRD_UPDATE_DATE=SYSDATE where DRD_ST_"&
    "REG_NO=:b31".

01  SQ0021 GLOBAL.
           02  FILLER PIC X(256) VALUE "insert into DFE_REPORT_DETAILS values (:b1,:b2,:b3,:b4,:b5,DECODE(:b6,' ',null ,:b6),null ,D"&
    "ECODE(:b7,' ',null ,:b7),:b8,:b9,:b10,:b11,:b12,:b13,:b14,:b15,DECODE(:b16,' ',null ,:b16),DECODE(:b17,' ',null ,:b17),DECODE("&
    ":b18,' ',null ,:b18),DECODE(:b19,' ',n".

           02  FILLER PIC X(160) VALUE "ull ,:b19),:b20,:b21,:b22,:b23,:b24,:b25,:b26,:b27,:b28,:b29,:b30,:b31,:b32,:b33,DECODE(:b1,"&
    "'Result',TO_DATE(:b34,'DD-MON-YYYY'),null ),:b35,:b36,SYSDATE,null )".

01  SQ0022 GLOBAL.
           02  FILLER PIC X(256) VALUE "select ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((:b1||',')||:b2)||',"&
    "')||:b3)||',')||'-2')||',')||:b4)||',')||:b5)||',')||'')||',')||:b6)||',')||:b7)||',')||:b8)||',')||:b9)||',')||:b10)||',')||'"&
    "-2')||',')||:b11)||',')||:b12)||',')||".

           02  FILLER PIC X(256) VALUE "TRANSLATE(:b13,:b14,' '))||',')||TRANSLATE(:b15,:b14,' '))||',')||TRANSLATE(:b16,:b14,' '))|"&
    "|',')||TRANSLATE(:b17,:b14,' '))||',')||TRANSLATE(:b18,:b14,' '))||',')|| replace(:b19,',',null ))||',')||:b20)||',')||:b21)||"&
    "',')|| replace(:b22,'  ',' '))||',')||".

           02  FILLER PIC X(256) VALUE ":b23)||',')||TRANSLATE(:b24,:b14,' '))||',')||:b25)||',')||'-2')||',')||:b26)||',')||:b27)||"&
    "',')||:b28)||',')||:b29)||',')||'-2')||',')||'-2')  ,LENGTH((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((("&
    ":b1||',')||:b2)||',')||:b3)||',')||'-2".

           02  FILLER PIC X(256) VALUE "')||',')||:b4)||',')||:b5)||',')||'')||',')||:b6)||',')||:b7)||',')||:b8)||',')||:b9)||',')|"&
    "|:b10)||',')||'-2')||',')||:b11)||',')||:b12)||',')||TRANSLATE(:b13,:b14,' '))||',')||TRANSLATE(:b15,:b14,' '))||',')||TRANSLA"&
    "TE(:b16,:b14,' '))||',')||TRANSLATE(:b".

           02  FILLER PIC X(256) VALUE "17,:b14,' '))||',')||TRANSLATE(:b18,:b14,' '))||',')|| replace(:b19,',',null ))||',')||:b20)"&
    "||',')||:b21)||',')|| replace(:b22,'  ',' '))||',')||:b23)||',')||TRANSLATE(:b24,:b14,' '))||',')||:b25)||',')||'-2')||',')||:"&
    "b26)||',')||:b27)||',')||:b28)||',')||".

           02  FILLER PIC X(61) VALUE ":b29)||',')||'-2')||',')||'-2'))   into :b30,:b31  from DUAL ".

01  SQLCTX GLOBAL PIC S9(9) COMP-5 VALUE +330857447.


01  SQLEXD GLOBAL.
           02  SQL-SQLVSN   PIC S9(18) COMP-5 VALUE +13.
           02  SQL-ARRSIZ   PIC S9(9) COMP-5 VALUE +70.
           02  SQL-ITERS    PIC S9(9) COMP-5.
           02  SQL-OFFSET   PIC S9(9) COMP-5.
           02  SQL-SELERR   PIC S9(4) COMP-5.
           02  SQL-SQLETY   PIC S9(4) COMP-5.
           02  SQL-OCCURS   PIC S9(9) COMP-5.
           02  SQL-DUMMY    PIC S9(9) COMP-5.
           02  SQL-CUD      PIC S9(18) COMP-5.
           02  SQL-SQLEST   PIC S9(18) COMP-5.
           02  SQL-STMT     PIC S9(18) COMP-5.
           02  SQL-SQLADTP  PIC S9(18) COMP-5 VALUE 0.
           02  SQL-SQLTDSP  PIC S9(18) COMP-5 VALUE 0.
           02  SQL-SQPHSV   PIC S9(18) COMP-5.
           02  SQL-SQPHSL   PIC S9(18) COMP-5.
           02  SQL-SQPHSS   PIC S9(18) COMP-5.
           02  SQL-SQPIND   PIC S9(18) COMP-5.
           02  SQL-SQPINS   PIC S9(18) COMP-5.
           02  SQL-SQPARM   PIC S9(18) COMP-5.
           02  SQL-SQPARC   PIC S9(18) COMP-5.
           02  SQL-SQPADTO  PIC S9(18) COMP-5.
           02  SQL-SQPTDSO  PIC S9(18) COMP-5.
           02  SQL-SQPHR1   PIC S9(9) COMP-5.
           02  SQL-SQPHR2   PIC S9(9) COMP-5.
           02  SQL-SQPHR3   PIC S9(9) COMP-5.
           02  SQL-SQPHR4   PIC S9(9) COMP-5.
           02  SQL-SQPHR5   PIC S9(9) COMP-5.
           02  SQL-SQFOFF   PIC S9(9) COMP-5.
           02  SQL-SQCMOD   PIC S9(9) COMP-5.
           02  SQL-SQFMOD   PIC S9(9) COMP-5.
           02  SQL-SQPMEM   PIC S9(9) COMP-5.
           02  SQL-DUMMYPF  PIC S9(9) COMP-5.
           02  SQL-SQHSTV   PIC S9(18) COMP-5 OCCURS 70 TIMES.
           02  SQL-SQHSTL   PIC S9(18) COMP-5 OCCURS 70 TIMES.
           02  SQL-SQHSTS   PIC S9(18) COMP-5 OCCURS 70 TIMES.
           02  SQL-SQINDV   PIC S9(18) COMP-5 OCCURS 70 TIMES.
           02  SQL-SQINDS   PIC S9(18) COMP-5 OCCURS 70 TIMES.
           02  SQL-SQHARM   PIC S9(18) COMP-5 OCCURS 70 TIMES.
           02  SQL-SQHARC   PIC S9(18) COMP-5 OCCURS 70 TIMES.
           02  SQL-SQADTO   PIC S9(4) COMP-5 OCCURS 70 TIMES.
           02  SQL-SQTDSO   PIC S9(4) COMP-5 OCCURS 70 TIMES.


01  SQ0007 GLOBAL.
           02  FILLER PIC X(256) VALUE "select '-2'  UNIQUECANDIDATEIDENTIFIER ,'-2'  UNIQUELEARNERNUMBER ,'-2'  UNIQUEPUPILNUMBER ,"&
    "ST_REG_NO  CANDIDATEIDENTIFIEROTHER ,ST_FORENAMES  FIRSTNAMEDB ,NVL( trim(TRANSLATE(ST_FORENAMES,:b1,' ')),' ')  FIRSTNAMERPT "&
    ",ST_SURNAME  SURNAMEDB ,NVL( trim(TRAN".

           02  FILLER PIC X(256) VALUE "SLATE(ST_SURNAME,:b1,' ')),' ')  SURNAMERPT ,DECODE(ST_SEX,'M','M','F','F','-2')  SEX , CASE"&
    "  WHEN ST_BIRTH_DATE is null  THEN '2999-12-31' WHEN ST_BIRTH_DATE<=TO_DATE('1900-01-01','YYYY-MM-DD') THEN '2999-12-31' ELSE "&
    "TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')  E".

           02  FILLER PIC X(256) VALUE "ND   DOB ,FN_GET_NCN(ST_CENTRE_ID)  NCN ,NVL(ECEN_URN,(-2))  CENTREURN ,'-2'  LAESTAB ,ST_CE"&
    "NTRE_ID  CENTREIDENTIFIEROTHER ,DECODE(LENGTH(ECEN_UKPRN),8,ECEN_UKPRN,(-2))  UKPRN ,CN_CENTRE_NAME  CENTRENAME ,NVL(((CN_ADDR"&
    "ESS_1||DECODE(CN_ADDRESS_1,null ,null ".

           02  FILLER PIC X(256) VALUE ",' '))||CN_ADDRESS_2),' ')  CENTREADDRESS1 ,NVL(CN_ADDRESS_3,' ')  CENTREADDRESS2 ,NVL(CN_TO"&
    "WN,' ')  CENTREADDRESS3 ,NVL(CN_COUNTY,' ')  CENTREADDRESS4 ,NVL(CN_POSTCODE,'-2')  CENTREPOSTCODE ,DECODE(CN_BURE_BUNI_ID,0,'"&
    "12',DECODE(CN_STATUS,0,'9',2,'5',3,'1'".

           02  FILLER PIC X(256) VALUE ",4,'11',5,'2',6,'3',7,'1',8,'10',9,'12',10,'6',11,'2',12,'13',13,'5',14,'13','13'))  CENTRET"&
    "YPE ,AACO_QCA_CODE  QUALIFICATIONNUMBER ,AA_BTEC_TITLE  SPECIFICATIONCODE ,AT_NAME  SPECIFICATIONTITLE ,FN_GET_DFE_QUAL_TYPE(A"&
    "ACO_QCA_CODE)  QUALIFICATIONTYPE ,'-2'".

           02  FILLER PIC X(256) VALUE "  EXAMSERIES ,NVL(TO_CHAR(ST_REG_DATE,'YYYY-MM-DD'),'2999-12-31')  REGISTRATIONDATE , CASE  "&
    "WHEN (AC_BNM_TYPE<>'G' or ST_AWARD_ISSUE is  not null ) THEN NVL(TO_CHAR(ST_AWARD_ISSUE,'YYYY-MM-DD'),'2999-12-31') WHEN (ST_A"&
    "WARD_ISSUE is null  and ST_BNM_GRADE i".

           02  FILLER PIC X(256) VALUE "s null ) THEN '2999-12-31' WHEN ((ST_AWARD_ISSUE is null  and ST_BNM_GRADE is  not null ) an"&
    "d TO_DATE(:b2,'YYYY-MM-DD')>SYSDATE) THEN FN_GET_LATEST_RESULT_DATE(ST_REG_NO,:b3) ELSE :b2  END   FIRSTENTRYDATE ,null   AWAR"&
    "DDATE ,DECODE(AC_BNM_TYPE,'G',DECODE(S".

           02  FILLER PIC X(256) VALUE "T_AWARD_ISSUE,null ,DECODE(ST_BNM_GRADE,null ,'-2',DECODE(AW_AWARD_CODE,'Y6',DECODE(FN_CHECK"&
    "_TA_GRADE_VISIBLE_EOL(ST_REG_NO),'Y',ST_BNM_GRADE,'-2'),ST_BNM_GRADE)),NVL(NVL(ST_OVER_GRADE,ST_BNM_GRADE),'P')),DECODE(ST_AWA"&
    "RD_ISSUE,null ,'-2',NVL(NVL(ST_OVER_GR".

           02  FILLER PIC X(256) VALUE "ADE,ST_BNM_GRADE),'P')))  QUALIFICATIONGRADE ,(-2)  PRIVATECANDIDATE ,(-2)  PARTIALABSENCE ,"&
    "DECODE(AC_BNM_TYPE,'G','G','B')  BTEC_NG_TYPE ,DECODE(ST_AWARD_ISSUE,null ,'N','Y')  CERT_IND ,ST_COURSE_ID  COURSE_ID ,AT_NUM"&
    "BER  ,null   DRD_REC_TYPE ,null   DRD_".

           02  FILLER PIC X(256) VALUE "ST_REG_NO ,null   DRD_FORENAMES ,null   DRD_SURNAME ,null   DRD_SEX ,null   DRD_BIRTH_DATE ,"&
    "null   DRD_NCN ,null   DRD_URN ,null   DRD_CENTRE_ID ,null   DRD_UKPRN ,null   DRD_CENTRE_NAME ,null   DRD_ADDRESS_1 ,null   D"&
    "RD_ADDRESS_2 ,null   DRD_ADDRESS_3 ,nu".

           02  FILLER PIC X(256) VALUE "ll   DRD_ADDRESS_4 ,null   DRD_POSTCODE ,null   DRD_CENTRE_TYPE ,null   DRD_QUAL_NUM_TYPE ,n"&
    "ull   DRD_QUAL_NUMBER ,null   DRD_SPEC_CODE ,null   DRD_SPEC_TITLE ,null   DRD_QUAL_TYPE ,null   DRD_REG_DATE ,null   DRD_FIRS"&
    "T_ENTRY_DATE ,null   DRD_AWARD_DATE ,n".

           02  FILLER PIC X(256) VALUE "ull   DRD_QUAL_GRADE  from STUDENTS X ,CENTRES ,LEGACY_CENTRES ,EDEXCEL_CENTRES ,APPROVAL_AW"&
    "ARDS ,APPROVAL_APPLICATION ,AT_AWARD_CODES ,AWARD_TITLES ,AWARD_CODES where ((((((((((((((((ST_CENTRE_ID=CN_CENTRE_ID and CN_C"&
    "ENTRE_ID=LCEN_CENTRE_REF) and LCEN_ECE".

           02  FILLER PIC X(256) VALUE "N_ID=ECEN_ID) and ST_COURSE_ID=AW_COURSE_NUMBER) and AW_APPLICAT_NO=AA_APPLICAT_NO) and TO_N"&
    "UMBER(AA_BTEC_TITLE)=AT_NUMBER) and AACO_AT_NUMBER=AT_NUMBER) and AACO_AC_CODE=AW_AWARD_CODE) and AC_CODE=AW_AWARD_CODE) and A"&
    "ACO_QCA_CODE is  not null ) and ST_DEL".

           02  FILLER PIC X(256) VALUE "ETE is null ) and ST_FALLBACK is null ) and ST_UNIVERSITY_IND is null ) and LCEN_LTYP_ID=1) "&
    "and AW_AWARD_CODE not  in ('01','02','03','04','05','06','11','27','64','35','63','93','HH','GG','GA','GB','CC','EW','FS','FO'"&
    ")) and (ST_AWARD_ISSUE between TO_DATE".

           02  FILLER PIC X(256) VALUE "(:b4,'DD-MON-YYYY') and TO_DATE(:b5,'DD-MON-YYYY') or (ST_REG_DATE between TO_DATE(:b6,'DD-M"&
    "ON-YYYY') and TO_DATE(:b7,'DD-MON-YYYY') and ST_AWARD_ISSUE is null ))) and  not exists (select 1   from DFE_REPORT_DETAILS wh"&
    "ere DRD_ST_REG_NO=ST_REG_NO)) union al".

           02  FILLER PIC X(256) VALUE "l select '-2'  UNIQUECANDIDATEIDENTIFIER ,'-2'  UNIQUELEARNERNUMBER ,'-2'  UNIQUEPUPILNUMBER"&
    " ,ST_REG_NO  CANDIDATEIDENTIFIEROTHER ,ST_FORENAMES  FIRSTNAMEDB ,NVL( trim(TRANSLATE(ST_FORENAMES,:b1,' ')),' ')  FIRSTNAMERP"&
    "T ,ST_SURNAME  SURNAMEDB ,NVL( trim(TR".

           02  FILLER PIC X(256) VALUE "ANSLATE(ST_SURNAME,:b1,' ')),' ')  SURNAMERPT ,DECODE(ST_SEX,'M','M','F','F','-2')  SEX , CA"&
    "SE  WHEN ST_BIRTH_DATE is null  THEN '2999-12-31' WHEN ST_BIRTH_DATE<=TO_DATE('1900-01-01','YYYY-MM-DD') THEN '2999-12-31' ELS"&
    "E TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD') ".

           02  FILLER PIC X(256) VALUE " END   DOB ,FN_GET_NCN(ST_CENTRE_ID)  NCN ,NVL(ECEN_URN,(-2))  CENTREURN ,'-2'  LAESTAB ,ST_"&
    "CENTRE_ID  CENTREIDENTIFIEROTHER ,DECODE(LENGTH(ECEN_UKPRN),8,ECEN_UKPRN,(-2))  UKPRN ,CN_CENTRE_NAME  CENTRENAME ,NVL(((CN_AD"&
    "DRESS_1||DECODE(CN_ADDRESS_1,null ,nul".

           02  FILLER PIC X(256) VALUE "l ,' '))||CN_ADDRESS_2),' ')  CENTREADDRESS1 ,NVL(CN_ADDRESS_3,' ')  CENTREADDRESS2 ,NVL(CN_"&
    "TOWN,' ')  CENTREADDRESS3 ,NVL(CN_COUNTY,' ')  CENTREADDRESS4 ,NVL(CN_POSTCODE,'-2')  CENTREPOSTCODE ,DECODE(CN_BURE_BUNI_ID,0"&
    ",'12',DECODE(CN_STATUS,0,'9',2,'5',3,'".

           02  FILLER PIC X(256) VALUE "1',4,'11',5,'2',6,'3',7,'1',8,'10',9,'12',10,'6',11,'2',12,'13',13,'5',14,'13','13'))  CENTR"&
    "ETYPE ,AACO_QCA_CODE  QUALIFICATIONNUMBER ,AA_BTEC_TITLE  SPECIFICATIONCODE ,AT_NAME  SPECIFICATIONTITLE ,FN_GET_DFE_QUAL_TYPE"&
    "(AACO_QCA_CODE)  QUALIFICATIONTYPE ,'-".

           02  FILLER PIC X(256) VALUE "2'  EXAMSERIES ,NVL(TO_CHAR(ST_REG_DATE,'YYYY-MM-DD'),'2999-12-31')  REGISTRATIONDATE , CASE"&
    "  WHEN (AC_BNM_TYPE<>'G' or ST_AWARD_ISSUE is  not null ) THEN NVL(TO_CHAR(ST_AWARD_ISSUE,'YYYY-MM-DD'),'2999-12-31') WHEN (ST"&
    "_AWARD_ISSUE is null  and ST_BNM_GRADE".

           02  FILLER PIC X(256) VALUE " is null ) THEN '2999-12-31' WHEN ((ST_AWARD_ISSUE is null  and ST_BNM_GRADE is  not null ) "&
    "and TO_DATE(:b2,'YYYY-MM-DD')>SYSDATE) THEN FN_GET_LATEST_RESULT_DATE(ST_REG_NO,:b3) ELSE :b2  END   FIRSTENTRYDATE ,null   AW"&
    "ARDDATE ,DECODE(AC_BNM_TYPE,'G',DECODE".

           02  FILLER PIC X(256) VALUE "(ST_AWARD_ISSUE,null ,DECODE(ST_BNM_GRADE,null ,'-2',DECODE(AW_AWARD_CODE,'Y6',DECODE(FN_CHE"&
    "CK_TA_GRADE_VISIBLE_EOL(ST_REG_NO),'Y',ST_BNM_GRADE,'-2'),ST_BNM_GRADE)),NVL(NVL(ST_OVER_GRADE,ST_BNM_GRADE),'P')),DECODE(ST_A"&
    "WARD_ISSUE,null ,'-2',NVL(NVL(ST_OVER_".

           02  FILLER PIC X(256) VALUE "GRADE,ST_BNM_GRADE),'P')))  QUALIFICATIONGRADE ,(-2)  PRIVATECANDIDATE ,(-2)  PARTIALABSENCE"&
    " ,DECODE(AC_BNM_TYPE,'G','G','B')  BTEC_NG_TYPE ,DECODE(ST_AWARD_ISSUE,null ,'N','Y')  CERT_IND ,ST_COURSE_ID  COURSE_ID ,AT_N"&
    "UMBER  ,DRD_REC_TYPE  ,DRD_ST_REG_NO  ".

           02  FILLER PIC X(256) VALUE ",DRD_FORENAMES  ,DRD_SURNAME  ,DRD_SEX  ,DRD_BIRTH_DATE  ,DRD_NCN  ,DRD_URN  ,DRD_CENTRE_ID "&
    " ,DRD_UKPRN  ,DRD_CENTRE_NAME  ,NVL(DRD_ADDRESS_1,' ')  ,NVL(DRD_ADDRESS_2,' ')  ,NVL(DRD_ADDRESS_3,' ')  ,NVL(DRD_ADDRESS_4,'"&
    " ')  ,DRD_POSTCODE  ,DRD_CENTRE_TYPE  ".

           02  FILLER PIC X(256) VALUE ",DRD_QUAL_NUM_TYPE  ,DRD_QUAL_NUMBER  ,DRD_SPEC_CODE  ,DRD_SPEC_TITLE  ,DRD_QUAL_TYPE  ,DRD_"&
    "REG_DATE  ,DRD_FIRST_ENTRY_DATE  ,DRD_AWARD_DATE  ,DRD_QUAL_GRADE   from STUDENTS ,DFE_REPORT_DETAILS ,CENTRES ,LEGACY_CENTRES"&
    " ,EDEXCEL_CENTRES ,APPROVAL_AWARDS ,AP".

           02  FILLER PIC X(256) VALUE "PROVAL_APPLICATION ,AT_AWARD_CODES ,AWARD_TITLES ,AWARD_CODES where ((((((((((((((((ST_REG_N"&
    "O=DRD_ST_REG_NO and ST_CENTRE_ID=CN_CENTRE_ID) and CN_CENTRE_ID=LCEN_CENTRE_REF) and LCEN_ECEN_ID=ECEN_ID) and ST_COURSE_ID=AW"&
    "_COURSE_NUMBER) and AW_APPLICAT_NO=AA_".

           02  FILLER PIC X(256) VALUE "APPLICAT_NO) and TO_NUMBER(AA_BTEC_TITLE)=AT_NUMBER) and AW_AWARD_CODE=AACO_AC_CODE) and AT_"&
    "NUMBER=AACO_AT_NUMBER) and AW_AWARD_CODE=AC_CODE) and AACO_QCA_CODE is  not null ) and ST_DELETE is null ) and ST_FALLBACK is "&
    "null ) and ST_UNIVERSITY_IND is null )".

           02  FILLER PIC X(256) VALUE " and LCEN_LTYP_ID=1) and AW_AWARD_CODE not  in ('01','02','03','04','05','06','11','27','64'"&
    ",'35','63','93','HH','GG','GA','GB','CC','EW','FS','FO')) and ((DRD_REC_TYPE in ('Result','Amendment') and (((AC_BNM_TYPE='G' "&
    "and ST_BNM_GRADE is  not null ) and (S".

           02  FILLER PIC X(256) VALUE "T_BNM_GRADE<>DRD_QUAL_GRADE or TRUNC(SYSDATE)<=DRD_AMEND_CUTOFF_DATE)) or ((AC_BNM_TYPE<>'G'"&
    " and ST_AWARD_ISSUE is  not null ) and (TRUNC(SYSDATE)<=DRD_AMEND_CUTOFF_DATE or NVL(NVL(ST_OVER_GRADE,ST_BNM_GRADE),'P')<>DRD"&
    "_QUAL_GRADE)))) or ((DRD_REC_TYPE='Ent".

           02  FILLER PIC X(256) VALUE "ry' and (UPPER(:b8)='NO' or (UPPER(:b8)='YES' and NVL(ST_AWARD_ISSUE,TO_DATE(:b2,'YYYY-MM-DD"&
    "'))<=TO_DATE(:b5,'DD-MON-YYYY')))) and DECODE(AC_BNM_TYPE,'G',DECODE(ST_AWARD_ISSUE,null ,DECODE(ST_BNM_GRADE,null ,'-2',DECOD"&
    "E(AW_AWARD_CODE,'Y6',DECODE(FN_CHECK_T".

           02  FILLER PIC X(256) VALUE "A_GRADE_VISIBLE_EOL(ST_REG_NO),'Y',ST_BNM_GRADE,'-2'),ST_BNM_GRADE)),NVL(NVL(ST_OVER_GRADE,S"&
    "T_BNM_GRADE),'P')),DECODE(ST_AWARD_ISSUE,null ,'-2',NVL(NVL(ST_OVER_GRADE,ST_BNM_GRADE),'P')))<>DRD_QUAL_GRADE))) union all se"&
    "lect '-2'  UNIQUECANDIDATEIDENTIFIER ,".

           02  FILLER PIC X(256) VALUE "'-2'  UNIQUELEARNERNUMBER ,'-2'  UNIQUEPUPILNUMBER ,ST_REG_NO  CANDIDATEIDENTIFIEROTHER ,ST_"&
    "FORENAMES  FIRSTNAMEDB ,NVL( trim(TRANSLATE(ST_FORENAMES,:b1,' ')),' ')  FIRSTNAMERPT ,ST_SURNAME  SURNAMEDB ,NVL( trim(TRANSL"&
    "ATE(ST_SURNAME,:b1,' ')),' ')  SURNAME".

           02  FILLER PIC X(256) VALUE "RPT ,DECODE(ST_SEX,'M','M','F','F','-2')  SEX , CASE  WHEN ST_BIRTH_DATE is null  THEN '2999"&
    "-12-31' WHEN ST_BIRTH_DATE<=TO_DATE('1900-01-01','YYYY-MM-DD') THEN '2999-12-31' ELSE TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')  END"&
    "   DOB ,FN_GET_NCN(ST_CENTRE_ID)  NCN ".

           02  FILLER PIC X(256) VALUE ",NVL(ECEN_URN,(-2))  CENTREURN ,'-2'  LAESTAB ,ST_CENTRE_ID  CENTREIDENTIFIEROTHER ,DECODE(L"&
    "ENGTH(ECEN_UKPRN),8,ECEN_UKPRN,(-2))  UKPRN ,CN_CENTRE_NAME  CENTRENAME ,NVL(((CN_ADDRESS_1||DECODE(CN_ADDRESS_1,null ,null ,'"&
    " '))||CN_ADDRESS_2),' ')  CENTREADDRES".

           02  FILLER PIC X(256) VALUE "S1 ,NVL(CN_ADDRESS_3,' ')  CENTREADDRESS2 ,NVL(CN_TOWN,' ')  CENTREADDRESS3 ,NVL(CN_COUNTY,'"&
    " ')  CENTREADDRESS4 ,NVL(CN_POSTCODE,'-2')  CENTREPOSTCODE ,DECODE(CN_BURE_BUNI_ID,0,'12',DECODE(CN_STATUS,0,'9',2,'5',3,'1',4"&
    ",'11',5,'2',6,'3',7,'1',8,'10',9,'12',".

           02  FILLER PIC X(256) VALUE "10,'6',11,'2',12,'13',13,'5',14,'13','13'))  CENTRETYPE ,DECODE(ST_AWARD_ISSUE,null ,DECODE("&
    "AW_AWARD_CODE,'FO','50098275','FS','50085001'),FN_GET_QCA_CODE(AW_AWARD_CODE,AT_NUMBER,NVL(ST_BNM_GRADE,ST_ABS_LEVEL_ACHIEVED)"&
    "))  QUALIFICATIONNUMBER ,AA_BTEC_TITLE".

           02  FILLER PIC X(256) VALUE "  SPECIFICATIONCODE ,AT_NAME  SPECIFICATIONTITLE ,FN_GET_DFE_QUAL_TYPE(DECODE(ST_AWARD_ISSUE"&
    ",null ,DECODE(AW_AWARD_CODE,'FO','50098275','FS','50085001'),FN_GET_QCA_CODE(AW_AWARD_CODE,AT_NUMBER,NVL(ST_BNM_GRADE,ST_ABS_L"&
    "EVEL_ACHIEVED))))  QUALIFICATIONTYPE ,".

           02  FILLER PIC X(256) VALUE "'-2'  EXAMSERIES ,NVL(TO_CHAR(ST_REG_DATE,'YYYY-MM-DD'),'2999-12-31')  REGISTRATIONDATE ,NVL"&
    "(TO_CHAR(ST_AWARD_ISSUE,'YYYY-MM-DD'),'2999-12-31')  FIRSTENTRYDATE ,null   AWARDDATE ,DECODE(ST_AWARD_ISSUE,null ,'-2',DECODE"&
    "(NVL(ST_BNM_GRADE,ST_OVER_GRADE),null ".

           02  FILLER PIC X(256) VALUE ",'-2',DECODE(AW_AWARD_CODE,'FO','P',('E'||NVL(ST_OVER_GRADE, replace(NVL(ST_ABS_LEVEL_ACHIEV"&
    "ED,ST_BNM_GRADE),'E',null ))))))  QUALIFICATIONGRADE ,(-2)  PRIVATECANDIDATE ,(-2)  PARTIALABSENCE ,'O'  BTEC_NG_TYPE ,DECODE("&
    "ST_AWARD_ISSUE,null ,'N','Y')  CERT_IN".

           02  FILLER PIC X(256) VALUE "D ,ST_COURSE_ID  COURSE_ID ,AT_NUMBER  ,null   DRD_REC_TYPE ,null   DRD_ST_REG_NO ,null   DR"&
    "D_FORENAMES ,null   DRD_SURNAME ,null   DRD_SEX ,null   DRD_BIRTH_DATE ,null   DRD_NCN ,null   DRD_URN ,null   DRD_CENTRE_ID ,"&
    "null   DRD_UKPRN ,null   DRD_CENTRE_NA".

           02  FILLER PIC X(256) VALUE "ME ,null   DRD_ADDRESS_1 ,null   DRD_ADDRESS_2 ,null   DRD_ADDRESS_3 ,null   DRD_ADDRESS_4 ,"&
    "null   DRD_POSTCODE ,null   DRD_CENTRE_TYPE ,null   DRD_QUAL_NUM_TYPE ,null   DRD_QUAL_NUMBER ,null   DRD_SPEC_CODE ,null   DR"&
    "D_SPEC_TITLE ,null   DRD_QUAL_TYPE ,nu".

           02  FILLER PIC X(256) VALUE "ll   DRD_REG_DATE ,null   DRD_FIRST_ENTRY_DATE ,null   DRD_AWARD_DATE ,null   DRD_QUAL_GRADE"&
    "  from STUDENTS ,CENTRES ,LEGACY_CENTRES ,EDEXCEL_CENTRES ,APPROVAL_AWARDS ,APPROVAL_APPLICATION ,AWARD_TITLES where ((((((((("&
    "((ST_CENTRE_ID=CN_CENTRE_ID and CN_CEN".

           02  FILLER PIC X(256) VALUE "TRE_ID=LCEN_CENTRE_REF) and LCEN_ECEN_ID=ECEN_ID) and ST_COURSE_ID=AW_COURSE_NUMBER) and AW_"&
    "APPLICAT_NO=AA_APPLICAT_NO) and TO_NUMBER(AA_BTEC_TITLE)=AT_NUMBER) and LCEN_LTYP_ID=1) and AW_AWARD_CODE in ('FS','FO')) and "&
    "ST_DELETE is null ) and ST_FALLBACK is".

           02  FILLER PIC X(256) VALUE " null ) and (ST_AWARD_ISSUE between TO_DATE(:b4,'DD-MON-YYYY') and TO_DATE(:b5,'DD-MON-YYYY'"&
    ") or (ST_REG_DATE between TO_DATE(:b6,'DD-MON-YYYY') and TO_DATE(:b7,'DD-MON-YYYY') and ST_AWARD_ISSUE is null ))) and  not ex"&
    "ists (select 1   from DFE_REPORT_DETAI".

           02  FILLER PIC X(256) VALUE "LS where DRD_ST_REG_NO=ST_REG_NO)) union all select '-2'  UNIQUECANDIDATEIDENTIFIER ,'-2'  U"&
    "NIQUELEARNERNUMBER ,'-2'  UNIQUEPUPILNUMBER ,ST_REG_NO  CANDIDATEIDENTIFIEROTHER ,ST_FORENAMES  FIRSTNAMEDB ,NVL( trim(TRANSLA"&
    "TE(ST_FORENAMES,:b1,' ')),' ')  FIRSTN".

           02  FILLER PIC X(256) VALUE "AMERPT ,ST_SURNAME  SURNAMEDB ,NVL( trim(TRANSLATE(ST_SURNAME,:b1,' ')),' ')  SURNAMERPT ,DE"&
    "CODE(ST_SEX,'M','M','F','F','-2')  SEX , CASE  WHEN ST_BIRTH_DATE is null  THEN '2999-12-31' WHEN ST_BIRTH_DATE<=TO_DATE('1900"&
    "-01-01','YYYY-MM-DD') THEN '2999-12-31".

           02  FILLER PIC X(256) VALUE "' ELSE TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')  END   DOB ,FN_GET_NCN(ST_CENTRE_ID)  NCN ,NVL(EC"&
    "EN_URN,(-2))  CENTREURN ,'-2'  LAESTAB ,ST_CENTRE_ID  CENTREIDENTIFIEROTHER ,DECODE(LENGTH(ECEN_UKPRN),8,ECEN_UKPRN,(-2))  UKP"&
    "RN ,CN_CENTRE_NAME  CENTRENAME ,NVL(((".

           02  FILLER PIC X(256) VALUE "CN_ADDRESS_1||DECODE(CN_ADDRESS_1,null ,null ,' '))||CN_ADDRESS_2),' ')  CENTREADDRESS1 ,NVL"&
    "(CN_ADDRESS_3,' ')  CENTREADDRESS2 ,NVL(CN_TOWN,' ')  CENTREADDRESS3 ,NVL(CN_COUNTY,' ')  CENTREADDRESS4 ,NVL(CN_POSTCODE,'-2'"&
    ")  CENTREPOSTCODE ,DECODE(CN_BURE_BUNI".

           02  FILLER PIC X(256) VALUE "_ID,0,'12',DECODE(CN_STATUS,0,'9',2,'5',3,'1',4,'11',5,'2',6,'3',7,'1',8,'10',9,'12',10,'6',"&
    "11,'2',12,'13',13,'5',14,'13','13'))  CENTRETYPE ,DECODE(ST_AWARD_ISSUE,null ,DECODE(AW_AWARD_CODE,'FO','50098275','FS','50085"&
    "001'),FN_GET_QCA_CODE(AW_AWARD_CODE,AT".

           02  FILLER PIC X(256) VALUE "_NUMBER,NVL(ST_BNM_GRADE,ST_ABS_LEVEL_ACHIEVED)))  QUALIFICATIONNUMBER ,AA_BTEC_TITLE  SPECI"&
    "FICATIONCODE ,AT_NAME  SPECIFICATIONTITLE ,FN_GET_DFE_QUAL_TYPE(DECODE(ST_AWARD_ISSUE,null ,DECODE(AW_AWARD_CODE,'FO','5009827"&
    "5','FS','50085001'),FN_GET_QCA_CODE(AW".

           02  FILLER PIC X(256) VALUE "_AWARD_CODE,AT_NUMBER,NVL(ST_BNM_GRADE,ST_ABS_LEVEL_ACHIEVED))))  QUALIFICATIONTYPE ,'-2'  E"&
    "XAMSERIES ,NVL(TO_CHAR(ST_REG_DATE,'YYYY-MM-DD'),'2999-12-31')  REGISTRATIONDATE ,NVL(TO_CHAR(ST_AWARD_ISSUE,'YYYY-MM-DD'),'29"&
    "99-12-31')  FIRSTENTRYDATE ,null   AWA".

           02  FILLER PIC X(256) VALUE "RDDATE ,DECODE(ST_AWARD_ISSUE,null ,'-2',DECODE(NVL(ST_BNM_GRADE,ST_OVER_GRADE),null ,'-2',D"&
    "ECODE(AW_AWARD_CODE,'FO','P',('E'||NVL(ST_OVER_GRADE, replace(NVL(ST_ABS_LEVEL_ACHIEVED,ST_BNM_GRADE),'E',null ))))))  QUALIFI"&
    "CATIONGRADE ,(-2)  PRIVATECANDIDATE ,(".

           02  FILLER PIC X(256) VALUE "-2)  PARTIALABSENCE ,'O'  BTEC_NG_TYPE ,DECODE(ST_AWARD_ISSUE,null ,'N','Y')  CERT_IND ,ST_C"&
    "OURSE_ID  COURSE_ID ,AT_NUMBER  ,DRD_REC_TYPE  ,DRD_ST_REG_NO  ,DRD_FORENAMES  ,DRD_SURNAME  ,DRD_SEX  ,DRD_BIRTH_DATE  ,DRD_N"&
    "CN  ,DRD_URN  ,DRD_CENTRE_ID  ,DRD_UKP".

           02  FILLER PIC X(256) VALUE "RN  ,DRD_CENTRE_NAME  ,NVL(DRD_ADDRESS_1,' ')  ,NVL(DRD_ADDRESS_2,' ')  ,NVL(DRD_ADDRESS_3,'"&
    " ')  ,NVL(DRD_ADDRESS_4,' ')  ,DRD_POSTCODE  ,DRD_CENTRE_TYPE  ,DRD_QUAL_NUM_TYPE  ,DRD_QUAL_NUMBER  ,DRD_SPEC_CODE  ,DRD_SPEC"&
    "_TITLE  ,DRD_QUAL_TYPE  ,DRD_REG_DATE ".

           02  FILLER PIC X(256) VALUE " ,DRD_FIRST_ENTRY_DATE  ,DRD_AWARD_DATE  ,DRD_QUAL_GRADE   from STUDENTS ,DFE_REPORT_DETAILS"&
    " ,CENTRES ,LEGACY_CENTRES ,EDEXCEL_CENTRES ,APPROVAL_AWARDS ,APPROVAL_APPLICATION ,AWARD_TITLES where (((((((((((ST_REG_NO=DRD"&
    "_ST_REG_NO and ST_CENTRE_ID=CN_CENTRE_".

           02  FILLER PIC X(256) VALUE "ID) and CN_CENTRE_ID=LCEN_CENTRE_REF) and LCEN_ECEN_ID=ECEN_ID) and ST_COURSE_ID=AW_COURSE_N"&
    "UMBER) and AW_APPLICAT_NO=AA_APPLICAT_NO) and TO_NUMBER(AA_BTEC_TITLE)=AT_NUMBER) and LCEN_LTYP_ID=1) and AW_AWARD_CODE in ('F"&
    "S','FO')) and ST_DELETE is null ) and ".

           02  FILLER PIC X(256) VALUE "ST_FALLBACK is null ) and (((DRD_REC_TYPE in ('Result','Amendment') and ST_AWARD_ISSUE is  n"&
    "ot null ) and (TRUNC(SYSDATE)<=DRD_AMEND_CUTOFF_DATE or DECODE(NVL(ST_BNM_GRADE,ST_OVER_GRADE),null ,'-2',DECODE(AW_AWARD_CODE"&
    ",'FO','P',('E'||NVL(ST_OVER_GRADE, rep".

           02  FILLER PIC X(256) VALUE "lace(NVL(ST_ABS_LEVEL_ACHIEVED,ST_BNM_GRADE),'E',null )))))<>DRD_QUAL_GRADE)) or ((DRD_REC_T"&
    "YPE='Entry' and (UPPER(:b8)='NO' or (UPPER(:b8)='YES' and NVL(ST_AWARD_ISSUE,TO_DATE('2999-12-31','YYYY-MM-DD'))<=TO_DATE(:b5,"&
    "'DD-MON-YYYY')))) and DECODE(ST_AWARD_".

           02  FILLER PIC X(229) VALUE "ISSUE,null ,'-2',DECODE(NVL(ST_BNM_GRADE,ST_OVER_GRADE),null ,'-2',DECODE(AW_AWARD_CODE,'FO'"&
    ",'P',('E'||NVL(ST_OVER_GRADE, replace(NVL(ST_ABS_LEVEL_ACHIEVED,ST_BNM_GRADE),'E',null ))))))<>DRD_QUAL_GRADE))) order by 37,4"&
    "           ".

01  SQ0009 GLOBAL.
           02  FILLER PIC X(256) VALUE "select '-2'  UNIQUECANDIDATEIDENTIFIER ,'-2'  UNIQUELEARNERNUMBER ,'-2'  UNIQUEPUPILNUMBER ,"&
    "ST.ST_REG_NO  CANDIDATEIDENTIFIEROTHER ,ST.ST_FORENAMES  FIRSTNAMEDB ,NVL( trim(TRANSLATE(ST.ST_FORENAMES,:b1,' ')),' ')  FIRS"&
    "TNAMERPT ,ST.ST_SURNAME  SURNAMEDB ,NV".

           02  FILLER PIC X(256) VALUE "L( trim(TRANSLATE(ST.ST_SURNAME,:b1,' ')),' ')  SURNAMERPT ,DECODE(ST.ST_SEX,'M','M','F','F'"&
    ",'-2')  SEX , CASE  WHEN ST_BIRTH_DATE is null  THEN '2999-12-31' WHEN ST_BIRTH_DATE<=TO_DATE('1900-01-01','YYYY-MM-DD') THEN "&
    "'2999-12-31' ELSE TO_CHAR(ST_BIRTH_DAT".

           02  FILLER PIC X(256) VALUE "E,'YYYY-MM-DD')  END   DOB ,FN_GET_NCN(ST.ST_CENTRE_ID)  NCN ,NVL(ECEN_URN,(-2))  CENTREURN "&
    ",'-2'  LAESTAB ,ST.ST_CENTRE_ID  CENTREIDENTIFIEROTHER ,DECODE(LENGTH(ECEN_UKPRN),8,ECEN_UKPRN,(-2))  UKPRN ,CEN.CN_CENTRE_NAM"&
    "E  CENTRENAME ,NVL(((CEN.CN_ADDRESS_1|".

           02  FILLER PIC X(256) VALUE "|DECODE(CEN.CN_ADDRESS_1,null ,null ,' '))||CEN.CN_ADDRESS_2),' ')  CENTREADDRESS1 ,NVL(CEN."&
    "CN_ADDRESS_3,' ')  CENTREADDRESS2 ,NVL(CEN.CN_TOWN,' ')  CENTREADDRESS3 ,NVL(CEN.CN_COUNTY,' ')  CENTREADDRESS4 ,NVL(CEN.CN_PO"&
    "STCODE,'-2')  CENTREPOSTCODE ,DECODE(C".

           02  FILLER PIC X(256) VALUE "N_BURE_BUNI_ID,0,'12',DECODE(CN_STATUS,0,'9',2,'5',3,'1',4,'11',5,'2',6,'3',7,'1',8,'10',9,'"&
    "12',10,'6',11,'2',12,'13',13,'5',14,'13','13'))  CENTRETYPE ,NVL(NVQ.NVQ_QAN_CODE,ST.ST_NVQ_REGISTERED_ID)  QUALIFICATIONNUMBE"&
    "R ,ST.ST_NVQ_REGISTERED_ID  SPECIFICAT".

           02  FILLER PIC X(256) VALUE "IONCODE ,((NVQ.NVQ_TITLE_1||' ')||NVQ.NVQ_TITLE_2)  SPECIFICATIONTITLE ,FN_GET_DFE_QUAL_TYPE"&
    "(NVL(NVQ.NVQ_QAN_CODE,ST.ST_NVQ_REGISTERED_ID))  QUALIFICATIONTYPE ,'-2'  EXAMSERIES ,NVL(TO_CHAR(ST_REG_DATE,'YYYY-MM-DD'),'2"&
    "999-12-31')  REGISTRATIONDATE ,NVL(TO_".

           02  FILLER PIC X(256) VALUE "CHAR(ST_NVQ_CERTIFICATE_PRINT_DATE,'YYYY-MM-DD'),'2999-12-31')  FIRSTENTRYDATE ,null   AWARD"&
    "DATE ,DECODE(ST_NVQ_CERTIFICATE_PRINT_DATE,null ,'-2',NVL(ST_OVER_GRADE,'P'))  QUALIFICATIONGRADE ,(-2)  PRIVATECANDIDATE ,(-2"&
    ")  PARTIALABSENCE ,null   DRD_REC_TYPE".

           02  FILLER PIC X(256) VALUE " ,null   DRD_ST_REG_NO ,null   DRD_FORENAMES ,null   DRD_SURNAME ,null   DRD_SEX ,null   DRD"&
    "_BIRTH_DATE ,null   DRD_NCN ,null   DRD_URN ,null   DRD_CENTRE_ID ,null   DRD_UKPRN ,null   DRD_CENTRE_NAME ,null   DRD_ADDRES"&
    "S_1 ,null   DRD_ADDRESS_2 ,null   DRD_".

           02  FILLER PIC X(256) VALUE "ADDRESS_3 ,null   DRD_ADDRESS_4 ,null   DRD_POSTCODE ,null   DRD_CENTRE_TYPE ,null   DRD_QUA"&
    "L_NUM_TYPE ,null   DRD_QUAL_NUMBER ,null   DRD_SPEC_CODE ,null   DRD_SPEC_TITLE ,null   DRD_QUAL_TYPE ,null   DRD_REG_DATE ,nu"&
    "ll   DRD_FIRST_ENTRY_DATE ,null   DRD_".

           02  FILLER PIC X(256) VALUE "AWARD_DATE ,null   DRD_QUAL_GRADE  from STUDENTS ST ,NVQS NVQ ,CENTRES CEN ,LEGACY_CENTRES ,"&
    "EDEXCEL_CENTRES where ((((((((ST_NVQ_REGISTERED_ID=NVQ_ID and ST_CENTRE_ID=CN_CENTRE_ID) and CN_CENTRE_ID=LCEN_CENTRE_REF) and"&
    " LCEN_LTYP_ID=1) and LCEN_ECEN_ID=ECEN".

           02  FILLER PIC X(256) VALUE "_ID) and ST_DELETE is null ) and ST_FALLBACK is null ) and (ST_NVQ_CERTIFICATE_PRINT_DATE be"&
    "tween TO_DATE(:b2,'DD-MON-YYYY') and TO_DATE(:b3,'DD-MON-YYYY') or (ST_REG_DATE between TO_DATE(:b4,'DD-MON-YYYY') and TO_DATE"&
    "(:b5,'DD-MON-YYYY') and ST_NVQ_CERTIFI".

           02  FILLER PIC X(256) VALUE "CATE_PRINT_DATE is null ))) and  not exists (select 1   from DFE_REPORT_DETAILS where DRD_ST"&
    "_REG_NO=ST_REG_NO)) union all select '-2'  UNIQUECANDIDATEIDENTIFIER ,'-2'  UNIQUELEARNERNUMBER ,'-2'  UNIQUEPUPILNUMBER ,ST.S"&
    "T_REG_NO  CANDIDATEIDENTIFIEROTHER ,ST".

           02  FILLER PIC X(256) VALUE ".ST_FORENAMES  FIRSTNAMEDB ,NVL( trim(TRANSLATE(ST.ST_FORENAMES,:b1,' ')),' ')  FIRSTNAMERPT"&
    " ,ST.ST_SURNAME  SURNAMEDB ,NVL( trim(TRANSLATE(ST.ST_SURNAME,:b1,' ')),' ')  SURNAMERPT ,DECODE(ST.ST_SEX,'M','M','F','F','-2"&
    "')  SEX , CASE  WHEN ST_BIRTH_DATE is ".

           02  FILLER PIC X(256) VALUE "null  THEN '2999-12-31' WHEN ST_BIRTH_DATE<=TO_DATE('1900-01-01','YYYY-MM-DD') THEN '2999-12"&
    "-31' ELSE TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')  END   DOB ,FN_GET_NCN(ST.ST_CENTRE_ID)  NCN ,NVL(ECEN_URN,(-2))  CENTREURN ,'-2"&
    "'  LAESTAB ,ST.ST_CENTRE_ID  CENTREIDE".

           02  FILLER PIC X(256) VALUE "NTIFIEROTHER ,DECODE(LENGTH(ECEN_UKPRN),8,ECEN_UKPRN,(-2))  UKPRN ,CEN.CN_CENTRE_NAME  CENTR"&
    "ENAME ,NVL(((CEN.CN_ADDRESS_1||DECODE(CEN.CN_ADDRESS_1,null ,null ,' '))||CEN.CN_ADDRESS_2),' ')  CENTREADDRESS1 ,NVL(CEN.CN_A"&
    "DDRESS_3,' ')  CENTREADDRESS2 ,NVL(CEN".

           02  FILLER PIC X(256) VALUE ".CN_TOWN,' ')  CENTREADDRESS3 ,NVL(CEN.CN_COUNTY,' ')  CENTREADDRESS4 ,NVL(CEN.CN_POSTCODE,'"&
    "-2')  CENTREPOSTCODE ,DECODE(CN_BURE_BUNI_ID,0,'12',DECODE(CN_STATUS,0,'9',2,'5',3,'1',4,'11',5,'2',6,'3',7,'1',8,'10',9,'12',"&
    "10,'6',11,'2',12,'13',13,'5',14,'13','".

           02  FILLER PIC X(256) VALUE "13'))  CENTRETYPE ,NVL(NVQ.NVQ_QAN_CODE,ST.ST_NVQ_REGISTERED_ID)  QUALIFICATIONNUMBER ,ST.ST"&
    "_NVQ_REGISTERED_ID  SPECIFICATIONCODE ,((NVQ.NVQ_TITLE_1||' ')||NVQ.NVQ_TITLE_2)  SPECIFICATIONTITLE ,FN_GET_DFE_QUAL_TYPE(NVL"&
    "(NVQ.NVQ_QAN_CODE,ST.ST_NVQ_REGISTERED".

           02  FILLER PIC X(256) VALUE "_ID))  QUALIFICATIONTYPE ,'-2'  EXAMSERIES ,NVL(TO_CHAR(ST_REG_DATE,'YYYY-MM-DD'),'2999-12-3"&
    "1')  REGISTRATIONDATE ,NVL(TO_CHAR(ST_NVQ_CERTIFICATE_PRINT_DATE,'YYYY-MM-DD'),'2999-12-31')  FIRSTENTRYDATE ,null   AWARDDATE"&
    " ,DECODE(ST_NVQ_CERTIFICATE_PRINT_DATE".

           02  FILLER PIC X(256) VALUE ",null ,'-2',NVL(ST_OVER_GRADE,'P'))  QUALIFICATIONGRADE ,(-2)  PRIVATECANDIDATE ,(-2)  PARTI"&
    "ALABSENCE ,DRD_REC_TYPE  ,DRD_ST_REG_NO  ,DRD_FORENAMES  ,DRD_SURNAME  ,DRD_SEX  ,DRD_BIRTH_DATE  ,DRD_NCN  ,DRD_URN  ,DRD_CEN"&
    "TRE_ID  ,DRD_UKPRN  ,DRD_CENTRE_NAME  ".

           02  FILLER PIC X(256) VALUE ",NVL(DRD_ADDRESS_1,' ')  ,NVL(DRD_ADDRESS_2,' ')  ,NVL(DRD_ADDRESS_3,' ')  ,NVL(DRD_ADDRESS_"&
    "4,' ')  ,DRD_POSTCODE  ,DRD_CENTRE_TYPE  ,DRD_QUAL_NUM_TYPE  ,DRD_QUAL_NUMBER  ,DRD_SPEC_CODE  ,DRD_SPEC_TITLE  ,DRD_QUAL_TYPE"&
    "  ,DRD_REG_DATE  ,DRD_FIRST_ENTRY_DATE".

           02  FILLER PIC X(256) VALUE "  ,DRD_AWARD_DATE  ,DRD_QUAL_GRADE   from STUDENTS ST ,NVQS NVQ ,CENTRES CEN ,LEGACY_CENTRES"&
    " ,EDEXCEL_CENTRES ,DFE_REPORT_DETAILS where ((((((((ST_NVQ_REGISTERED_ID=NVQ_ID and ST_REG_NO=DRD_ST_REG_NO) and ST_CENTRE_ID="&
    "CN_CENTRE_ID) and CN_CENTRE_ID=LCEN_CE".

           02  FILLER PIC X(256) VALUE "NTRE_REF) and LCEN_LTYP_ID=1) and LCEN_ECEN_ID=ECEN_ID) and ST_DELETE is null ) and ST_FALLB"&
    "ACK is null ) and (((DRD_REC_TYPE in ('Result','Amendment') and ST_NVQ_CERTIFICATE_PRINT_DATE is  not null ) and (TRUNC(SYSDAT"&
    "E)<=DRD_AMEND_CUTOFF_DATE or NVL(ST_OV".

           02  FILLER PIC X(256) VALUE "ER_GRADE,'P')<>DRD_QUAL_GRADE)) or ((DRD_REC_TYPE='Entry' and (UPPER(:b6)='NO' or (UPPER(:b6"&
    ")='YES' and NVL(ST_NVQ_CERTIFICATE_PRINT_DATE,TO_DATE('2999-12-31','YYYY-MM-DD'))<=TO_DATE(:b3,'DD-MON-YYYY')))) and DECODE(ST"&
    "_NVQ_CERTIFICATE_PRINT_DATE,null ,'-2'".

           02  FILLER PIC X(65) VALUE ",NVL(ST_OVER_GRADE,'P'))<>DRD_QUAL_GRADE))) order by 4           ".

01  SQL-RUNTIME-VARS.
           02  SQL-IAPXIT-SUCCESS  PIC S9(9) COMP-5 VALUE    +0.
           02  SQL-IAPXIT-FAILURE  PIC S9(9) COMP-5 VALUE +1403.
           02  SQL-IAPXIT-FATALERR PIC S9(9) COMP-5 VALUE  +535.

01  SQLCUD GLOBAL.
           02     FILLER PIC S9(4) COMP-5 VALUE +13.
           02     FILLER PIC S9(4) COMP-5 VALUE +4130.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +5.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +539.
           02     FILLER PIC S9(4) COMP-5 VALUE +428.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +4.
           02     FILLER PIC S9(4) COMP-5 VALUE +4.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +10.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +10.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +36.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +43.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +513.
           02     FILLER PIC S9(4) COMP-5 VALUE +433.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +51.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +68.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +437.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +70.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +98.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +443.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +89.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +4.
           02     FILLER PIC S9(4) COMP-5 VALUE +105.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +456.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +108.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +5.
           02     FILLER PIC S9(4) COMP-5 VALUE +51.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +463.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +131.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +6.
           02     FILLER PIC S9(4) COMP-5 VALUE +60.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +469.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +150.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +7.
           02     FILLER PIC S9(4) COMP-5 VALUE +7141.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +521.
           02     FILLER PIC S9(4) COMP-5 VALUE +1189.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +29.
           02     FILLER PIC S9(4) COMP-5 VALUE +29.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +281.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +7.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +527.
           02     FILLER PIC S9(4) COMP-5 VALUE +1201.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +296.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +7.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +525.
           02     FILLER PIC S9(4) COMP-5 VALUE +1219.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +63.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +153.
           02     FILLER PIC S9(4) COMP-5 VALUE +6.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +563.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +8.
           02     FILLER PIC S9(4) COMP-5 VALUE +118.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +1356.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +590.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +10.
           02     FILLER PIC S9(4) COMP-5 VALUE +68.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +1662.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +609.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +9.
           02     FILLER PIC S9(4) COMP-5 VALUE +5953.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +521.
           02     FILLER PIC S9(4) COMP-5 VALUE +1669.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +11.
           02     FILLER PIC S9(4) COMP-5 VALUE +11.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +668.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +9.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +527.
           02     FILLER PIC S9(4) COMP-5 VALUE +1681.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +683.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +9.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +525.
           02     FILLER PIC S9(4) COMP-5 VALUE +1700.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +59.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +934.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +11.
           02     FILLER PIC S9(4) COMP-5 VALUE +68.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +2054.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +953.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +12.
           02     FILLER PIC S9(4) COMP-5 VALUE +12.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +541.
           02     FILLER PIC S9(4) COMP-5 VALUE +2099.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +968.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +13.
           02     FILLER PIC S9(4) COMP-5 VALUE +47.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +2125.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +987.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +14.
           02     FILLER PIC S9(4) COMP-5 VALUE +336.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +515.
           02     FILLER PIC S9(4) COMP-5 VALUE +2138.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +6.
           02     FILLER PIC S9(4) COMP-5 VALUE +6.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1026.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +15.
           02     FILLER PIC S9(4) COMP-5 VALUE +12.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +541.
           02     FILLER PIC S9(4) COMP-5 VALUE +2174.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1041.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +16.
           02     FILLER PIC S9(4) COMP-5 VALUE +68.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +517.
           02     FILLER PIC S9(4) COMP-5 VALUE +2185.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1060.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +17.
           02     FILLER PIC S9(4) COMP-5 VALUE +94.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +518.
           02     FILLER PIC S9(4) COMP-5 VALUE +2217.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +5.
           02     FILLER PIC S9(4) COMP-5 VALUE +5.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1095.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +18.
           02     FILLER PIC S9(4) COMP-5 VALUE +93.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +518.
           02     FILLER PIC S9(4) COMP-5 VALUE +2241.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +5.
           02     FILLER PIC S9(4) COMP-5 VALUE +5.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1130.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +19.
           02     FILLER PIC S9(4) COMP-5 VALUE +61.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +2328.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1157.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +20.
           02     FILLER PIC S9(4) COMP-5 VALUE +871.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +517.
           02     FILLER PIC S9(4) COMP-5 VALUE +2367.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +38.
           02     FILLER PIC S9(4) COMP-5 VALUE +38.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1324.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +21.
           02     FILLER PIC S9(4) COMP-5 VALUE +416.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +515.
           02     FILLER PIC S9(4) COMP-5 VALUE +2436.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +43.
           02     FILLER PIC S9(4) COMP-5 VALUE +43.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +3.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1511.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +22.
           02     FILLER PIC S9(4) COMP-5 VALUE +1341.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +516.
           02     FILLER PIC S9(4) COMP-5 VALUE +2534.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +70.
           02     FILLER PIC S9(4) COMP-5 VALUE +68.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +91.
           02     FILLER PIC S9(4) COMP-5 VALUE +6.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +91.
           02     FILLER PIC S9(4) COMP-5 VALUE +8.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +6.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +8.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +96.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +2.
           02     FILLER PIC S9(4) COMP-5 VALUE +68.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1806.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +23.
           02     FILLER PIC S9(4) COMP-5 VALUE +14.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +543.
           02     FILLER PIC S9(4) COMP-5 VALUE +2663.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
           02     FILLER PIC S9(4) COMP-5 VALUE +1.
           02     FILLER PIC S9(4) COMP-5 VALUE +0.
*       EXEC SQL BEGIN DECLARE SECTION END-EXEC.
*
01  DS01-COURSE-DETAILS.
    03  DS01-REC-TYPE               PIC X(9) OCCURS 500.
    03  DS01-UNIQUE-CANDIDATE-IDR   PIC X(13) OCCURS 500.
    03  DS01-UNIQUE-LEARNER-NUM     PIC X(10) OCCURS 500.
    03  DS01-UNIQUE-PUPIL-NUM       PIC X(2) OCCURS 500.
    03  DS01-CANDIDATE-IDR-OTHER    PIC X(7) OCCURS 500.
    03  DS01-FIRSTNAME-DB           PIC X(35) OCCURS 500.
    03  DS01-FIRSTNAME-RPT          PIC X(35) OCCURS 500.
    03  DS01-SURNAME-DB             PIC X(35) OCCURS 500.
    03  DS01-SURNAME-RPT            PIC X(35) OCCURS 500.
    03  DS01-GENDER                 PIC X(2) OCCURS 500.
    03  DS01-DOB                    PIC X(10) OCCURS 500.
    03  DS01-NCN                    PIC X(6) OCCURS 500.
    03  DS01-CENTREURN              PIC S9(6) 
*                                             COMP
                                              COMP-5
                                                   OCCURS 500.
    03  DS01-LEA                    PIC X(3) OCCURS 500.
    03  DS01-CENTRE-IDR-OTHER       PIC X(6) OCCURS 500.
    03  DS01-UKPRN                  PIC S9(8) 
*                                             COMP
                                              COMP-5
                                                   OCCURS 500.
    03  DS01-CENTRENAME             PIC X(65) OCCURS 500.
    03  DS01-CENTREADDRESS1         PIC X(150) OCCURS 500.
    03  DS01-CENTREADDRESS2         PIC X(36) OCCURS 500.
    03  DS01-CENTREADDRESS3         PIC X(30) OCCURS 500.
    03  DS01-CENTREADDRESS4         PIC X(25) OCCURS 500.
    03  DS01-CENTREPOSTCODE         PIC X(10) OCCURS 500.
    03  DS01-CENTRETYPE             PIC X(2) OCCURS 500.
    03  DS01-QUAL-NUMBER-TYPE       PIC X(5) OCCURS 500.
    03  DS01-QUAL-NUMBER            PIC X(10) OCCURS 500.
    03  DS01-SPEC-CODE              PIC X(8) OCCURS 500.
    03  DS01-SPEC-TITLE             PIC X(150) OCCURS 500.
    03  DS01-QUAL-TYPE              PIC X(100) OCCURS 500.
    03  DS01-EXAMSERIES             PIC X(2) OCCURS 500.
    03  DS01-REG-DATE               PIC X(10) OCCURS 500.
    03  DS01-FIRST-ENTRY-DATE       PIC X(10) OCCURS 500.
    03  DS01-AWARD-DATE             PIC X(10) OCCURS 500.
    03  DS01-QUAL-GRADE             PIC X(3) OCCURS 500.
    03  DS01-PRIVATE-CANDIDATE      PIC S9(4) 
*                                             COMP
                                              COMP-5
                                                    OCCURS 500.
    03  DS01-PARTIAL-ABSENCE        PIC S9(4) 
*                                             COMP
                                              COMP-5
                                                    OCCURS 500.
    03  DS01-CERT-IND               PIC X(1) OCCURS 500.
    03  DS01-COURSE                 PIC X(8) OCCURS 500.
    03  DS01-AT-NUMBER              PIC 9(6) OCCURS 500.
    03  DS01-BNM-TYPE               PIC X(1) OCCURS 500. 

01  DS02-COURSE-DETAILS.
    03  DS02-REC-TYPE               PIC X(9) OCCURS 500.
    03  DS02-CANDIDATE-IDR-OTHER    PIC X(7) OCCURS 500.
    03  DS02-FIRSTNAME-DB           PIC X(35) OCCURS 500.
    03  DS02-SURNAME-DB             PIC X(35) OCCURS 500.
    03  DS02-GENDER                 PIC X(2) OCCURS 500.
    03  DS02-DOB                    PIC X(10) OCCURS 500.
    03  DS02-NCN                    PIC X(6) OCCURS 500.
    03  DS02-CENTREURN              PIC S9(6) 
*                                             COMP
                                              COMP-5
                                                   OCCURS 500.
    03  DS02-CENTRE-IDR-OTHER       PIC X(6) OCCURS 500.
    03  DS02-UKPRN                  PIC S9(8) 
*                                             COMP
                                              COMP-5
                                                   OCCURS 500.
    03  DS02-CENTRENAME             PIC X(65) OCCURS 500.
    03  DS02-CENTREADDRESS1         PIC X(150) OCCURS 500.
    03  DS02-CENTREADDRESS2         PIC X(36) OCCURS 500.
    03  DS02-CENTREADDRESS3         PIC X(30) OCCURS 500.
    03  DS02-CENTREADDRESS4         PIC X(25) OCCURS 500.
    03  DS02-CENTREPOSTCODE         PIC X(10) OCCURS 500.
    03  DS02-CENTRETYPE             PIC X(2) OCCURS 500.
    03  DS02-QUAL-NUMBER-TYPE       PIC X(5) OCCURS 500.
    03  DS02-QUAL-NUMBER            PIC X(10) OCCURS 500.
    03  DS02-SPEC-CODE              PIC X(8) OCCURS 500.
    03  DS02-SPEC-TITLE             PIC X(150) OCCURS 500.
    03  DS02-QUAL-TYPE              PIC X(100) OCCURS 500.
    03  DS02-REG-DATE               PIC X(10) OCCURS 500.
    03  DS02-FIRST-ENTRY-DATE       PIC X(10) OCCURS 500.
    03  DS02-AWARD-DATE             PIC X(10) OCCURS 500.
    03  DS02-QUAL-GRADE             PIC X(3) OCCURS 500.

    03  WS-START-DATE               PIC  X(11).
    03  WS-END-DATE                 PIC  X(11).
    03  WS-AMEND-CUTOFF-DATE        PIC  X(11).
    03  WS-ACAD-YEAR-RERUN          PIC  X(3).
    03  WS-REG-START-DATE           PIC  X(11).
    03  WS-REG-END-DATE             PIC  X(11).
    03  WS-ACAD-START-DATE          PIC  X(11).
    03  WS-NG-GRADING-DATE          PIC  X(10).
    03  WS-CANDIDATE                PIC  X(7).
    03  WS-RESTRICT-SPL-CHARS       PIC  X(80).

    03  WS-RUN-DATE                 PIC  X(11).
    03  WS-REC-TYPE                 PIC  X(09).
    03  WS-PROCESS                  PIC  X(1).
        88 BTEC-PROCESS             VALUE 'B'.
        88 NVQ-PROCESS              VALUE 'N'.
    03  WS-BNM-TYPE                 PIC  X(1).
        88  BTEC-NG                 VALUE "G".
        88  BTEC                    VALUE "B".
        88  ALL-OTHERS              VALUE "O".
    03  WS-CERTIFICATE-IND          PIC  X(1).
        88  CERTIFICATED            VALUE "Y".
    03  WS-AWARD-DATE-FUTURE        PIC  X(1).
        88  AWARD-DATE-FUTURE       VALUE 'Y'.
    03  WS-DAUD-SEQUENCE            PIC S9(09) 
*                                              COMP
                                               COMP-5
                                                   .
    03  WS-START-OR-END             PIC  X(1).
        88  START-OF-RUN            VALUE "S".
        88  END-OF-RUN              VALUE "E".
    03  WS-DFE-INS-UPDAT          PIC  X(1).
        88  DFE-INS               VALUE "I".
        88  DFE-UPDAT             VALUE "U".
    03  WS-COL-UPDATE             PIC  X(1).
        88  COL-UPDATE            VALUE 'Y'.
    03  WS-RES-UPDATE             PIC  X(1).
        88  RES-UPDATE            VALUE 'Y'.
    03  WS-FIRST-TIME             PIC  X(1).
        88  FIRST-TIME            VALUE 'Y'.
    03  WS-IGN-FIRST-TIME         PIC  X(1).
        88  IGN-FIRST-TIME        VALUE 'Y'.
    03  WS-SKIP                   PIC X(1).
        88  SKIP                  VALUE 'Y'.
*
01  WS-ERR-MESSAGE                PIC X(132)
                                  VALUE SPACES.

01  WS-BLOCK-IND                  PIC  X(1).
    88  BLOCKED                   VALUE "Y".
01  WS-STATUS                     PIC X(1).
01  WS-STATUS-I                   PIC S9(4) 
*                                           COMP
                                            COMP-5
                                                .
01  WS-STATUS2                    PIC X(10).
01  WS-STATUS2-I                  PIC S9(4) 
*                                           COMP
                                            COMP-5
                                                .
01  WS-BLOCK-STATUS               PIC X(1).
01  WS-BLOCK-STATUS-I             PIC S9(4) 
*                                           COMP
                                            COMP-5
                                                .
01  WS-CHECK-UNITS                PIC X(1)  VALUE 'N'.
01  WS-NPP-ID                     PIC S9(6) 
*                                           COMP
                                            COMP-5
                                                .
01  WS-NPP-ID-I                   PIC S9(4) 
*                                           COMP
                                            COMP-5
                                                .
01  WS-DECISION-DATE              PIC X(11).
01  WS-DECISION-DATE-I            PIC S9(4) 
*                                           COMP
                                            COMP-5
                                                .
01  WS-MESSAGE                    PIC X(100).
01  WS-MESSAGE-I                  PIC S9(4) 
*                                           COMP
                                            COMP-5
                                                .
01  WS-TIME-DATE                  PIC X(17).
01  WS-USER-NAME                  PIC X(15) VALUE 'DFE_JOB'.
*
01  DS03-LOGIN.
    03  DS03-USERNAME             PIC  X(04) VALUE "ABCD".
    03  DS03-PASSWORD             PIC  X(04) VALUE "ABCD".
*
*       EXEC SQL END DECLARE SECTION END-EXEC.
*
*       EXEC SQL INCLUDE SQLCA END-EXEC.
01  SQLCA GLOBAL.
    05  SQLCAID               PIC X(8).
    05  SQLCABC               PIC S9(9) COMP-5.
    05  SQLCODE               PIC S9(9) COMP-5.
    05  SQLERRM.
        49 SQLERRML           PIC S9(4) COMP-5.
        49 SQLERRMC           PIC X(70).
    05  SQLERRP               PIC X(8).
    05  SQLERRD OCCURS 6 TIMES
                              PIC S9(9) COMP-5.
    05  SQLWARN.
        10 SQLWARN0           PIC X(1).
        10 SQLWARN1           PIC X(1).
        10 SQLWARN2           PIC X(1).
        10 SQLWARN3           PIC X(1).
        10 SQLWARN4           PIC X(1).
        10 SQLWARN5           PIC X(1).
        10 SQLWARN6           PIC X(1).
        10 SQLWARN7           PIC X(1).
    05  SQLEXT                PIC X(8).
*
01      WS-REC-LENGTH             PIC 9(4) 
*                                          COMP
                                           COMP-5
                                               .
*
01  WS01-GENERAL-STORAGE.
    03  WS01-ERR-MESSAGE          PIC  X(80).
    03  WS01-EOF-IND              PIC  X(01).
        88  WS01-EOF              VALUE "Y".
    03  WS01-ROWS-TOTAL           PIC S9(09) 
*                                            COMP
                                             COMP-5
                                                 .
    03  WS-BTEC-ROWS-TOTAL        PIC 9(9).
    03  WS-NVQ-ROWS-TOTAL         PIC 9(9).
    03  WS01-ROWS-THIS-FETCH      PIC S9(09) 
*                                            COMP
                                             COMP-5
                                                 .
    03  WS01-INDEX                PIC S9(09) 
*                                            COMP
                                             COMP-5
                                                 .
    03  WS01-ABORT                PIC  9(09) 
*                                            COMP
                                             COMP-5
                                                  VALUE 4.
*
01  WS-DRD-CURR-RECORD.
    03  WS-C-UNIQUE-CANDIDATE-IDR PIC X(13).
    03  WS-C-UNIQUE-LEARNER-NUM   PIC X(10).
    03  WS-C-UNIQUE-PUPIL-NUM     PIC X(2).
    03  WS-C-CANDIDATE-IDR-OTHER  PIC X(7).
    03  WS-C-FIRSTNAME            PIC X(35).
    03  WS-C-SURNAME              PIC X(35).
    03  WS-C-GENDER               PIC X(2).
    03  WS-C-DOB                  PIC X(10).
    03  WS-C-NCN                  PIC X(6).
    03  WS-C-CENTREURN            PIC S9(6) 
*                                           COMP
                                            COMP-5
                                                .
    03  WS-C-LEA                  PIC X(3).
    03  WS-C-CENTRE-IDR-OTHER     PIC X(6).
    03  WS-C-UKPRN                PIC S9(8) 
*                                           COMP
                                            COMP-5
                                                .
    03  WS-C-CENTRENAME           PIC X(65).
    03  WS-C-CENTREADDRESS1       PIC X(150).
    03  WS-C-CENTREADDRESS2       PIC X(36).
    03  WS-C-CENTREADDRESS3       PIC X(30).
    03  WS-C-CENTREADDRESS4       PIC X(25).
    03  WS-C-CENTREPOSTCODE       PIC X(10).
    03  WS-C-CENTRETYPE           PIC X(2).
    03  WS-C-QUAL-NUMBER-TYPE     PIC X(5).
    03  WS-C-QUAL-NUMBER          PIC X(10).
    03  WS-C-SPEC-CODE            PIC X(8).
    03  WS-C-SPEC-TITLE           PIC X(150).
    03  WS-C-QUAL-TYPE            PIC X(100).
    03  WS-C-EXAMSERIES           PIC X(2).
    03  WS-C-REG-DATE             PIC X(10).
    03  WS-C-FIRST-ENTRY-DATE     PIC X(10).
    03  WS-C-AWARD-DATE           PIC X(10).
    03  WS-C-QUAL-GRADE           PIC X(3).
    03  WS-C-PRIVATE-CANDIDATE    PIC S9(4) 
*                                           COMP
                                            COMP-5
                                                .
    03  WS-C-PARTIAL-ABSENCE      PIC S9(4) 
*                                           COMP
                                            COMP-5
                                                .
    03  WS-C-PROG-TYPE            PIC X(1).
*
01  WS-DRD-PREV-RECORD.
    03  WS-P-REC-TYPE             PIC X(9).
    03  WS-P-UNIQUE-CANDIDATE-IDR PIC X(13).
    03  WS-P-UNIQUE-LEARNER-NUM   PIC X(10).
    03  WS-P-CANDIDATE-IDR-OTHER  PIC X(7).
    03  WS-P-FIRSTNAME            PIC X(35).
    03  WS-P-SURNAME              PIC X(35).
    03  WS-P-GENDER               PIC X(2).
    03  WS-P-DOB                  PIC X(10).
    03  WS-P-NCN                  PIC X(6).
    03  WS-P-CENTREURN            PIC S9(6) 
*                                           COMP
                                            COMP-5
                                                .
    03  WS-P-CENTRE-IDR-OTHER     PIC X(6).
    03  WS-P-UKPRN                PIC S9(8) 
*                                           COMP
                                            COMP-5
                                                .
    03  WS-P-CENTRENAME           PIC X(65).
    03  WS-P-CENTREADDRESS1       PIC X(150).
    03  WS-P-CENTREADDRESS2       PIC X(36).
    03  WS-P-CENTREADDRESS3       PIC X(30).
    03  WS-P-CENTREADDRESS4       PIC X(25).
    03  WS-P-CENTREPOSTCODE       PIC X(10).
    03  WS-P-CENTRETYPE           PIC X(2).
    03  WS-P-QUAL-NUMBER-TYPE     PIC X(5).
    03  WS-P-QUAL-NUMBER          PIC X(10).
    03  WS-P-SPEC-CODE            PIC X(8).
    03  WS-P-SPEC-TITLE           PIC X(150).
    03  WS-P-QUAL-TYPE            PIC X(100).
    03  WS-P-REG-DATE             PIC X(10).
    03  WS-P-FIRST-ENTRY-DATE     PIC X(10).
    03  WS-P-AWARD-DATE           PIC X(10).
    03  WS-P-QUAL-GRADE           PIC X(3).
*
01  WS-COUNT-VAR.
    03  WS-BTEC-UPD-RESULT-CNT    PIC 9(9).
    03  WS-BTEC-UPD-AMEND-CNT     PIC 9(9).
    03  WS-BTEC-TOTAL-UPD-CNT     PIC 9(9).
    03  WS-BLOCKED-LEARNER-CNT    PIC 9(9).
    03  WS-BTEC-INSERT-CNT        PIC 9(9).
    03  WS-BTEC-CNT               PIC 9(9).
    03  WS-NVQ-CNT                PIC 9(9).
    03  WS-BTEC-SKIPPED-CNT       PIC 9(9).
    03  WS-BTEC-IGN-CNT           PIC 9(9).
    03  WS-NVQ-UPD-RESULT-CNT     PIC 9(9).
    03  WS-NVQ-UPD-AMEND-CNT      PIC 9(9).
    03  WS-NVQ-TOTAL-UPD-CNT      PIC 9(9).
    03  WS-NVQ-INSERT-CNT         PIC 9(9).
    03  WS-NVQ-SKIPPED-CNT        PIC 9(9).
    03  WS-NVQ-IGN-CNT            PIC 9(9).
    03  WS-CHECK-BLOCKING-CNT     PIC 9(9).
    03  WS-DFE-IGN-CNT            PIC 9(9).
*
01  WS-DFE-REPORT-HDR.
    03  FILLER                  PIC X(60) VALUE
       'RecordType, UniqueCandidateIdentifier, UniqueLearnerNumber, '. 
    03  FILLER                  PIC X(56) VALUE
       'UniquePupilNumber, CandidateIdentifierOther, FirstName, '.
    03  FILLER                  PIC X(57) VALUE
       'MiddleNames, Surname, Sex, DOB, NCN, CentreURN, LAESTAB, '.
    03  FILLER                  PIC X(58) VALUE
       'CentreIdentifierOther, UKPRN, CentreName, CentreAddress1, '.
    03  FILLER                  PIC X(64) VALUE
       'CentreAddress2, CentreAddress3, CentreAddress4, CentrePostCode, '.
    03  FILLER                  PIC X(58) VALUE
       'CentreType, QualificationNumberType, QualificationNumber, '.
    03  FILLER                  PIC X(58) VALUE
       'SpecificationCode, SpecificationTitle, QualificationType, '.
    03  FILLER                  PIC X(57) VALUE
       'ExamSeries, RegistrationDate, FirstEntryDate, AwardDate, '.
    03  FILLER                PIC X(52) VALUE
       'QualificationGrade, PrivateCandidate, PartialAbsence'.
*
01  WS-RPT-COLS.
    03  WS-RPT-FIRSTNAME            PIC X(35).
    03  WS-RPT-SURNAME              PIC X(35).
    03  WS-RPT-CENTREURN            PIC S9(6)
           SIGN LEADING SEPARATE VALUE -2.
    03  WS-RPT-UKPRN                PIC S9(8)
           SIGN LEADING SEPARATE VALUE -2.
    03  WS-RPT-CENTREPOSTCODE       PIC X(10).
    03  WS-RPT-QUAL-NUMBER          PIC X(10).
    03  WS-RPT-QUAL-TYPE            PIC X(100).
*
01  WS-DFE-REPORT-DETAIL            PIC X(850) VALUE SPACES.
01  WS-DFE-IGNORE-RPT               PIC X(80)  VALUE SPACES.
*
01  WS-DFE-IGNORE-LNR-HDR.
    03  FILLER                      PIC X(16)  VALUE
        'Ignored Learners'.
*
01  WS-DFE-IGNORE-LNR-DTL.
    03  WS-DFE-IGN-REG-NO           PIC X(7).
    03  FILLER                      PIC X(73).
*
01  WS-TOTALS-REPORT.
    03 WS-TR-HEAD-1.
       05 FILLER                  PIC X(11) VALUE 'Run Date :'.
       05 WS-TR-H1-RUN-DATE       PIC X(11).
       05 FILLER                  PIC X(104) VALUE SPACES.
       05 FILLER                  PIC X(6)  VALUE 'SSPDFE'.
    03 WS-TR-HEAD-2.
       05 FILLER                  PIC X(52) VALUE SPACES.
       05 FILLER                  PIC X(29) VALUE
         'DFEE Registration File Totals'.
       05 FILLER                  PIC X(51) VALUE SPACES.
    03 WS-TR-HEAD-3.
       05 FILLER                  PIC X(53) VALUE SPACES.
       05 WS-TR-H3-START-DATE PIC X(11).
       05 FILLER                  PIC X(4)  VALUE ' to '.
       05 WS-TR-H3-END-DATE PIC X(11).
       05 FILLER                  PIC X(53) VALUE SPACES.
    03 WS-TR-DETAIL.
       05 FILLER                  PIC X(14) VALUE SPACES.
       05 FILLER                  PIC X(7)  VALUE 'BTEC : '.
       05 WS-TR-DET-BTEC-TOTAL PIC Z(8)9.
       05 FILLER                  PIC X(28) VALUE SPACES.
       05 FILLER                  PIC X(7)  VALUE ' NVQ : '.
       05 WS-TR-DET-NVQ-TOTAL     PIC Z(8)9.
*
PROCEDURE DIVISION.
MAIN SECTION.
**********************************************************************
*                            
*       Main control section.
*
**********************************************************************
MAIN-START.
*
        MOVE 'S' TO WS-START-OR-END.

        PERFORM A-INITIALISE.

        MOVE   'Y'                 TO  WS-IGN-FIRST-TIME.

*BTEC Process 
        MOVE    ZERO               TO  WS01-ROWS-TOTAL.
        MOVE   "N"                 TO  WS01-EOF-IND.
        MOVE    'B'                TO  WS-PROCESS.
        MOVE   'Y'                 TO  WS-FIRST-TIME.
        PERFORM C-PROCESS-BTEC.

*NVQ Process 
        MOVE    ZERO               TO  WS01-ROWS-TOTAL.
        MOVE   "N"                 TO  WS01-EOF-IND.
        MOVE    'N'                TO  WS-PROCESS.
        MOVE   'Y'                 TO  WS-FIRST-TIME.
        PERFORM D-PROCESS-NVQ.
*
        MOVE 'E' TO WS-START-OR-END.

        PERFORM I-TERMINATE.
*
MAIN-EXIT.
*
        STOP RUN.
*
A-INITIALISE SECTION.
**********************************************************************
*
*       Open the file.
*       Log on to Oracle.
*
**********************************************************************
A-START.
*

        ACCEPT WS-START-DATE.
        ACCEPT WS-END-DATE.
        ACCEPT WS-AMEND-CUTOFF-DATE.
        ACCEPT WS-ACAD-YEAR-RERUN.
        ACCEPT WS-REG-START-DATE.
        ACCEPT WS-REG-END-DATE.

        
        OPEN    OUTPUT  CSV-FILE-B.
        OPEN    OUTPUT  CSV-FILE-N.
        OPEN    OUTPUT  IGNORE-RPT.
        OPEN    OUTPUT  TOTALS-RPT.
*
*       EXEC SQL WHENEVER SQLERROR GO TO   ZZ-ABORT END-EXEC.
*
        MOVE   "ERROR CONNECTING TO DATABASE"
                                   TO  WS01-ERR-MESSAGE.
*       EXEC SQL
*               CONNECT :DS03-USERNAME
*               IDENTIFIED BY :DS03-PASSWORD
*       END-EXEC.
        MOVE 10 TO SQL-ITERS
        MOVE 5 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            DS03-USERNAME IN
            DS03-LOGIN
            SQL-SQHSTV(1)
        MOVE 4 TO SQL-SQHSTL(1)
        MOVE 4 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            DS03-PASSWORD IN
            DS03-LOGIN
            SQL-SQHSTV(2)
        MOVE 4 TO SQL-SQHSTL(2)
        MOVE 4 TO SQL-SQHSTS(2)
        MOVE 0 TO SQL-SQINDV(2)
        MOVE 0 TO SQL-SQINDS(2)
        MOVE 0 TO SQL-SQHARM(2)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
*       EXEC SQL
*            ALTER SESSION SET OPTIMIZER_MODE=all_rows
*       END-EXEC.
        CALL "SQLADR" USING SQ0001 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 36 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
*       EXEC SQL
*           SELECT TO_CHAR (SYSDATE, 'DD-MON-YYYY:HH24:MI')
*           INTO   :WS-TIME-DATE
*           FROM   DUAL
*       END-EXEC.
        CALL "SQLADR" USING SQ0002 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 51 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            WS-TIME-DATE
            SQL-SQHSTV(1)
        MOVE 17 TO SQL-SQHSTL(1)
        MOVE 17 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.

*       EXEC SQL
*            SELECT RV_DESCRIPTION
*            INTO   :WS-RESTRICT-SPL-CHARS
*            FROM   REF_VALUES 
*            WHERE  RV_DOMAIN = 'SSDDFE'
*            AND    RV_CODE   = 'DFE_RSC'
*       END-EXEC.
        CALL "SQLADR" USING SQ0003 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 70 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(1)
        MOVE 80 TO SQL-SQHSTL(1)
        MOVE 80 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.

        DISPLAY ' SSPDFE STARTED AT : ' WS-TIME-DATE

        MOVE   "ERROR CALCULATING FIRST ENTRY DATE"
                                   TO  WS01-ERR-MESSAGE.
*
*       EXEC SQL
*         SELECT NVL(TO_CHAR(FN_FIRST_ENTRY_DATE(TRUNC(SYSDATE))
*           ,'YYYY-MM-DD'),'2999-12-31')
*         INTO   :WS-NG-GRADING-DATE
*         FROM DUAL
*       END-EXEC.
        CALL "SQLADR" USING SQ0004 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 89 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            WS-NG-GRADING-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(1)
        MOVE 10 TO SQL-SQHSTL(1)
        MOVE 10 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
*       EXEC SQL
*         SELECT FN_GET_ACAD_YEAR(:WS-START-DATE)
*         INTO   :WS-ACAD-START-DATE
*         FROM DUAL
*       END-EXEC.
        CALL "SQLADR" USING SQ0005 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 108 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            WS-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(1)
        MOVE 11 TO SQL-SQHSTL(1)
        MOVE 11 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            WS-ACAD-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(2)
        MOVE 11 TO SQL-SQHSTL(2)
        MOVE 11 TO SQL-SQHSTS(2)
        MOVE 0 TO SQL-SQINDV(2)
        MOVE 0 TO SQL-SQINDS(2)
        MOVE 0 TO SQL-SQHARM(2)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
*       EXEC SQL
*           SELECT TO_CHAR(SYSDATE,'DD-MON-YYYY') 
*             INTO WS-RUN-DATE
*             FROM DUAL
*       END-EXEC.
        CALL "SQLADR" USING SQ0006 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 131 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            WS-RUN-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(1)
        MOVE 11 TO SQL-SQHSTL(1)
        MOVE 11 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.

        PERFORM K-MAINTAIN-DAUD.
*
A-EXIT.
*
        EXIT.   
*
C-PROCESS-BTEC SECTION.
**********************************************************************
*
*       Read the required BTEC courses and registrations. 
*
**********************************************************************
C-START.
*
*       EXEC SQL
*          DECLARE GET_BTEC CURSOR FOR
*       SELECT 
*       '-2' AS UniqueCandidateIdentifier,
*       '-2' AS UniqueLearnerNumber,
*       '-2' AS UniquePupilNumber,
*       st_reg_no AS CandidateIdentifierOther,
*       st_forenames AS FirstNameDB,
*       NVL(TRIM(TRANSLATE(st_forenames,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS FirstNameRPT,
*       st_surname AS SurnameDB,
*       NVL(TRIM(TRANSLATE(st_surname,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS SurnameRPT,
*       DECODE(st_sex,'M','M','F','F','-2') AS Sex,
*       CASE 
*         WHEN ST_BIRTH_DATE IS NULL 
*           THEN '2999-12-31'
*         WHEN ST_BIRTH_DATE <= TO_DATE('1900-01-01','YYYY-MM-DD')
*           THEN '2999-12-31'
*         ELSE
*           TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')
*       END AS DOB,
*       fn_get_ncn(st_centre_id) AS NCN,
*       NVL(ecen_urn,-2) AS CentreURN, 
*       '-2' AS LAESTAB,
*       st_centre_id AS CentreIdentifierOther,
*       decode(LENGTH(ecen_ukprn),8,ecen_ukprn,-2) AS UKPRN,
*       cn_centre_name AS CentreName,
*       NVL(cn_address_1||DECODE(cn_address_1,NULL,NULL,' ')
*       ||cn_address_2,' ') AS CentreAddress1,
*       NVL(cn_address_3,' ') AS CentreAddress2,
*       NVL(cn_town,' ') AS CentreAddress3,
*       NVL(cn_county,' ') AS CentreAddress4,
*       NVL(cn_postcode,'-2') AS CentrePostcode,
*       DECODE(cn_bure_buni_id,0,'12',
*           DECODE(cn_status,0,'9',
*                            2,'5',
*                            3,'1',
*                            4,'11',
*                            5,'2',
*                            6,'3',
*                            7,'1',
*                            8,'10',
*                            9,'12',
*                            10,'6',
*                            11,'2',
*                            12,'13',
*                            13,'5',
*                            14,'13','13')) AS CentreType, 
*       aaco_qca_code
*        AS QualificationNumber,
*       AA_BTEC_TITLE AS SpecificationCode,
*       at_name AS SpecificationTitle,
*       FN_GET_DFE_QUAL_TYPE(aaco_qca_code) AS QualificationType,
*       '-2' AS ExamSeries,
*       NVL(TO_CHAR(st_reg_date,'YYYY-MM-DD'),'2999-12-31')
*        AS RegistrationDate,
*       CASE
*         WHEN AC_BNM_TYPE <> 'G' OR ST_AWARD_ISSUE IS NOT NULL
*           THEN  NVL(TO_CHAR(st_award_issue,'YYYY-MM-DD'),'2999-12-31')
*         WHEN ST_AWARD_ISSUE IS NULL AND ST_BNM_GRADE IS NULL
*           THEN '2999-12-31'
*         WHEN ST_AWARD_ISSUE IS NULL AND ST_BNM_GRADE IS NOT NULL 
*              AND (TO_DATE(:WS-NG-GRADING-DATE,'YYYY-MM-DD') > SYSDATE )
*           THEN 
*             FN_GET_LATEST_RESULT_DATE(st_reg_no,:ws-acad-start-date)
*         ELSE :WS-NG-GRADING-DATE
*       END AS FirstEntryDate,
*       NULL AS AwardDate,
*       DECODE(ac_bnm_type,
*              'G',
*               DECODE(st_award_issue,NULL,
*          DECODE(st_bnm_grade,NULL,'-2',
*               DECODE(aw_award_code,'Y6',
*                       DECODE(FN_CHECK_TA_GRADE_VISIBLE_EOL(ST_REG_NO),
*                              'Y',
*                              st_bnm_grade,
*                              '-2'
*                             ),
*            st_bnm_grade  
*            )
*           ), 
*                     NVL(NVL(st_over_grade,st_bnm_grade),'P')
*                     ),
*               DECODE(st_award_issue,
*                      NULL,
*                      '-2',
*                      NVL(NVL(st_over_grade,st_bnm_grade),'P')
*            )
*         ) AS QualificationGrade,
*       -2 AS PrivateCandidate,
*       -2 AS PartialAbsence,
*       DECODE(ac_bnm_type,'G','G','B') AS btec_ng_type,
*       DECODE(st_award_issue,NULL,'N','Y') AS Cert_Ind,
*       st_course_id AS Course_id,
*       at_number,
*       NULL AS drd_rec_type,
*       NULL AS drd_st_reg_no,
*       NULL AS drd_forenames,
*       NULL AS drd_surname,
*       NULL AS drd_sex,
*       NULL AS drd_birth_date, 
*       NULL AS drd_ncn,
*       NULL AS drd_urn,
*       NULL AS drd_centre_id,
*       NULL AS drd_ukprn,
*       NULL AS drd_centre_name,
*       NULL AS drd_address_1,
*       NULL AS drd_address_2,
*       NULL AS drd_address_3,
*       NULL AS drd_address_4,
*       NULL AS drd_postcode,
*       NULL AS drd_centre_type,
*       NULL AS drd_qual_num_type,
*       NULL AS drd_qual_number,
*       NULL AS drd_spec_code,
*       NULL AS drd_spec_title,
*       NULL AS drd_qual_type,
*       NULL AS drd_reg_date,
*       NULL AS drd_first_entry_date,
*       NULL AS drd_award_date,
*       NULL AS drd_qual_grade
*       FROM students x,
*            centres,
*            legacy_centres,
*            edexcel_centres,
*            approval_awards,
*            approval_application,
*            at_award_codes,
*            award_titles,
*            award_codes
*       WHERE st_centre_id             = cn_centre_id
*         AND cn_centre_id             = lcen_centre_ref
*         AND lcen_ecen_id             = ecen_id  
*         AND st_course_id             = aw_course_number
*         AND aw_applicat_no           = aa_applicat_no
*         AND TO_NUMBER(aa_btec_title) = at_number
*         AND aaco_at_number           = at_number
*         AND aaco_ac_code             = aw_award_code
*         AND ac_code                  = aw_award_code
*         AND aaco_qca_code            IS NOT NULL
*         AND st_delete                IS NULL
*         AND st_fallback              IS NULL
*         AND st_university_ind        IS NULL
*         AND lcen_ltyp_id             = 1
*         AND aw_award_code NOT IN 
*            ('01','02','03','04','05','06','11',
*             '27','64','35','63','93','HH','GG',
*             'GA','GB','CC','EW','FS','FO')
*         AND (
*               (st_award_issue 
*                BETWEEN TO_DATE(:WS-START-DATE,'DD-MON-YYYY') 
*                    AND TO_DATE(:WS-END-DATE,'DD-MON-YYYY')
*               )
*         OR
*               (st_reg_date 
*                 BETWEEN TO_DATE(:WS-REG-START-DATE,'DD-MON-YYYY') 
*                     AND TO_DATE(:WS-REG-END-DATE,'DD-MON-YYYY')
*           AND st_award_issue IS NULL
*               )
*             )
*          AND NOT EXISTS 
*              (SELECT 1
*                 FROM dfe_report_details
*                WHERE drd_st_reg_no = st_reg_no
*              )
*       UNION ALL
*       SELECT 
*       '-2' AS UniqueCandidateIdentifier,
*       '-2' AS UniqueLearnerNumber,
*       '-2' AS UniquePupilNumber,
*       st_reg_no AS CandidateIdentifierOther,
*       st_forenames AS FirstNameDB,
*       NVL(TRIM(TRANSLATE(st_forenames,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS FirstNameRPT,
*       st_surname AS SurnameDB,
*       NVL(TRIM(TRANSLATE(st_surname,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS SurnameRPT,
*       DECODE(st_sex,'M','M','F','F','-2') AS Sex,
*       CASE 
*         WHEN ST_BIRTH_DATE IS NULL 
*           THEN '2999-12-31'
*         WHEN ST_BIRTH_DATE <= TO_DATE('1900-01-01','YYYY-MM-DD')
*           THEN '2999-12-31'
*         ELSE
*           TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')
*       END AS DOB,
*       fn_get_ncn(st_centre_id) AS NCN,
*       NVL(ecen_urn,-2) AS CentreURN, 
*       '-2' AS LAESTAB,
*       st_centre_id AS CentreIdentifierOther,
*       decode(LENGTH(ecen_ukprn),8,ecen_ukprn,-2) AS UKPRN,
*       cn_centre_name AS CentreName,
*       NVL(cn_address_1||
*       decode(cn_address_1,null,null,' ')
*       ||cn_address_2,' ') AS CentreAddress1,
*       NVL(cn_address_3,' ') AS CentreAddress2,
*       NVL(cn_town,' ') AS CentreAddress3,
*       NVL(cn_county,' ') AS CentreAddress4,
*       NVL(cn_postcode,'-2') AS CentrePostcode,
*       DECODE(cn_bure_buni_id,0,'12',
*           DECODE(cn_status,0,'9',
*                            2,'5',
*                            3,'1',
*                            4,'11',
*                            5,'2',
*                            6,'3',
*                            7,'1',
*                            8,'10',
*                            9,'12',
*                            10,'6',
*                            11,'2',
*                            12,'13',
*                            13,'5',
*                            14,'13','13')) AS CentreType, 
*       aaco_qca_code
*         AS QualificationNumber,
*       AA_BTEC_TITLE AS SpecificationCode,
*       at_name AS SpecificationTitle,
*       FN_GET_DFE_QUAL_TYPE(aaco_qca_code) AS QualificationType,
*       '-2' AS ExamSeries,
*       NVL(TO_CHAR(st_reg_date,'YYYY-MM-DD'),'2999-12-31')
*        AS RegistrationDate,
*       CASE
*         WHEN AC_BNM_TYPE <> 'G' OR ST_AWARD_ISSUE IS NOT NULL
*           THEN  NVL(TO_CHAR(st_award_issue,'YYYY-MM-DD'),'2999-12-31')
*         WHEN ST_AWARD_ISSUE IS NULL AND ST_BNM_GRADE IS NULL
*           THEN '2999-12-31'
*         WHEN ST_AWARD_ISSUE IS NULL AND ST_BNM_GRADE IS NOT NULL 
*              AND (TO_DATE(:WS-NG-GRADING-DATE,'YYYY-MM-DD') > SYSDATE )
*           THEN 
*             FN_GET_LATEST_RESULT_DATE(st_reg_no,:ws-acad-start-date)
*         ELSE :WS-NG-GRADING-DATE
*       END AS FirstEntryDate,
*       NULL AS AwardDate,
*       DECODE(ac_bnm_type,
*              'G',
*               DECODE(st_award_issue,NULL,
*          DECODE(st_bnm_grade,NULL,'-2',
*               DECODE(aw_award_code,'Y6',
*                  DECODE(FN_CHECK_TA_GRADE_VISIBLE_EOL(ST_REG_NO),
*                              'Y',
*                              st_bnm_grade,
*                              '-2'
*                             ),
*            st_bnm_grade  
*            )
*           ), 
*                     NVL(NVL(st_over_grade,st_bnm_grade),'P')
*                     ),
*               DECODE(st_award_issue,
*                      NULL,
*                      '-2',
*                      NVL(NVL(st_over_grade,st_bnm_grade),'P')
*            )
*         ) AS QualificationGrade,
*       -2 AS PrivateCandidate,
*       -2 AS PartialAbsence,
*       DECODE(ac_bnm_type,'G','G','B') AS btec_ng_type,
*       DECODE(st_award_issue,NULL,'N','Y') AS Cert_Ind,
*       st_course_id AS Course_id,
*       at_number,
*       drd_rec_type,
*       drd_st_reg_no,
*       drd_forenames,
*       drd_surname,
*       drd_sex,
*       drd_birth_date,
*       drd_ncn,
*       drd_urn,
*       drd_centre_id,
*       drd_ukprn,
*       drd_centre_name,
*       NVL(drd_address_1,' '),
*       NVL(drd_address_2,' '),
*       NVL(drd_address_3,' '),
*       NVL(drd_address_4,' '),
*       drd_postcode,
*       drd_centre_type,
*       drd_qual_num_type,
*       drd_qual_number,
*       drd_spec_code,
*       drd_spec_title,
*       drd_qual_type,
*       drd_reg_date,
*       drd_first_entry_date,
*       drd_award_date,
*       drd_qual_grade
*       FROM students,
*         dfe_report_details,
*            centres,
*            legacy_centres,
*            edexcel_centres,
*            approval_awards,
*            approval_application,
*            at_award_codes,
*            award_titles,
*            award_codes
*       WHERE st_reg_no                = drd_st_reg_no
*         AND st_centre_id             = cn_centre_id
*         AND cn_centre_id             = lcen_centre_ref
*         AND lcen_ecen_id             = ecen_id
*         AND st_course_id             = aw_course_number
*         AND aw_applicat_no           = aa_applicat_no
*         AND TO_NUMBER(aa_btec_title) = at_number
*         AND aw_award_code            = aaco_ac_code
*         AND at_number                = aaco_at_number
*         AND aw_award_code            = ac_code
*         AND aaco_qca_code              IS NOT NULL
*         AND st_delete                  IS NULL
*         AND st_fallback                IS NULL
*         AND st_university_ind          IS NULL
*         AND lcen_ltyp_id             = 1
*         AND aw_award_code NOT IN 
*            ('01','02','03','04','05','06','11',
*             '27','64','35','63','93','HH','GG',
*             'GA','GB','CC','EW','FS','FO')
*         AND ((drd_rec_type IN ('Result','Amendment') AND
*               (
*          (ac_bnm_type = 'G' AND st_bnm_grade IS NOT NULL AND 
*             ( st_bnm_grade <> drd_qual_grade OR
*                (TRUNC(SYSDATE) <= drd_amend_cutoff_date)
*              )
*          ) OR 
*                (ac_bnm_type <> 'G' AND st_award_issue IS NOT NULL AND
*                   (TRUNC(SYSDATE) <= drd_amend_cutoff_date OR 
*                     ( NVL(NVL(st_over_grade,st_bnm_grade),'P')
*                       <> drd_qual_grade
*                     )
*                   )
*                 )
*                )
*             )
*             OR       
*           (drd_rec_type = 'Entry' AND 
*           (UPPER(:WS-ACAD-YEAR-RERUN) = 'NO' OR
*              (UPPER(:WS-ACAD-YEAR-RERUN) = 'YES' AND
*               NVL(st_award_issue,
*                   TO_DATE(:WS-NG-GRADING-DATE,'YYYY-MM-DD'))
*                   <= TO_DATE(:WS-END-DATE,'DD-MON-YYYY'))
*            ) AND
*           (DECODE
*         (ac_bnm_type,
*              'G',
*               DECODE(st_award_issue,NULL,
*          DECODE(st_bnm_grade,NULL,'-2',
*               DECODE(aw_award_code,'Y6',
*                  DECODE(FN_CHECK_TA_GRADE_VISIBLE_EOL(ST_REG_NO),
*                              'Y',
*                              st_bnm_grade,
*                              '-2'
*                             ),
*            st_bnm_grade  
*            )
*           ), 
*                     NVL(NVL(st_over_grade,st_bnm_grade),'P')
*                     ),
*               DECODE(st_award_issue,
*                      NULL,
*                      '-2',
*                      NVL(NVL(st_over_grade,st_bnm_grade),'P')
*            )
*         ) <> drd_qual_grade)
*         ) 
*             )
*       UNION ALL
*       SELECT
*       '-2' AS UniqueCandidateIdentifier,
*       '-2' AS UniqueLearnerNumber,
*       '-2' AS UniquePupilNumber,
*       st_reg_no AS CandidateIdentifierOther,
*       st_forenames AS FirstNameDB,
*       NVL(TRIM(TRANSLATE(st_forenames,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS FirstNameRPT,
*       st_surname AS SurnameDB,
*       NVL(TRIM(TRANSLATE(st_surname,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS SurnameRPT,
*       DECODE(st_sex,'M','M','F','F','-2') AS Sex,
*       CASE 
*         WHEN ST_BIRTH_DATE IS NULL 
*           THEN '2999-12-31'
*         WHEN ST_BIRTH_DATE <= TO_DATE('1900-01-01','YYYY-MM-DD')
*           THEN '2999-12-31'
*         ELSE
*           TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')
*       END AS DOB,
*       fn_get_ncn(st_centre_id) AS NCN,
*       NVL(ecen_urn,-2) AS CentreURN, 
*       '-2' AS LAESTAB,
*       st_centre_id AS CentreIdentifierOther,
*       decode(LENGTH(ecen_ukprn),8,ecen_ukprn,-2) AS UKPRN,
*       cn_centre_name AS CentreName,
*       NVL(cn_address_1||DECODE(cn_address_1,NULL,NULL,' ')
*       ||cn_address_2,' ') AS CentreAddress1,
*       NVL(cn_address_3,' ') AS CentreAddress2,
*       NVL(cn_town,' ') AS CentreAddress3,
*       NVL(cn_county,' ') AS CentreAddress4,
*       NVL(cn_postcode,'-2') AS CentrePostcode,
*       DECODE(cn_bure_buni_id,0,'12',
*           DECODE(cn_status,0,'9',
*                            2,'5',
*                            3,'1',
*                            4,'11',
*                            5,'2',
*                            6,'3',
*                            7,'1',
*                            8,'10',
*                            9,'12',
*                            10,'6',
*                            11,'2',
*                            12,'13',
*                            13,'5',
*                            14,'13','13')) AS CentreType,
*       DECODE(st_award_issue,NULL,
*              DECODE(aw_award_code,
*                     'FO','50098275',
*                     'FS','50085001'
*                    ),
*              fn_get_qca_code(aw_award_code,at_number,
*            NVL(st_bnm_grade,st_abs_level_achieved))
*          ) AS QualificationNumber,
*       AA_BTEC_TITLE AS SpecificationCode,
*       at_name AS SpecificationTitle,
*       FN_GET_DFE_QUAL_TYPE(DECODE(st_award_issue,NULL,
*             DECODE(aw_award_code,
*                    'FO','50098275',
*                    'FS','50085001'
*                   ),
*             fn_get_qca_code(aw_award_code,at_number,
*              NVL(st_bnm_grade,st_abs_level_achieved))
*        )) AS QualificationType,
*       '-2' AS ExamSeries,
*       NVL(TO_CHAR(st_reg_date,'YYYY-MM-DD'),'2999-12-31')
*        AS RegistrationDate,
*       NVL(TO_CHAR(st_award_issue,'YYYY-MM-DD'),'2999-12-31')
*        AS FirstEntryDate,
*       NULL AS AwardDate,
*       DECODE(st_award_issue,NULL,'-2',
*          DECODE(NVL(st_bnm_grade,st_over_grade),
*              NULL,
*              '-2',
*                   DECODE(aw_award_code,
*                          'FO','P',
*                          'E'||NVL(st_over_grade,     
*                             REPLACE(NVL(st_abs_level_achieved,
*                                         st_bnm_grade),'E',NULL))
*                          ) 
*                            
*                )
*            ) AS QualificationGrade,
*       -2 AS PrivateCandidate,
*       -2 AS PartialAbsence,
*       'O' AS btec_ng_type,
*       DECODE(st_award_issue,NULL,'N','Y') AS Cert_Ind,
*       st_course_id AS Course_id,
*       at_number,
*       NULL AS drd_rec_type,
*       NULL AS drd_st_reg_no,
*       NULL AS drd_forenames,
*       NULL AS drd_surname,
*       NULL AS drd_sex,
*       NULL AS drd_birth_date,
*       NULL AS drd_ncn,
*       NULL AS drd_urn,
*       NULL AS drd_centre_id,
*       NULL AS drd_ukprn,
*       NULL AS drd_centre_name,
*       NULL AS drd_address_1,
*       NULL AS drd_address_2,
*       NULL AS drd_address_3,
*       NULL AS drd_address_4,
*       NULL AS drd_postcode,
*       NULL AS drd_centre_type,
*       NULL AS drd_qual_num_type,
*       NULL AS drd_qual_number,
*       NULL AS drd_spec_code,
*       NULL AS drd_spec_title,
*       NULL AS drd_qual_type,
*       NULL AS drd_reg_date,
*       NULL AS drd_first_entry_date,
*       NULL AS drd_award_date,
*       NULL AS drd_qual_grade
*       FROM students,
*            centres,
*            legacy_centres,
*            edexcel_centres,
*            approval_awards,
*            approval_application,
*            award_titles
*       WHERE st_centre_id             = cn_centre_id
*         AND cn_centre_id             = lcen_centre_ref
*         AND lcen_ecen_id             = ecen_id
*         AND st_course_id             = aw_course_number
*         AND aw_applicat_no       = aa_applicat_no
*         AND TO_NUMBER(aa_btec_title) = at_number
*         AND lcen_ltyp_id             = 1
*         AND aw_award_code IN ('FS','FO')
*         AND st_delete                IS NULL
*         AND st_fallback              IS NULL
*         AND (
*               (st_award_issue 
*                BETWEEN TO_DATE(:WS-START-DATE,'DD-MON-YYYY') 
*                    AND TO_DATE(:WS-END-DATE,'DD-MON-YYYY')
*               )
*               OR
*               (st_reg_date 
*                 BETWEEN TO_DATE(:WS-REG-START-DATE,'DD-MON-YYYY') 
*                     AND TO_DATE(:WS-REG-END-DATE,'DD-MON-YYYY')
*                 AND st_award_issue IS NULL
*               )
*             )
*          AND NOT EXISTS 
*               (SELECT 1
*                  FROM dfe_report_details
*                 WHERE drd_st_reg_no = st_reg_no
*               )
*       UNION ALL
*       SELECT
*       '-2' AS UniqueCandidateIdentifier,
*       '-2' AS UniqueLearnerNumber,
*       '-2' AS UniquePupilNumber,
*       st_reg_no AS CandidateIdentifierOther,
*       st_forenames AS FirstNameDB,
*       NVL(TRIM(TRANSLATE(st_forenames,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS FirstNameRPT,
*       st_surname AS SurnameDB,
*       NVL(TRIM(TRANSLATE(st_surname,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS SurnameRPT,
*       DECODE(st_sex,'M','M','F','F','-2') AS Sex,
*       CASE 
*         WHEN ST_BIRTH_DATE IS NULL 
*           THEN '2999-12-31'
*         WHEN ST_BIRTH_DATE <= TO_DATE('1900-01-01','YYYY-MM-DD')
*           THEN '2999-12-31'
*         ELSE
*           TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')
*       END AS DOB,
*       fn_get_ncn(st_centre_id) AS NCN,
*       NVL(ecen_urn,-2) AS CentreURN, 
*       '-2' AS LAESTAB,
*       st_centre_id AS CentreIdentifierOther,
*       decode(LENGTH(ecen_ukprn),8,ecen_ukprn,-2) AS UKPRN,
*       cn_centre_name AS CentreName,
*       NVL(cn_address_1||
*       decode(cn_address_1,null,null,' ')
*       ||cn_address_2,' ') AS CentreAddress1,
*       NVL(cn_address_3,' ') AS CentreAddress2,
*       NVL(cn_town,' ') AS CentreAddress3,
*       NVL(cn_county,' ') AS CentreAddress4,
*       NVL(cn_postcode,'-2') AS CentrePostcode,
*       DECODE(cn_bure_buni_id,0,'12',
*           DECODE(cn_status,0,'9',
*                            2,'5',
*                            3,'1',
*                            4,'11',
*                            5,'2',
*                            6,'3',
*                            7,'1',
*                            8,'10',
*                            9,'12',
*                            10,'6',
*                            11,'2',
*                            12,'13',
*                            13,'5',
*                            14,'13','13')) AS CentreType,
*       DECODE(st_award_issue,NULL,
*              DECODE(aw_award_code,
*                     'FO','50098275',
*                     'FS','50085001'
*                    ),
*              fn_get_qca_code(aw_award_code,at_number,
*               NVL(st_bnm_grade,st_abs_level_achieved))
*             ) AS QualificationNumber,
*       AA_BTEC_TITLE AS SpecificationCode,
*       at_name AS SpecificationTitle,
*       FN_GET_DFE_QUAL_TYPE(DECODE(st_award_issue,NULL,
*              DECODE(aw_award_code,
*                     'FO','50098275',
*                     'FS','50085001'
*                    ),
*              fn_get_qca_code(aw_award_code,at_number,
*               NVL(st_bnm_grade,st_abs_level_achieved))
*        )) AS QualificationType,
*       '-2' AS ExamSeries,
*       NVL(TO_CHAR(st_reg_date,'YYYY-MM-DD'),'2999-12-31')
*        AS RegistrationDate,
*       NVL(TO_CHAR(st_award_issue,'YYYY-MM-DD'),'2999-12-31')
*        AS FirstEntryDate,
*       NULL AS AwardDate,
*       DECODE(st_award_issue,NULL,'-2',
*          DECODE(NVL(st_bnm_grade,st_over_grade),
*              NULL,
*              '-2',
*                   DECODE(aw_award_code,
*                          'FO','P',
*                          'E'||NVL(st_over_grade,     
*                                    REPLACE(NVL(st_abs_level_achieved,
*                                                st_bnm_grade),'E',NULL))
*                          ) 
*                            
*                )
*            ) AS QualificationGrade,
*       -2 AS PrivateCandidate,
*       -2 AS PartialAbsence,
*       'O' AS btec_ng_type,
*       DECODE(st_award_issue,NULL,'N','Y') AS Cert_Ind,
*       st_course_id AS Course_id,
*       at_number,
*       drd_rec_type,
*       drd_st_reg_no,
*       drd_forenames,
*       drd_surname,
*       drd_sex,
*       drd_birth_date,
*       drd_ncn,
*       drd_urn,
*       drd_centre_id,
*       drd_ukprn,
*       drd_centre_name,
*       NVL(drd_address_1,' '),
*       NVL(drd_address_2,' '),
*       NVL(drd_address_3,' '),
*       NVL(drd_address_4,' '),
*       drd_postcode,
*       drd_centre_type,
*       drd_qual_num_type,
*       drd_qual_number,
*       drd_spec_code,
*       drd_spec_title,
*       drd_qual_type,
*       drd_reg_date,
*       drd_first_entry_date,
*       drd_award_date,
*       drd_qual_grade
*       FROM students,
*         dfe_report_details,
*            centres,
*            legacy_centres,
*            edexcel_centres,
*            approval_awards,
*            approval_application,
*            award_titles
*       WHERE st_reg_no       = drd_st_reg_no
*         AND st_centre_id             = cn_centre_id
*         AND cn_centre_id             = lcen_centre_ref
*         AND lcen_ecen_id             = ecen_id
*         AND st_course_id             = aw_course_number
*         AND aw_applicat_no       = aa_applicat_no
*         AND TO_NUMBER(aa_btec_title) = at_number
*         AND lcen_ltyp_id             = 1
*         AND aw_award_code IN ('FS','FO')   
*         AND st_delete                IS NULL                                               
*         AND st_fallback              IS NULL
*         AND ((drd_rec_type IN ('Result','Amendment') AND 
*               st_award_issue IS NOT NULL AND
*                (TRUNC(SYSDATE) <= drd_amend_cutoff_date OR 
*                  (DECODE(NVL(st_bnm_grade,st_over_grade),
*                        NULL,'-2',
*                          DECODE(aw_award_code,
*                                 'FO','P',
*                                 'E'||NVL(st_over_grade,     
*                                    REPLACE(NVL(st_abs_level_achieved,
*                                            st_bnm_grade),'E',NULL))
*                                )                     
*                             )
*                        <> drd_qual_grade 
*                  )
*                )
*              )
*             OR       
*           (drd_rec_type = 'Entry' AND 
*           (UPPER(:WS-ACAD-YEAR-RERUN) = 'NO' OR
*              (UPPER(:WS-ACAD-YEAR-RERUN) = 'YES' AND
*               NVL(st_award_issue,TO_DATE('2999-12-31','YYYY-MM-DD'))
*                   <= TO_DATE(:WS-END-DATE,'DD-MON-YYYY'))
*           ) AND
*           (DECODE(st_award_issue,NULL,'-2',
*             DECODE(NVL(st_bnm_grade,st_over_grade),
*                 NULL,'-2',
*                   DECODE(aw_award_code,
*                          'FO','P',
*                          'E'||NVL(st_over_grade,     
*                             REPLACE(NVL(st_abs_level_achieved,
*                                     st_bnm_grade),'E',NULL))
*                         )                     
*                      )
*                     ) <> drd_qual_grade
*            )
*           )   
*       )
*ORDER BY at_number, Student reg no
*        ORDER BY 35, 4
*EC5877 - Update to the Order By Column (at_number) position
*        ORDER BY 37, 4
*       END-EXEC.

        MOVE   "C: ERROR OPENING BTEC COURSES CURSOR"
                                   TO  WS01-ERR-MESSAGE. 
*    
        DISPLAY "BTEC Process Started...".
*       EXEC SQL
*           OPEN GET_BTEC
*       END-EXEC.
        CALL "SQLADR" USING SQ0007 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 150 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        MOVE 0 TO SQL-SQCMOD
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(1)
        MOVE 80 TO SQL-SQHSTL(1)
        MOVE 80 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(2)
        MOVE 80 TO SQL-SQHSTL(2)
        MOVE 80 TO SQL-SQHSTS(2)
        MOVE 0 TO SQL-SQINDV(2)
        MOVE 0 TO SQL-SQINDS(2)
        MOVE 0 TO SQL-SQHARM(2)
        CALL "SQLADR" USING
            WS-NG-GRADING-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(3)
        MOVE 10 TO SQL-SQHSTL(3)
        MOVE 10 TO SQL-SQHSTS(3)
        MOVE 0 TO SQL-SQINDV(3)
        MOVE 0 TO SQL-SQINDS(3)
        MOVE 0 TO SQL-SQHARM(3)
        CALL "SQLADR" USING
            WS-ACAD-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(4)
        MOVE 11 TO SQL-SQHSTL(4)
        MOVE 11 TO SQL-SQHSTS(4)
        MOVE 0 TO SQL-SQINDV(4)
        MOVE 0 TO SQL-SQINDS(4)
        MOVE 0 TO SQL-SQHARM(4)
        CALL "SQLADR" USING
            WS-NG-GRADING-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(5)
        MOVE 10 TO SQL-SQHSTL(5)
        MOVE 10 TO SQL-SQHSTS(5)
        MOVE 0 TO SQL-SQINDV(5)
        MOVE 0 TO SQL-SQINDS(5)
        MOVE 0 TO SQL-SQHARM(5)
        CALL "SQLADR" USING
            WS-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(6)
        MOVE 11 TO SQL-SQHSTL(6)
        MOVE 11 TO SQL-SQHSTS(6)
        MOVE 0 TO SQL-SQINDV(6)
        MOVE 0 TO SQL-SQINDS(6)
        MOVE 0 TO SQL-SQHARM(6)
        CALL "SQLADR" USING
            WS-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(7)
        MOVE 11 TO SQL-SQHSTL(7)
        MOVE 11 TO SQL-SQHSTS(7)
        MOVE 0 TO SQL-SQINDV(7)
        MOVE 0 TO SQL-SQINDS(7)
        MOVE 0 TO SQL-SQHARM(7)
        CALL "SQLADR" USING
            WS-REG-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(8)
        MOVE 11 TO SQL-SQHSTL(8)
        MOVE 11 TO SQL-SQHSTS(8)
        MOVE 0 TO SQL-SQINDV(8)
        MOVE 0 TO SQL-SQINDS(8)
        MOVE 0 TO SQL-SQHARM(8)
        CALL "SQLADR" USING
            WS-REG-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(9)
        MOVE 11 TO SQL-SQHSTL(9)
        MOVE 11 TO SQL-SQHSTS(9)
        MOVE 0 TO SQL-SQINDV(9)
        MOVE 0 TO SQL-SQINDS(9)
        MOVE 0 TO SQL-SQHARM(9)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(10)
        MOVE 80 TO SQL-SQHSTL(10)
        MOVE 80 TO SQL-SQHSTS(10)
        MOVE 0 TO SQL-SQINDV(10)
        MOVE 0 TO SQL-SQINDS(10)
        MOVE 0 TO SQL-SQHARM(10)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(11)
        MOVE 80 TO SQL-SQHSTL(11)
        MOVE 80 TO SQL-SQHSTS(11)
        MOVE 0 TO SQL-SQINDV(11)
        MOVE 0 TO SQL-SQINDS(11)
        MOVE 0 TO SQL-SQHARM(11)
        CALL "SQLADR" USING
            WS-NG-GRADING-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(12)
        MOVE 10 TO SQL-SQHSTL(12)
        MOVE 10 TO SQL-SQHSTS(12)
        MOVE 0 TO SQL-SQINDV(12)
        MOVE 0 TO SQL-SQINDS(12)
        MOVE 0 TO SQL-SQHARM(12)
        CALL "SQLADR" USING
            WS-ACAD-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(13)
        MOVE 11 TO SQL-SQHSTL(13)
        MOVE 11 TO SQL-SQHSTS(13)
        MOVE 0 TO SQL-SQINDV(13)
        MOVE 0 TO SQL-SQINDS(13)
        MOVE 0 TO SQL-SQHARM(13)
        CALL "SQLADR" USING
            WS-NG-GRADING-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(14)
        MOVE 10 TO SQL-SQHSTL(14)
        MOVE 10 TO SQL-SQHSTS(14)
        MOVE 0 TO SQL-SQINDV(14)
        MOVE 0 TO SQL-SQINDS(14)
        MOVE 0 TO SQL-SQHARM(14)
        CALL "SQLADR" USING
            WS-ACAD-YEAR-RERUN IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(15)
        MOVE 3 TO SQL-SQHSTL(15)
        MOVE 3 TO SQL-SQHSTS(15)
        MOVE 0 TO SQL-SQINDV(15)
        MOVE 0 TO SQL-SQINDS(15)
        MOVE 0 TO SQL-SQHARM(15)
        CALL "SQLADR" USING
            WS-ACAD-YEAR-RERUN IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(16)
        MOVE 3 TO SQL-SQHSTL(16)
        MOVE 3 TO SQL-SQHSTS(16)
        MOVE 0 TO SQL-SQINDV(16)
        MOVE 0 TO SQL-SQINDS(16)
        MOVE 0 TO SQL-SQHARM(16)
        CALL "SQLADR" USING
            WS-NG-GRADING-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(17)
        MOVE 10 TO SQL-SQHSTL(17)
        MOVE 10 TO SQL-SQHSTS(17)
        MOVE 0 TO SQL-SQINDV(17)
        MOVE 0 TO SQL-SQINDS(17)
        MOVE 0 TO SQL-SQHARM(17)
        CALL "SQLADR" USING
            WS-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(18)
        MOVE 11 TO SQL-SQHSTL(18)
        MOVE 11 TO SQL-SQHSTS(18)
        MOVE 0 TO SQL-SQINDV(18)
        MOVE 0 TO SQL-SQINDS(18)
        MOVE 0 TO SQL-SQHARM(18)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(19)
        MOVE 80 TO SQL-SQHSTL(19)
        MOVE 80 TO SQL-SQHSTS(19)
        MOVE 0 TO SQL-SQINDV(19)
        MOVE 0 TO SQL-SQINDS(19)
        MOVE 0 TO SQL-SQHARM(19)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(20)
        MOVE 80 TO SQL-SQHSTL(20)
        MOVE 80 TO SQL-SQHSTS(20)
        MOVE 0 TO SQL-SQINDV(20)
        MOVE 0 TO SQL-SQINDS(20)
        MOVE 0 TO SQL-SQHARM(20)
        CALL "SQLADR" USING
            WS-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(21)
        MOVE 11 TO SQL-SQHSTL(21)
        MOVE 11 TO SQL-SQHSTS(21)
        MOVE 0 TO SQL-SQINDV(21)
        MOVE 0 TO SQL-SQINDS(21)
        MOVE 0 TO SQL-SQHARM(21)
        CALL "SQLADR" USING
            WS-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(22)
        MOVE 11 TO SQL-SQHSTL(22)
        MOVE 11 TO SQL-SQHSTS(22)
        MOVE 0 TO SQL-SQINDV(22)
        MOVE 0 TO SQL-SQINDS(22)
        MOVE 0 TO SQL-SQHARM(22)
        CALL "SQLADR" USING
            WS-REG-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(23)
        MOVE 11 TO SQL-SQHSTL(23)
        MOVE 11 TO SQL-SQHSTS(23)
        MOVE 0 TO SQL-SQINDV(23)
        MOVE 0 TO SQL-SQINDS(23)
        MOVE 0 TO SQL-SQHARM(23)
        CALL "SQLADR" USING
            WS-REG-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(24)
        MOVE 11 TO SQL-SQHSTL(24)
        MOVE 11 TO SQL-SQHSTS(24)
        MOVE 0 TO SQL-SQINDV(24)
        MOVE 0 TO SQL-SQINDS(24)
        MOVE 0 TO SQL-SQHARM(24)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(25)
        MOVE 80 TO SQL-SQHSTL(25)
        MOVE 80 TO SQL-SQHSTS(25)
        MOVE 0 TO SQL-SQINDV(25)
        MOVE 0 TO SQL-SQINDS(25)
        MOVE 0 TO SQL-SQHARM(25)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(26)
        MOVE 80 TO SQL-SQHSTL(26)
        MOVE 80 TO SQL-SQHSTS(26)
        MOVE 0 TO SQL-SQINDV(26)
        MOVE 0 TO SQL-SQINDS(26)
        MOVE 0 TO SQL-SQHARM(26)
        CALL "SQLADR" USING
            WS-ACAD-YEAR-RERUN IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(27)
        MOVE 3 TO SQL-SQHSTL(27)
        MOVE 3 TO SQL-SQHSTS(27)
        MOVE 0 TO SQL-SQINDV(27)
        MOVE 0 TO SQL-SQINDS(27)
        MOVE 0 TO SQL-SQHARM(27)
        CALL "SQLADR" USING
            WS-ACAD-YEAR-RERUN IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(28)
        MOVE 3 TO SQL-SQHSTL(28)
        MOVE 3 TO SQL-SQHSTS(28)
        MOVE 0 TO SQL-SQINDV(28)
        MOVE 0 TO SQL-SQINDS(28)
        MOVE 0 TO SQL-SQHARM(28)
        CALL "SQLADR" USING
            WS-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(29)
        MOVE 11 TO SQL-SQHSTL(29)
        MOVE 11 TO SQL-SQHSTS(29)
        MOVE 0 TO SQL-SQINDV(29)
        MOVE 0 TO SQL-SQINDS(29)
        MOVE 0 TO SQL-SQHARM(29)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
        PERFORM CA-FETCH-BTEC
          UNTIL WS01-EOF.
*
        DISPLAY "TOTAL BTEC FETCHED ", WS01-ROWS-TOTAL WITH CONVERSION.

        MOVE   "C: ERROR CLOSING BTEC COURSES CURSOR"
                                   TO  WS01-ERR-MESSAGE. 
*    
*       EXEC SQL
*           CLOSE GET_BTEC
*       END-EXEC.
        MOVE 1 TO SQL-ITERS
        MOVE 281 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
C-EXIT.
*
        EXIT.
*
CA-FETCH-BTEC SECTION.
**********************************************************************
*
*       Get a set of BTEC awards and process them.
*
**********************************************************************
CA-START.
*
        MOVE   "CA: ERROR FETCHING BTEC AWARDS"
                                   TO  WS01-ERR-MESSAGE.
*       EXEC SQL
*            FETCH GET_BTEC
*             INTO :DS01-UNIQUE-CANDIDATE-IDR,
*                  :DS01-UNIQUE-LEARNER-NUM,
*                  :DS01-UNIQUE-PUPIL-NUM,
*                  :DS01-CANDIDATE-IDR-OTHER,
*                  :DS01-FIRSTNAME-DB,
*                  :DS01-FIRSTNAME-RPT,
*                  :DS01-SURNAME-DB,
*                  :DS01-SURNAME-RPT,
*                  :DS01-GENDER,
*                  :DS01-DOB,
*                  :DS01-NCN,
*                  :DS01-CENTREURN,
*                  :DS01-LEA,
*                  :DS01-CENTRE-IDR-OTHER,
*                  :DS01-UKPRN,
*                  :DS01-CENTRENAME,
*                  :DS01-CENTREADDRESS1,
*                  :DS01-CENTREADDRESS2,
*                  :DS01-CENTREADDRESS3,
*                  :DS01-CENTREADDRESS4,
*                  :DS01-CENTREPOSTCODE,
*                  :DS01-CENTRETYPE,
*                  :DS01-QUAL-NUMBER,
*                  :DS01-SPEC-CODE,
*                  :DS01-SPEC-TITLE,
*                  :DS01-QUAL-TYPE,
*                  :DS01-EXAMSERIES,
*                  :DS01-REG-DATE,
*                  :DS01-FIRST-ENTRY-DATE,
*                  :DS01-AWARD-DATE,
*                  :DS01-QUAL-GRADE,
*                  :DS01-PRIVATE-CANDIDATE,
*                  :DS01-PARTIAL-ABSENCE,
*                  :DS01-BNM-TYPE,
*                  :DS01-CERT-IND,
*                  :DS01-COURSE,
*                  :DS01-AT-NUMBER,
*                  :DS02-REC-TYPE,
*                  :DS02-CANDIDATE-IDR-OTHER,
*                  :DS02-FIRSTNAME-DB,
*                  :DS02-SURNAME-DB,
*                  :DS02-GENDER,
*                  :DS02-DOB,
*                  :DS02-NCN,
*                  :DS02-CENTREURN,
*                  :DS02-CENTRE-IDR-OTHER,
*                  :DS02-UKPRN,
*                  :DS02-CENTRENAME,
*                  :DS02-CENTREADDRESS1,
*                  :DS02-CENTREADDRESS2,
*                  :DS02-CENTREADDRESS3,
*                  :DS02-CENTREADDRESS4,
*                  :DS02-CENTREPOSTCODE,
*                  :DS02-CENTRETYPE,
*                  :DS02-QUAL-NUMBER-TYPE,
*                  :DS02-QUAL-NUMBER,
*                  :DS02-SPEC-CODE,
*                  :DS02-SPEC-TITLE,
*                  :DS02-QUAL-TYPE,
*                  :DS02-REG-DATE,
*                  :DS02-FIRST-ENTRY-DATE,
*                  :DS02-AWARD-DATE,
*                  :DS02-QUAL-GRADE
*       END-EXEC.
        MOVE 500 TO SQL-ITERS
        MOVE 296 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        MOVE 0 TO SQL-SQFOFF
        MOVE 2 TO SQL-SQFMOD
        CALL "SQLADR" USING
            DS01-UNIQUE-CANDIDATE-IDR IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(1)
        MOVE 13 TO SQL-SQHSTL(1)
        MOVE 13 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            DS01-UNIQUE-LEARNER-NUM IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(2)
        MOVE 10 TO SQL-SQHSTL(2)
        MOVE 10 TO SQL-SQHSTS(2)
        MOVE 0 TO SQL-SQINDV(2)
        MOVE 0 TO SQL-SQINDS(2)
        MOVE 0 TO SQL-SQHARM(2)
        CALL "SQLADR" USING
            DS01-UNIQUE-PUPIL-NUM IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(3)
        MOVE 2 TO SQL-SQHSTL(3)
        MOVE 2 TO SQL-SQHSTS(3)
        MOVE 0 TO SQL-SQINDV(3)
        MOVE 0 TO SQL-SQINDS(3)
        MOVE 0 TO SQL-SQHARM(3)
        CALL "SQLADR" USING
            DS01-CANDIDATE-IDR-OTHER IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(4)
        MOVE 7 TO SQL-SQHSTL(4)
        MOVE 7 TO SQL-SQHSTS(4)
        MOVE 0 TO SQL-SQINDV(4)
        MOVE 0 TO SQL-SQINDS(4)
        MOVE 0 TO SQL-SQHARM(4)
        CALL "SQLADR" USING
            DS01-FIRSTNAME-DB IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(5)
        MOVE 35 TO SQL-SQHSTL(5)
        MOVE 35 TO SQL-SQHSTS(5)
        MOVE 0 TO SQL-SQINDV(5)
        MOVE 0 TO SQL-SQINDS(5)
        MOVE 0 TO SQL-SQHARM(5)
        CALL "SQLADR" USING
            DS01-FIRSTNAME-RPT IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(6)
        MOVE 35 TO SQL-SQHSTL(6)
        MOVE 35 TO SQL-SQHSTS(6)
        MOVE 0 TO SQL-SQINDV(6)
        MOVE 0 TO SQL-SQINDS(6)
        MOVE 0 TO SQL-SQHARM(6)
        CALL "SQLADR" USING
            DS01-SURNAME-DB IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(7)
        MOVE 35 TO SQL-SQHSTL(7)
        MOVE 35 TO SQL-SQHSTS(7)
        MOVE 0 TO SQL-SQINDV(7)
        MOVE 0 TO SQL-SQINDS(7)
        MOVE 0 TO SQL-SQHARM(7)
        CALL "SQLADR" USING
            DS01-SURNAME-RPT IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(8)
        MOVE 35 TO SQL-SQHSTL(8)
        MOVE 35 TO SQL-SQHSTS(8)
        MOVE 0 TO SQL-SQINDV(8)
        MOVE 0 TO SQL-SQINDS(8)
        MOVE 0 TO SQL-SQHARM(8)
        CALL "SQLADR" USING
            DS01-GENDER IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(9)
        MOVE 2 TO SQL-SQHSTL(9)
        MOVE 2 TO SQL-SQHSTS(9)
        MOVE 0 TO SQL-SQINDV(9)
        MOVE 0 TO SQL-SQINDS(9)
        MOVE 0 TO SQL-SQHARM(9)
        CALL "SQLADR" USING
            DS01-DOB IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(10)
        MOVE 10 TO SQL-SQHSTL(10)
        MOVE 10 TO SQL-SQHSTS(10)
        MOVE 0 TO SQL-SQINDV(10)
        MOVE 0 TO SQL-SQINDS(10)
        MOVE 0 TO SQL-SQHARM(10)
        CALL "SQLADR" USING
            DS01-NCN IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(11)
        MOVE 6 TO SQL-SQHSTL(11)
        MOVE 6 TO SQL-SQHSTS(11)
        MOVE 0 TO SQL-SQINDV(11)
        MOVE 0 TO SQL-SQINDS(11)
        MOVE 0 TO SQL-SQHARM(11)
        CALL "SQLADR" USING
            DS01-CENTREURN IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(12)
        MOVE 4 TO SQL-SQHSTL(12)
        MOVE 4 TO SQL-SQHSTS(12)
        MOVE 0 TO SQL-SQINDV(12)
        MOVE 0 TO SQL-SQINDS(12)
        MOVE 0 TO SQL-SQHARM(12)
        CALL "SQLADR" USING
            DS01-LEA IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(13)
        MOVE 3 TO SQL-SQHSTL(13)
        MOVE 3 TO SQL-SQHSTS(13)
        MOVE 0 TO SQL-SQINDV(13)
        MOVE 0 TO SQL-SQINDS(13)
        MOVE 0 TO SQL-SQHARM(13)
        CALL "SQLADR" USING
            DS01-CENTRE-IDR-OTHER IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(14)
        MOVE 6 TO SQL-SQHSTL(14)
        MOVE 6 TO SQL-SQHSTS(14)
        MOVE 0 TO SQL-SQINDV(14)
        MOVE 0 TO SQL-SQINDS(14)
        MOVE 0 TO SQL-SQHARM(14)
        CALL "SQLADR" USING
            DS01-UKPRN IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(15)
        MOVE 4 TO SQL-SQHSTL(15)
        MOVE 4 TO SQL-SQHSTS(15)
        MOVE 0 TO SQL-SQINDV(15)
        MOVE 0 TO SQL-SQINDS(15)
        MOVE 0 TO SQL-SQHARM(15)
        CALL "SQLADR" USING
            DS01-CENTRENAME IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(16)
        MOVE 65 TO SQL-SQHSTL(16)
        MOVE 65 TO SQL-SQHSTS(16)
        MOVE 0 TO SQL-SQINDV(16)
        MOVE 0 TO SQL-SQINDS(16)
        MOVE 0 TO SQL-SQHARM(16)
        CALL "SQLADR" USING
            DS01-CENTREADDRESS1 IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(17)
        MOVE 150 TO SQL-SQHSTL(17)
        MOVE 150 TO SQL-SQHSTS(17)
        MOVE 0 TO SQL-SQINDV(17)
        MOVE 0 TO SQL-SQINDS(17)
        MOVE 0 TO SQL-SQHARM(17)
        CALL "SQLADR" USING
            DS01-CENTREADDRESS2 IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(18)
        MOVE 36 TO SQL-SQHSTL(18)
        MOVE 36 TO SQL-SQHSTS(18)
        MOVE 0 TO SQL-SQINDV(18)
        MOVE 0 TO SQL-SQINDS(18)
        MOVE 0 TO SQL-SQHARM(18)
        CALL "SQLADR" USING
            DS01-CENTREADDRESS3 IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(19)
        MOVE 30 TO SQL-SQHSTL(19)
        MOVE 30 TO SQL-SQHSTS(19)
        MOVE 0 TO SQL-SQINDV(19)
        MOVE 0 TO SQL-SQINDS(19)
        MOVE 0 TO SQL-SQHARM(19)
        CALL "SQLADR" USING
            DS01-CENTREADDRESS4 IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(20)
        MOVE 25 TO SQL-SQHSTL(20)
        MOVE 25 TO SQL-SQHSTS(20)
        MOVE 0 TO SQL-SQINDV(20)
        MOVE 0 TO SQL-SQINDS(20)
        MOVE 0 TO SQL-SQHARM(20)
        CALL "SQLADR" USING
            DS01-CENTREPOSTCODE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(21)
        MOVE 10 TO SQL-SQHSTL(21)
        MOVE 10 TO SQL-SQHSTS(21)
        MOVE 0 TO SQL-SQINDV(21)
        MOVE 0 TO SQL-SQINDS(21)
        MOVE 0 TO SQL-SQHARM(21)
        CALL "SQLADR" USING
            DS01-CENTRETYPE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(22)
        MOVE 2 TO SQL-SQHSTL(22)
        MOVE 2 TO SQL-SQHSTS(22)
        MOVE 0 TO SQL-SQINDV(22)
        MOVE 0 TO SQL-SQINDS(22)
        MOVE 0 TO SQL-SQHARM(22)
        CALL "SQLADR" USING
            DS01-QUAL-NUMBER IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(23)
        MOVE 10 TO SQL-SQHSTL(23)
        MOVE 10 TO SQL-SQHSTS(23)
        MOVE 0 TO SQL-SQINDV(23)
        MOVE 0 TO SQL-SQINDS(23)
        MOVE 0 TO SQL-SQHARM(23)
        CALL "SQLADR" USING
            DS01-SPEC-CODE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(24)
        MOVE 8 TO SQL-SQHSTL(24)
        MOVE 8 TO SQL-SQHSTS(24)
        MOVE 0 TO SQL-SQINDV(24)
        MOVE 0 TO SQL-SQINDS(24)
        MOVE 0 TO SQL-SQHARM(24)
        CALL "SQLADR" USING
            DS01-SPEC-TITLE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(25)
        MOVE 150 TO SQL-SQHSTL(25)
        MOVE 150 TO SQL-SQHSTS(25)
        MOVE 0 TO SQL-SQINDV(25)
        MOVE 0 TO SQL-SQINDS(25)
        MOVE 0 TO SQL-SQHARM(25)
        CALL "SQLADR" USING
            DS01-QUAL-TYPE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(26)
        MOVE 100 TO SQL-SQHSTL(26)
        MOVE 100 TO SQL-SQHSTS(26)
        MOVE 0 TO SQL-SQINDV(26)
        MOVE 0 TO SQL-SQINDS(26)
        MOVE 0 TO SQL-SQHARM(26)
        CALL "SQLADR" USING
            DS01-EXAMSERIES IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(27)
        MOVE 2 TO SQL-SQHSTL(27)
        MOVE 2 TO SQL-SQHSTS(27)
        MOVE 0 TO SQL-SQINDV(27)
        MOVE 0 TO SQL-SQINDS(27)
        MOVE 0 TO SQL-SQHARM(27)
        CALL "SQLADR" USING
            DS01-REG-DATE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(28)
        MOVE 10 TO SQL-SQHSTL(28)
        MOVE 10 TO SQL-SQHSTS(28)
        MOVE 0 TO SQL-SQINDV(28)
        MOVE 0 TO SQL-SQINDS(28)
        MOVE 0 TO SQL-SQHARM(28)
        CALL "SQLADR" USING
            DS01-FIRST-ENTRY-DATE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(29)
        MOVE 10 TO SQL-SQHSTL(29)
        MOVE 10 TO SQL-SQHSTS(29)
        MOVE 0 TO SQL-SQINDV(29)
        MOVE 0 TO SQL-SQINDS(29)
        MOVE 0 TO SQL-SQHARM(29)
        CALL "SQLADR" USING
            DS01-AWARD-DATE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(30)
        MOVE 10 TO SQL-SQHSTL(30)
        MOVE 10 TO SQL-SQHSTS(30)
        MOVE 0 TO SQL-SQINDV(30)
        MOVE 0 TO SQL-SQINDS(30)
        MOVE 0 TO SQL-SQHARM(30)
        CALL "SQLADR" USING
            DS01-QUAL-GRADE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(31)
        MOVE 3 TO SQL-SQHSTL(31)
        MOVE 3 TO SQL-SQHSTS(31)
        MOVE 0 TO SQL-SQINDV(31)
        MOVE 0 TO SQL-SQINDS(31)
        MOVE 0 TO SQL-SQHARM(31)
        CALL "SQLADR" USING
            DS01-PRIVATE-CANDIDATE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(32)
        MOVE 2 TO SQL-SQHSTL(32)
        MOVE 2 TO SQL-SQHSTS(32)
        MOVE 0 TO SQL-SQINDV(32)
        MOVE 0 TO SQL-SQINDS(32)
        MOVE 0 TO SQL-SQHARM(32)
        CALL "SQLADR" USING
            DS01-PARTIAL-ABSENCE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(33)
        MOVE 2 TO SQL-SQHSTL(33)
        MOVE 2 TO SQL-SQHSTS(33)
        MOVE 0 TO SQL-SQINDV(33)
        MOVE 0 TO SQL-SQINDS(33)
        MOVE 0 TO SQL-SQHARM(33)
        CALL "SQLADR" USING
            DS01-BNM-TYPE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(34)
        MOVE 1 TO SQL-SQHSTL(34)
        MOVE 1 TO SQL-SQHSTS(34)
        MOVE 0 TO SQL-SQINDV(34)
        MOVE 0 TO SQL-SQINDS(34)
        MOVE 0 TO SQL-SQHARM(34)
        CALL "SQLADR" USING
            DS01-CERT-IND IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(35)
        MOVE 1 TO SQL-SQHSTL(35)
        MOVE 1 TO SQL-SQHSTS(35)
        MOVE 0 TO SQL-SQINDV(35)
        MOVE 0 TO SQL-SQINDS(35)
        MOVE 0 TO SQL-SQHARM(35)
        CALL "SQLADR" USING
            DS01-COURSE IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(36)
        MOVE 8 TO SQL-SQHSTL(36)
        MOVE 8 TO SQL-SQHSTS(36)
        MOVE 0 TO SQL-SQINDV(36)
        MOVE 0 TO SQL-SQINDS(36)
        MOVE 0 TO SQL-SQHARM(36)
        CALL "SQLADR" USING
            DS01-AT-NUMBER IN
            DS01-COURSE-DETAILS(1)
            SQL-SQHSTV(37)
        MOVE 6 TO SQL-SQHSTL(37)
        MOVE 6 TO SQL-SQHSTS(37)
        MOVE 0 TO SQL-SQINDV(37)
        MOVE 0 TO SQL-SQINDS(37)
        MOVE 0 TO SQL-SQHARM(37)
        CALL "SQLADR" USING
            DS02-REC-TYPE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(38)
        MOVE 9 TO SQL-SQHSTL(38)
        MOVE 9 TO SQL-SQHSTS(38)
        MOVE 0 TO SQL-SQINDV(38)
        MOVE 0 TO SQL-SQINDS(38)
        MOVE 0 TO SQL-SQHARM(38)
        CALL "SQLADR" USING
            DS02-CANDIDATE-IDR-OTHER IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(39)
        MOVE 7 TO SQL-SQHSTL(39)
        MOVE 7 TO SQL-SQHSTS(39)
        MOVE 0 TO SQL-SQINDV(39)
        MOVE 0 TO SQL-SQINDS(39)
        MOVE 0 TO SQL-SQHARM(39)
        CALL "SQLADR" USING
            DS02-FIRSTNAME-DB IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(40)
        MOVE 35 TO SQL-SQHSTL(40)
        MOVE 35 TO SQL-SQHSTS(40)
        MOVE 0 TO SQL-SQINDV(40)
        MOVE 0 TO SQL-SQINDS(40)
        MOVE 0 TO SQL-SQHARM(40)
        CALL "SQLADR" USING
            DS02-SURNAME-DB IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(41)
        MOVE 35 TO SQL-SQHSTL(41)
        MOVE 35 TO SQL-SQHSTS(41)
        MOVE 0 TO SQL-SQINDV(41)
        MOVE 0 TO SQL-SQINDS(41)
        MOVE 0 TO SQL-SQHARM(41)
        CALL "SQLADR" USING
            DS02-GENDER IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(42)
        MOVE 2 TO SQL-SQHSTL(42)
        MOVE 2 TO SQL-SQHSTS(42)
        MOVE 0 TO SQL-SQINDV(42)
        MOVE 0 TO SQL-SQINDS(42)
        MOVE 0 TO SQL-SQHARM(42)
        CALL "SQLADR" USING
            DS02-DOB IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(43)
        MOVE 10 TO SQL-SQHSTL(43)
        MOVE 10 TO SQL-SQHSTS(43)
        MOVE 0 TO SQL-SQINDV(43)
        MOVE 0 TO SQL-SQINDS(43)
        MOVE 0 TO SQL-SQHARM(43)
        CALL "SQLADR" USING
            DS02-NCN IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(44)
        MOVE 6 TO SQL-SQHSTL(44)
        MOVE 6 TO SQL-SQHSTS(44)
        MOVE 0 TO SQL-SQINDV(44)
        MOVE 0 TO SQL-SQINDS(44)
        MOVE 0 TO SQL-SQHARM(44)
        CALL "SQLADR" USING
            DS02-CENTREURN IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(45)
        MOVE 4 TO SQL-SQHSTL(45)
        MOVE 4 TO SQL-SQHSTS(45)
        MOVE 0 TO SQL-SQINDV(45)
        MOVE 0 TO SQL-SQINDS(45)
        MOVE 0 TO SQL-SQHARM(45)
        CALL "SQLADR" USING
            DS02-CENTRE-IDR-OTHER IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(46)
        MOVE 6 TO SQL-SQHSTL(46)
        MOVE 6 TO SQL-SQHSTS(46)
        MOVE 0 TO SQL-SQINDV(46)
        MOVE 0 TO SQL-SQINDS(46)
        MOVE 0 TO SQL-SQHARM(46)
        CALL "SQLADR" USING
            DS02-UKPRN IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(47)
        MOVE 4 TO SQL-SQHSTL(47)
        MOVE 4 TO SQL-SQHSTS(47)
        MOVE 0 TO SQL-SQINDV(47)
        MOVE 0 TO SQL-SQINDS(47)
        MOVE 0 TO SQL-SQHARM(47)
        CALL "SQLADR" USING
            DS02-CENTRENAME IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(48)
        MOVE 65 TO SQL-SQHSTL(48)
        MOVE 65 TO SQL-SQHSTS(48)
        MOVE 0 TO SQL-SQINDV(48)
        MOVE 0 TO SQL-SQINDS(48)
        MOVE 0 TO SQL-SQHARM(48)
        CALL "SQLADR" USING
            DS02-CENTREADDRESS1 IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(49)
        MOVE 150 TO SQL-SQHSTL(49)
        MOVE 150 TO SQL-SQHSTS(49)
        MOVE 0 TO SQL-SQINDV(49)
        MOVE 0 TO SQL-SQINDS(49)
        MOVE 0 TO SQL-SQHARM(49)
        CALL "SQLADR" USING
            DS02-CENTREADDRESS2 IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(50)
        MOVE 36 TO SQL-SQHSTL(50)
        MOVE 36 TO SQL-SQHSTS(50)
        MOVE 0 TO SQL-SQINDV(50)
        MOVE 0 TO SQL-SQINDS(50)
        MOVE 0 TO SQL-SQHARM(50)
        CALL "SQLADR" USING
            DS02-CENTREADDRESS3 IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(51)
        MOVE 30 TO SQL-SQHSTL(51)
        MOVE 30 TO SQL-SQHSTS(51)
        MOVE 0 TO SQL-SQINDV(51)
        MOVE 0 TO SQL-SQINDS(51)
        MOVE 0 TO SQL-SQHARM(51)
        CALL "SQLADR" USING
            DS02-CENTREADDRESS4 IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(52)
        MOVE 25 TO SQL-SQHSTL(52)
        MOVE 25 TO SQL-SQHSTS(52)
        MOVE 0 TO SQL-SQINDV(52)
        MOVE 0 TO SQL-SQINDS(52)
        MOVE 0 TO SQL-SQHARM(52)
        CALL "SQLADR" USING
            DS02-CENTREPOSTCODE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(53)
        MOVE 10 TO SQL-SQHSTL(53)
        MOVE 10 TO SQL-SQHSTS(53)
        MOVE 0 TO SQL-SQINDV(53)
        MOVE 0 TO SQL-SQINDS(53)
        MOVE 0 TO SQL-SQHARM(53)
        CALL "SQLADR" USING
            DS02-CENTRETYPE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(54)
        MOVE 2 TO SQL-SQHSTL(54)
        MOVE 2 TO SQL-SQHSTS(54)
        MOVE 0 TO SQL-SQINDV(54)
        MOVE 0 TO SQL-SQINDS(54)
        MOVE 0 TO SQL-SQHARM(54)
        CALL "SQLADR" USING
            DS02-QUAL-NUMBER-TYPE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(55)
        MOVE 5 TO SQL-SQHSTL(55)
        MOVE 5 TO SQL-SQHSTS(55)
        MOVE 0 TO SQL-SQINDV(55)
        MOVE 0 TO SQL-SQINDS(55)
        MOVE 0 TO SQL-SQHARM(55)
        CALL "SQLADR" USING
            DS02-QUAL-NUMBER IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(56)
        MOVE 10 TO SQL-SQHSTL(56)
        MOVE 10 TO SQL-SQHSTS(56)
        MOVE 0 TO SQL-SQINDV(56)
        MOVE 0 TO SQL-SQINDS(56)
        MOVE 0 TO SQL-SQHARM(56)
        CALL "SQLADR" USING
            DS02-SPEC-CODE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(57)
        MOVE 8 TO SQL-SQHSTL(57)
        MOVE 8 TO SQL-SQHSTS(57)
        MOVE 0 TO SQL-SQINDV(57)
        MOVE 0 TO SQL-SQINDS(57)
        MOVE 0 TO SQL-SQHARM(57)
        CALL "SQLADR" USING
            DS02-SPEC-TITLE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(58)
        MOVE 150 TO SQL-SQHSTL(58)
        MOVE 150 TO SQL-SQHSTS(58)
        MOVE 0 TO SQL-SQINDV(58)
        MOVE 0 TO SQL-SQINDS(58)
        MOVE 0 TO SQL-SQHARM(58)
        CALL "SQLADR" USING
            DS02-QUAL-TYPE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(59)
        MOVE 100 TO SQL-SQHSTL(59)
        MOVE 100 TO SQL-SQHSTS(59)
        MOVE 0 TO SQL-SQINDV(59)
        MOVE 0 TO SQL-SQINDS(59)
        MOVE 0 TO SQL-SQHARM(59)
        CALL "SQLADR" USING
            DS02-REG-DATE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(60)
        MOVE 10 TO SQL-SQHSTL(60)
        MOVE 10 TO SQL-SQHSTS(60)
        MOVE 0 TO SQL-SQINDV(60)
        MOVE 0 TO SQL-SQINDS(60)
        MOVE 0 TO SQL-SQHARM(60)
        CALL "SQLADR" USING
            DS02-FIRST-ENTRY-DATE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(61)
        MOVE 10 TO SQL-SQHSTL(61)
        MOVE 10 TO SQL-SQHSTS(61)
        MOVE 0 TO SQL-SQINDV(61)
        MOVE 0 TO SQL-SQINDS(61)
        MOVE 0 TO SQL-SQHARM(61)
        CALL "SQLADR" USING
            DS02-AWARD-DATE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(62)
        MOVE 10 TO SQL-SQHSTL(62)
        MOVE 10 TO SQL-SQHSTS(62)
        MOVE 0 TO SQL-SQINDV(62)
        MOVE 0 TO SQL-SQINDS(62)
        MOVE 0 TO SQL-SQHARM(62)
        CALL "SQLADR" USING
            DS02-QUAL-GRADE IN
            DS02-COURSE-DETAILS(1)
            SQL-SQHSTV(63)
        MOVE 3 TO SQL-SQHSTL(63)
        MOVE 3 TO SQL-SQHSTS(63)
        MOVE 0 TO SQL-SQINDV(63)
        MOVE 0 TO SQL-SQINDS(63)
        MOVE 0 TO SQL-SQHARM(63)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
CA-010.
        IF  SQLCODE IS POSITIVE THEN
            SET     WS01-EOF       TO  TRUE
        END-IF.

        SUBTRACT WS01-ROWS-TOTAL FROM  SQLERRD(3)
                               GIVING  WS01-ROWS-THIS-FETCH.
        MOVE    SQLERRD(3)         TO  WS01-ROWS-TOTAL.

        MOVE    WS01-ROWS-TOTAL    TO  WS-BTEC-ROWS-TOTAL
        DISPLAY 'BTEC TOTAL ROWS FETCHED : ' WS-BTEC-ROWS-TOTAL.

        PERFORM  VARYING WS01-INDEX
          FROM 1 BY 1
          UNTIL WS01-INDEX > WS01-ROWS-THIS-FETCH

            MOVE 'N'                       TO WS-SKIP
*ST_REG_NO
            MOVE DS01-CANDIDATE-IDR-OTHER(WS01-INDEX) 
              TO WS-C-CANDIDATE-IDR-OTHER WS-CANDIDATE 

            MOVE DS01-CERT-IND(WS01-INDEX)  TO  WS-CERTIFICATE-IND
            MOVE DS01-BNM-TYPE(WS01-INDEX)  TO  WS-BNM-TYPE

            MOVE 'N' TO WS-BLOCK-IND

*    Only check certificate block for non-certificated BTEC NG learners...

            IF  BTEC-NG AND NOT CERTIFICATED AND 
                DS01-QUAL-GRADE(WS01-INDEX) NOT = '-2' 
            THEN
                ADD 1 TO WS-CHECK-BLOCKING-CNT
                PERFORM L-CHECK-BLOCKING
            END-IF

            IF  NOT  BLOCKED
       
                PERFORM  E-MOVE-VALIDATE-DB-COLS

              IF  SKIP
                  ADD  +1   TO  WS-BTEC-IGN-CNT
              ELSE
*LEARNER'S PREVIOUS DRD RECORD DETAILS THRU E-CONTINUE.

                IF  WS-P-CANDIDATE-IDR-OTHER = WS-C-CANDIDATE-IDR-OTHER
                    IF  WS-C-QUAL-GRADE = '-2'
                        ADD  +1  TO  WS-BTEC-SKIPPED-CNT
                    ELSE
                      IF  BTEC-NG  AND NOT CERTIFICATED AND 
                          WS-C-AWARD-DATE = '2998-12-31'
                          PERFORM Q-WRITE-IGNORED-LNR
                      ELSE
                        PERFORM M-CANDIDATE-REC-COMPARE
                      END-IF
                    END-IF
                ELSE
*INSERT LEARNERS INTO DFE_REPORT_DETAILS
                  IF  WS-C-QUAL-GRADE = '-2'
                      MOVE 'Entry'      TO WS-REC-TYPE
                      MOVE '2999-12-31' TO WS-C-FIRST-ENTRY-DATE 
                                           WS-C-AWARD-DATE
                      MOVE 'I'          TO WS-DFE-INS-UPDAT
                      MOVE 'B'          TO WS-C-PROG-TYPE
                      PERFORM N-DRD-INSERT-UPDAT
                  ELSE
                    IF  BTEC-NG  AND NOT CERTIFICATED
                        IF  WS-C-AWARD-DATE = '2998-12-31'
                            PERFORM Q-WRITE-IGNORED-LNR
                        ELSE
                          IF  WS-ACAD-YEAR-RERUN = 'YES' 
*                             EXEC SQL
*                               SELECT 
*                                 CASE
*                                   WHEN TO_DATE(:WS-C-AWARD-DATE,'YYYY-MM-DD')
*                                      > TO_DATE(:WS-END-DATE,'DD-MON-YYYY')
*                                     THEN 'Y'
*                                   ELSE 'N'
*                                 END
*                               INTO   :WS-AWARD-DATE-FUTURE
*                               FROM DUAL
*                             END-EXEC
            CALL "SQLADR" USING SQ0008 SQL-STMT
            MOVE 1 TO SQL-ITERS
            MOVE 563 TO SQL-OFFSET
            MOVE 0 TO SQL-OCCURS
            MOVE 1 TO SQL-SELERR
            MOVE 0 TO SQL-SQPMEM
            CALL "SQLADR" USING
                SQLCUD
                SQL-CUD
            CALL "SQLADR" USING
                SQLCA
                SQL-SQLEST
            MOVE 4352 TO SQL-SQLETY
            CALL "SQLADR" USING
                WS-C-AWARD-DATE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(1)
            MOVE 10 TO SQL-SQHSTL(1)
            MOVE 10 TO SQL-SQHSTS(1)
            MOVE 0 TO SQL-SQINDV(1)
            MOVE 0 TO SQL-SQINDS(1)
            MOVE 0 TO SQL-SQHARM(1)
            CALL "SQLADR" USING
                WS-END-DATE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(2)
            MOVE 11 TO SQL-SQHSTL(2)
            MOVE 11 TO SQL-SQHSTS(2)
            MOVE 0 TO SQL-SQINDV(2)
            MOVE 0 TO SQL-SQINDS(2)
            MOVE 0 TO SQL-SQHARM(2)
            CALL "SQLADR" USING
                WS-AWARD-DATE-FUTURE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(3)
            MOVE 1 TO SQL-SQHSTL(3)
            MOVE 1 TO SQL-SQHSTS(3)
            MOVE 0 TO SQL-SQINDV(3)
            MOVE 0 TO SQL-SQINDS(3)
            MOVE 0 TO SQL-SQHARM(3)
            CALL "SQLADR" USING
                SQL-SQHSTV(1)
                SQL-SQPHSV
            CALL "SQLADR" USING
                SQL-SQHSTL(1)
                SQL-SQPHSL
            CALL "SQLADR" USING
                SQL-SQHSTS(1)
                SQL-SQPHSS
            CALL "SQLADR" USING
                SQL-SQINDV(1)
                SQL-SQPIND
            CALL "SQLADR" USING
                SQL-SQINDS(1)
                SQL-SQPINS
            CALL "SQLADR" USING
                SQL-SQHARM(1)
                SQL-SQPARM
            CALL "SQLADR" USING
                SQL-SQHARC(1)
                SQL-SQPARC

            CALL "SQLBEX" USING
                SQLCTX
                SQLEXD
                SQLFPN

            IF SQLCODE IN SQLCA IS LESS THAN 0
                THEN GO TO ZZ-ABORT END-IF
                              IF  AWARD-DATE-FUTURE
                                  MOVE 'Entry'      TO WS-REC-TYPE
                                  MOVE '-2'         TO WS-C-QUAL-GRADE
                                  MOVE '2999-12-31' TO WS-C-FIRST-ENTRY-DATE 
                                                       WS-C-AWARD-DATE
                              ELSE 
                                  MOVE 'Result'     TO WS-REC-TYPE
                              END-IF
                          ELSE
                              MOVE 'Result'         TO WS-REC-TYPE
                          END-IF 
                          MOVE  'I'                 TO WS-DFE-INS-UPDAT
                          MOVE  'B'                 TO WS-C-PROG-TYPE
                          PERFORM N-DRD-INSERT-UPDAT
                        END-IF
                    ELSE
                      MOVE  'Result'                TO WS-REC-TYPE
                      MOVE  'I'                     TO WS-DFE-INS-UPDAT
                      MOVE  'B'                     TO WS-C-PROG-TYPE
                      PERFORM N-DRD-INSERT-UPDAT
                    END-IF
                  END-IF
                END-IF 
*IF SKIP --> END-IF
              END-IF 
*IF NOT BLOCKED --> END-IF
            END-IF
        END-PERFORM.

        MOVE  WS-BTEC-CNT  TO  WS-TR-DET-BTEC-TOTAL.
*
CA-EXIT.                              
    EXIT.    
*                     
D-PROCESS-NVQ SECTION.
**********************************************************************
*
*       Read the required NVQ courses and registrations. 
*
**********************************************************************
D-START.
*
*       EXEC SQL
*           DECLARE GET_NVQ CURSOR FOR
*       SELECT 
*       '-2' AS UniqueCandidateIdentifier,
*       '-2' AS UniqueLearnerNumber,
*       '-2' AS UniquePupilNumber,
*       st.st_reg_no AS CandidateIdentifierOther,
*       st.st_forenames AS FirstNameDB,
*       NVL(TRIM(TRANSLATE(st.st_forenames,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS FirstNameRPT,
*       st.st_surname AS SurnameDB,
*       NVL(TRIM(TRANSLATE(st.st_surname,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS SurnameRPT,
*       DECODE(st.st_sex,'M','M','F','F','-2') AS Sex,
*       CASE 
*         WHEN ST_BIRTH_DATE IS NULL 
*           THEN '2999-12-31'
*         WHEN ST_BIRTH_DATE <= TO_DATE('1900-01-01','YYYY-MM-DD')
*           THEN '2999-12-31'
*         ELSE
*           TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')
*       END AS DOB,
*       fn_get_ncn(st.st_centre_id) AS NCN,
*       NVL(ecen_urn,-2) AS CentreURN, 
*       '-2' AS LAESTAB,
*       st.st_centre_id AS CentreIdentifierOther, 
*       decode(LENGTH(ecen_ukprn),8,ecen_ukprn,-2) AS UKPRN,
*       cen.cn_centre_name AS CentreName,
*       NVL(cen.cn_address_1||
*       decode(cen.cn_address_1,null,null,' ')
*       ||cen.cn_address_2,' ') AS CentreAddress1,
*       NVL(cen.cn_address_3,' ') AS CentreAddress2,
*       NVL(cen.cn_town,' ') AS CentreAddress3,
*       NVL(cen.cn_county,' ') AS CentreAddress4,
*       NVL(cen.cn_postcode,'-2') AS CentrePostcode,
*       DECODE(CN_BURE_BUNI_ID,0,'12',
*           DECODE(cn_status,0,'9',
*                            2,'5',
*                            3,'1',
*                            4,'11',
*                            5,'2',
*                            6,'3',
*                            7,'1',
*                            8,'10',
*                            9,'12',
*                            10,'6',
*                            11,'2',
*                            12,'13',
*                            13,'5',
*                            14,'13','13')) AS CentreType, 
*       NVL(nvq.nvq_qan_code,st.st_nvq_registered_id) 
*         AS QualificationNumber,
*       st.st_nvq_registered_id AS SpecificationCode,  
*       nvq.nvq_title_1||' '||nvq.nvq_title_2 
*         AS SpecificationTitle,
*       FN_GET_DFE_QUAL_TYPE(NVL(nvq.nvq_qan_code
*         ,st.st_nvq_registered_id)) AS QualificationType,
*       '-2' AS ExamSeries,
*       NVL(TO_CHAR(st_reg_date,'YYYY-MM-DD')
*       ,'2999-12-31') AS RegistrationDate,
*       NVL(TO_CHAR(st_nvq_certificate_print_date
*       ,'YYYY-MM-DD'),'2999-12-31') AS FirstEntryDate,
*       NULL AS AwardDate,
*       DECODE(st_nvq_certificate_print_date,
*         NULL,'-2',NVL(st_over_grade,'P')) AS QualificationGrade,
*       -2 AS PrivateCandidate, 
*       -2 AS PartialAbsence,
*       NULL AS drd_rec_type,
*       NULL AS drd_st_reg_no,
*       NULL AS drd_forenames,
*       NULL AS drd_surname,
*       NULL AS drd_sex,
*       NULL AS drd_birth_date,
*       NULL AS drd_ncn,
*       NULL AS drd_urn,
*       NULL AS drd_centre_id,
*       NULL AS drd_ukprn,
*       NULL AS drd_centre_name,
*       NULL AS drd_address_1,
*       NULL AS drd_address_2,
*       NULL AS drd_address_3,
*       NULL AS drd_address_4,
*       NULL AS drd_postcode,
*       NULL AS drd_centre_type,
*       NULL AS drd_qual_num_type,
*       NULL AS drd_qual_number,
*       NULL AS drd_spec_code,
*       NULL AS drd_spec_title,
*       NULL AS drd_qual_type,
*       NULL AS drd_reg_date,
*       NULL AS drd_first_entry_date,
*       NULL AS drd_award_date,
*       NULL AS drd_qual_grade
*       FROM students st,
*            nvqs nvq,
*            centres cen,
*            legacy_centres,
*            edexcel_centres
*       WHERE  st_nvq_registered_id    = nvq_id
*         AND  st_centre_id            = cn_centre_id
*         AND  cn_centre_id            = lcen_centre_ref
*         AND  lcen_ltyp_id            = 1
*         AND  lcen_ecen_id            = ecen_id
*         AND  st_delete               IS NULL
*         AND  st_fallback             IS NULL
*         AND (
*             (st_nvq_certificate_print_date
*             BETWEEN TO_DATE(:WS-START-DATE,'DD-MON-YYYY') 
*                 AND TO_DATE(:WS-END-DATE,'DD-MON-YYYY')
*             )
*          OR 
*             (st_reg_date
*             BETWEEN TO_DATE(:WS-REG-START-DATE,'DD-MON-YYYY') 
*                 AND TO_DATE(:WS-REG-END-DATE,'DD-MON-YYYY') 
*                 AND st_nvq_certificate_print_date IS NULL 
*             )
*             )
*         AND NOT EXISTS 
*              (SELECT 1
*                FROM dfe_report_details
*               WHERE drd_st_reg_no = st_reg_no
*             )
*       UNION ALL
*       SELECT  
*       '-2' AS UniqueCandidateIdentifier,
*       '-2' AS UniqueLearnerNumber,
*       '-2' AS UniquePupilNumber,
*       st.st_reg_no AS CandidateIdentifierOther,
*       st.st_forenames AS FirstNameDB,
*       NVL(TRIM(TRANSLATE(st.st_forenames,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS FirstNameRPT,
*       st.st_surname AS SurnameDB,
*       NVL(TRIM(TRANSLATE(st.st_surname,:WS-RESTRICT-SPL-CHARS,' ')
*                ),' ') AS SurnameRPT,
*       DECODE(st.st_sex,'M','M','F','F','-2') AS Sex,
*       CASE 
*         WHEN ST_BIRTH_DATE IS NULL 
*           THEN '2999-12-31'
*         WHEN ST_BIRTH_DATE <= TO_DATE('1900-01-01','YYYY-MM-DD')
*           THEN '2999-12-31'
*         ELSE
*           TO_CHAR(ST_BIRTH_DATE,'YYYY-MM-DD')
*       END AS DOB,
*       fn_get_ncn(st.st_centre_id) AS NCN,
*       NVL(ecen_urn,-2) AS CentreURN, 
*       '-2' AS LAESTAB,
*       st.st_centre_id AS CentreIdentifierOther,
*       decode(LENGTH(ecen_ukprn),8,ecen_ukprn,-2) AS UKPRN,
*       cen.cn_centre_name AS CentreName,
*       NVL(cen.cn_address_1||
*       decode(cen.cn_address_1,null,null,' ')
*       ||cen.cn_address_2,' ') AS CentreAddress1,
*       NVL(cen.cn_address_3,' ') AS CentreAddress2,
*       NVL(cen.cn_town,' ') AS CentreAddress3,
*       NVL(cen.cn_county,' ') AS CentreAddress4,
*       NVL(cen.cn_postcode,'-2') AS CentrePostcode,
*       DECODE(CN_BURE_BUNI_ID,0,'12',
*           DECODE(cn_status,0,'9',
*                            2,'5',
*                            3,'1',
*                            4,'11',
*                            5,'2',
*                            6,'3',
*                            7,'1',
*                            8,'10',
*                            9,'12',
*                            10,'6',
*                            11,'2',
*                            12,'13',
*                            13,'5',
*                            14,'13','13')) AS CentreType, 
*       NVL(nvq.nvq_qan_code,st.st_nvq_registered_id) 
*         AS QualificationNumber,
*       st.st_nvq_registered_id AS SpecificationCode,  
*       nvq.nvq_title_1||' '||nvq.nvq_title_2 
*         AS SpecificationTitle,
*       FN_GET_DFE_QUAL_TYPE(NVL(nvq.nvq_qan_code
*         ,st.st_nvq_registered_id)) AS QualificationType,
*       '-2' AS ExamSeries,
*       NVL(TO_CHAR(st_reg_date,'YYYY-MM-DD'),'2999-12-31')
*        AS RegistrationDate,
*       NVL(TO_CHAR(st_nvq_certificate_print_date,'YYYY-MM-DD')
*         ,'2999-12-31') AS FirstEntryDate,
*       NULL AS AwardDate,
*       DECODE(st_nvq_certificate_print_date,
*         NULL,'-2',NVL(st_over_grade,'P')) AS QualificationGrade,
*       -2 AS PrivateCandidate, 
*       -2 AS PartialAbsence,
*       drd_rec_type,
*       drd_st_reg_no,
*       drd_forenames,
*       drd_surname,
*       drd_sex,
*       drd_birth_date,
*       drd_ncn,
*       drd_urn,
*       drd_centre_id,
*       drd_ukprn,
*       drd_centre_name,
*       NVL(drd_address_1,' '),
*       NVL(drd_address_2,' '),
*       NVL(drd_address_3,' '),
*       NVL(drd_address_4,' '),
*       drd_postcode,
*       drd_centre_type,
*       drd_qual_num_type,
*       drd_qual_number,
*       drd_spec_code,
*       drd_spec_title,
*       drd_qual_type,
*       drd_reg_date,
*       drd_first_entry_date,
*       drd_award_date,
*       drd_qual_grade
*       FROM students st,
*            nvqs nvq,
*            centres cen,
*            legacy_centres,
*            edexcel_centres,
*            dfe_report_details
*       WHERE  st_nvq_registered_id    = nvq_id
*         AND  st_reg_no             = drd_st_reg_no
*         AND  st_centre_id            = cn_centre_id
*         AND  cn_centre_id            = lcen_centre_ref
*         AND  lcen_ltyp_id            = 1
*         AND  lcen_ecen_id            = ecen_id
*         AND  st_delete               IS NULL
*         AND  st_fallback             IS NULL
*         AND ((drd_rec_type IN ('Result','Amendment') AND
*              st_nvq_certificate_print_date IS NOT NULL AND
*               ( TRUNC(SYSDATE) <= drd_amend_cutoff_date OR 
*                 NVL(st_over_grade,'P') <> drd_qual_grade 
*                )
*              )
*             OR       
*             (drd_rec_type = 'Entry' AND 
*             (UPPER(:WS-ACAD-YEAR-RERUN) = 'NO' OR
*               (UPPER(:WS-ACAD-YEAR-RERUN) = 'YES' AND
*                NVL(st_nvq_certificate_print_date,
*                   TO_DATE('2999-12-31','YYYY-MM-DD'))
*                   <= TO_DATE(:WS-END-DATE,'DD-MON-YYYY'))
*              ) AND
*              (DECODE(st_nvq_certificate_print_date,
*               NULL,'-2',NVL(st_over_grade,'P')) <> drd_qual_grade)
*             )
*         )
*ORDER BY ST_REG_NO
*       ORDER BY 4
*       END-EXEC.
*
        MOVE   "D: ERROR OPENING NVQ COURSES CURSOR"
                                   TO  WS01-ERR-MESSAGE. 
*    
*       EXEC SQL
*            SELECT TO_CHAR (SYSDATE, 'DD-MON-YYYY:HH24:MI')
*              INTO   :WS-TIME-DATE
*              FROM   DUAL
*       END-EXEC.
        CALL "SQLADR" USING SQ0010 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 590 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            WS-TIME-DATE
            SQL-SQHSTV(1)
        MOVE 17 TO SQL-SQHSTL(1)
        MOVE 17 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.

        DISPLAY "NVQ Process Started at " WS-TIME-DATE
*       EXEC SQL
*           OPEN GET_NVQ
*       END-EXEC.
        CALL "SQLADR" USING SQ0009 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 609 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        MOVE 0 TO SQL-SQCMOD
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(1)
        MOVE 80 TO SQL-SQHSTL(1)
        MOVE 80 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(2)
        MOVE 80 TO SQL-SQHSTL(2)
        MOVE 80 TO SQL-SQHSTS(2)
        MOVE 0 TO SQL-SQINDV(2)
        MOVE 0 TO SQL-SQINDS(2)
        MOVE 0 TO SQL-SQHARM(2)
        CALL "SQLADR" USING
            WS-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(3)
        MOVE 11 TO SQL-SQHSTL(3)
        MOVE 11 TO SQL-SQHSTS(3)
        MOVE 0 TO SQL-SQINDV(3)
        MOVE 0 TO SQL-SQINDS(3)
        MOVE 0 TO SQL-SQHARM(3)
        CALL "SQLADR" USING
            WS-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(4)
        MOVE 11 TO SQL-SQHSTL(4)
        MOVE 11 TO SQL-SQHSTS(4)
        MOVE 0 TO SQL-SQINDV(4)
        MOVE 0 TO SQL-SQINDS(4)
        MOVE 0 TO SQL-SQHARM(4)
        CALL "SQLADR" USING
            WS-REG-START-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(5)
        MOVE 11 TO SQL-SQHSTL(5)
        MOVE 11 TO SQL-SQHSTS(5)
        MOVE 0 TO SQL-SQINDV(5)
        MOVE 0 TO SQL-SQINDS(5)
        MOVE 0 TO SQL-SQHARM(5)
        CALL "SQLADR" USING
            WS-REG-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(6)
        MOVE 11 TO SQL-SQHSTL(6)
        MOVE 11 TO SQL-SQHSTS(6)
        MOVE 0 TO SQL-SQINDV(6)
        MOVE 0 TO SQL-SQINDS(6)
        MOVE 0 TO SQL-SQHARM(6)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(7)
        MOVE 80 TO SQL-SQHSTL(7)
        MOVE 80 TO SQL-SQHSTS(7)
        MOVE 0 TO SQL-SQINDV(7)
        MOVE 0 TO SQL-SQINDS(7)
        MOVE 0 TO SQL-SQHARM(7)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(8)
        MOVE 80 TO SQL-SQHSTL(8)
        MOVE 80 TO SQL-SQHSTS(8)
        MOVE 0 TO SQL-SQINDV(8)
        MOVE 0 TO SQL-SQINDS(8)
        MOVE 0 TO SQL-SQHARM(8)
        CALL "SQLADR" USING
            WS-ACAD-YEAR-RERUN IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(9)
        MOVE 3 TO SQL-SQHSTL(9)
        MOVE 3 TO SQL-SQHSTS(9)
        MOVE 0 TO SQL-SQINDV(9)
        MOVE 0 TO SQL-SQINDS(9)
        MOVE 0 TO SQL-SQHARM(9)
        CALL "SQLADR" USING
            WS-ACAD-YEAR-RERUN IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(10)
        MOVE 3 TO SQL-SQHSTL(10)
        MOVE 3 TO SQL-SQHSTS(10)
        MOVE 0 TO SQL-SQINDV(10)
        MOVE 0 TO SQL-SQINDS(10)
        MOVE 0 TO SQL-SQHARM(10)
        CALL "SQLADR" USING
            WS-END-DATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(11)
        MOVE 11 TO SQL-SQHSTL(11)
        MOVE 11 TO SQL-SQHSTS(11)
        MOVE 0 TO SQL-SQINDV(11)
        MOVE 0 TO SQL-SQINDS(11)
        MOVE 0 TO SQL-SQHARM(11)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
        PERFORM DA-FETCH-NVQ
          UNTIL WS01-EOF.
*
        DISPLAY "TOTAL NVQ FETCHED ", WS01-ROWS-TOTAL WITH CONVERSION.

        MOVE   "D: ERROR CLOSING NVQ COURSES CURSOR"
                                   TO  WS01-ERR-MESSAGE. 
*    
*       EXEC SQL
*           CLOSE   GET_NVQ
*       END-EXEC.
        MOVE 1 TO SQL-ITERS
        MOVE 668 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-ABORT END-IF.
*
D-EXIT.
*
        EXIT.
*
DA-FETCH-NVQ SECTION.
**********************************************************************
*
*       Get a set of NVQ awards and process them.
*
**********************************************************************
DA-START.
*
       MOVE   "DA: ERROR FETCHING NVQ AWARDS"
                                    TO  WS01-ERR-MESSAGE.
*
*      EXEC SQL
*            FETCH   GET_NVQ
*            INTO   :DS01-UNIQUE-CANDIDATE-IDR,
*                   :DS01-UNIQUE-LEARNER-NUM, 
*                   :DS01-UNIQUE-PUPIL-NUM,
*                   :DS01-CANDIDATE-IDR-OTHER,
*                   :DS01-FIRSTNAME-DB,
*                   :DS01-FIRSTNAME-RPT,
*                   :DS01-SURNAME-DB,
*                   :DS01-SURNAME-RPT,
*                   :DS01-GENDER,
*                   :DS01-DOB,
*                   :DS01-NCN,
*                   :DS01-CENTREURN,
*                   :DS01-LEA,
*                   :DS01-CENTRE-IDR-OTHER,
*                   :DS01-UKPRN,
*                   :DS01-CENTRENAME,
*                   :DS01-CENTREADDRESS1,
*                   :DS01-CENTREADDRESS2,
*                   :DS01-CENTREADDRESS3,
*                   :DS01-CENTREADDRESS4,
*                   :DS01-CENTREPOSTCODE,
*                   :DS01-CENTRETYPE,
*                   :DS01-QUAL-NUMBER,
*                   :DS01-SPEC-CODE,
*                   :DS01-SPEC-TITLE,
*                   :DS01-QUAL-TYPE,
*                   :DS01-EXAMSERIES,
*                   :DS01-REG-DATE,
*                   :DS01-FIRST-ENTRY-DATE,
*                   :DS01-AWARD-DATE,
*                   :DS01-QUAL-GRADE,
*                   :DS01-PRIVATE-CANDIDATE,
*                   :DS01-PARTIAL-ABSENCE,
*                   :DS02-REC-TYPE,
*                   :DS02-CANDIDATE-IDR-OTHER,
*                   :DS02-FIRSTNAME-DB,
*                   :DS02-SURNAME-DB,
*                   :DS02-GENDER,
*                   :DS02-DOB,
*                   :DS02-NCN,
*                   :DS02-CENTREURN,
*                   :DS02-CENTRE-IDR-OTHER,
*                   :DS02-UKPRN,
*                   :DS02-CENTRENAME,
*                   :DS02-CENTREADDRESS1,
*                   :DS02-CENTREADDRESS2,
*                   :DS02-CENTREADDRESS3,
*                   :DS02-CENTREADDRESS4,
*                   :DS02-CENTREPOSTCODE,
*                   :DS02-CENTRETYPE,
*                   :DS02-QUAL-NUMBER-TYPE,
*                   :DS02-QUAL-NUMBER,
*                   :DS02-SPEC-CODE,
*                   :DS02-SPEC-TITLE,
*                   :DS02-QUAL-TYPE,
*                   :DS02-REG-DATE,
*                   :DS02-FIRST-ENTRY-DATE,
*                   :DS02-AWARD-DATE,
*                   :DS02-QUAL-GRADE
*      END-EXEC.
       MOVE 500 TO SQL-ITERS
       MOVE 683 TO SQL-OFFSET
       MOVE 0 TO SQL-OCCURS
       MOVE 1 TO SQL-SELERR
       MOVE 0 TO SQL-SQPMEM
       CALL "SQLADR" USING
           SQLCUD
           SQL-CUD
       CALL "SQLADR" USING
           SQLCA
           SQL-SQLEST
       MOVE 4352 TO SQL-SQLETY
       MOVE 0 TO SQL-SQFOFF
       MOVE 2 TO SQL-SQFMOD
       CALL "SQLADR" USING
           DS01-UNIQUE-CANDIDATE-IDR IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(1)
       MOVE 13 TO SQL-SQHSTL(1)
       MOVE 13 TO SQL-SQHSTS(1)
       MOVE 0 TO SQL-SQINDV(1)
       MOVE 0 TO SQL-SQINDS(1)
       MOVE 0 TO SQL-SQHARM(1)
       CALL "SQLADR" USING
           DS01-UNIQUE-LEARNER-NUM IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(2)
       MOVE 10 TO SQL-SQHSTL(2)
       MOVE 10 TO SQL-SQHSTS(2)
       MOVE 0 TO SQL-SQINDV(2)
       MOVE 0 TO SQL-SQINDS(2)
       MOVE 0 TO SQL-SQHARM(2)
       CALL "SQLADR" USING
           DS01-UNIQUE-PUPIL-NUM IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(3)
       MOVE 2 TO SQL-SQHSTL(3)
       MOVE 2 TO SQL-SQHSTS(3)
       MOVE 0 TO SQL-SQINDV(3)
       MOVE 0 TO SQL-SQINDS(3)
       MOVE 0 TO SQL-SQHARM(3)
       CALL "SQLADR" USING
           DS01-CANDIDATE-IDR-OTHER IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(4)
       MOVE 7 TO SQL-SQHSTL(4)
       MOVE 7 TO SQL-SQHSTS(4)
       MOVE 0 TO SQL-SQINDV(4)
       MOVE 0 TO SQL-SQINDS(4)
       MOVE 0 TO SQL-SQHARM(4)
       CALL "SQLADR" USING
           DS01-FIRSTNAME-DB IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(5)
       MOVE 35 TO SQL-SQHSTL(5)
       MOVE 35 TO SQL-SQHSTS(5)
       MOVE 0 TO SQL-SQINDV(5)
       MOVE 0 TO SQL-SQINDS(5)
       MOVE 0 TO SQL-SQHARM(5)
       CALL "SQLADR" USING
           DS01-FIRSTNAME-RPT IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(6)
       MOVE 35 TO SQL-SQHSTL(6)
       MOVE 35 TO SQL-SQHSTS(6)
       MOVE 0 TO SQL-SQINDV(6)
       MOVE 0 TO SQL-SQINDS(6)
       MOVE 0 TO SQL-SQHARM(6)
       CALL "SQLADR" USING
           DS01-SURNAME-DB IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(7)
       MOVE 35 TO SQL-SQHSTL(7)
       MOVE 35 TO SQL-SQHSTS(7)
       MOVE 0 TO SQL-SQINDV(7)
       MOVE 0 TO SQL-SQINDS(7)
       MOVE 0 TO SQL-SQHARM(7)
       CALL "SQLADR" USING
           DS01-SURNAME-RPT IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(8)
       MOVE 35 TO SQL-SQHSTL(8)
       MOVE 35 TO SQL-SQHSTS(8)
       MOVE 0 TO SQL-SQINDV(8)
       MOVE 0 TO SQL-SQINDS(8)
       MOVE 0 TO SQL-SQHARM(8)
       CALL "SQLADR" USING
           DS01-GENDER IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(9)
       MOVE 2 TO SQL-SQHSTL(9)
       MOVE 2 TO SQL-SQHSTS(9)
       MOVE 0 TO SQL-SQINDV(9)
       MOVE 0 TO SQL-SQINDS(9)
       MOVE 0 TO SQL-SQHARM(9)
       CALL "SQLADR" USING
           DS01-DOB IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(10)
       MOVE 10 TO SQL-SQHSTL(10)
       MOVE 10 TO SQL-SQHSTS(10)
       MOVE 0 TO SQL-SQINDV(10)
       MOVE 0 TO SQL-SQINDS(10)
       MOVE 0 TO SQL-SQHARM(10)
       CALL "SQLADR" USING
           DS01-NCN IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(11)
       MOVE 6 TO SQL-SQHSTL(11)
       MOVE 6 TO SQL-SQHSTS(11)
       MOVE 0 TO SQL-SQINDV(11)
       MOVE 0 TO SQL-SQINDS(11)
       MOVE 0 TO SQL-SQHARM(11)
       CALL "SQLADR" USING
           DS01-CENTREURN IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(12)
       MOVE 4 TO SQL-SQHSTL(12)
       MOVE 4 TO SQL-SQHSTS(12)
       MOVE 0 TO SQL-SQINDV(12)
       MOVE 0 TO SQL-SQINDS(12)
       MOVE 0 TO SQL-SQHARM(12)
       CALL "SQLADR" USING
           DS01-LEA IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(13)
       MOVE 3 TO SQL-SQHSTL(13)
       MOVE 3 TO SQL-SQHSTS(13)
       MOVE 0 TO SQL-SQINDV(13)
       MOVE 0 TO SQL-SQINDS(13)
       MOVE 0 TO SQL-SQHARM(13)
       CALL "SQLADR" USING
           DS01-CENTRE-IDR-OTHER IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(14)
       MOVE 6 TO SQL-SQHSTL(14)
       MOVE 6 TO SQL-SQHSTS(14)
       MOVE 0 TO SQL-SQINDV(14)
       MOVE 0 TO SQL-SQINDS(14)
       MOVE 0 TO SQL-SQHARM(14)
       CALL "SQLADR" USING
           DS01-UKPRN IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(15)
       MOVE 4 TO SQL-SQHSTL(15)
       MOVE 4 TO SQL-SQHSTS(15)
       MOVE 0 TO SQL-SQINDV(15)
       MOVE 0 TO SQL-SQINDS(15)
       MOVE 0 TO SQL-SQHARM(15)
       CALL "SQLADR" USING
           DS01-CENTRENAME IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(16)
       MOVE 65 TO SQL-SQHSTL(16)
       MOVE 65 TO SQL-SQHSTS(16)
       MOVE 0 TO SQL-SQINDV(16)
       MOVE 0 TO SQL-SQINDS(16)
       MOVE 0 TO SQL-SQHARM(16)
       CALL "SQLADR" USING
           DS01-CENTREADDRESS1 IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(17)
       MOVE 150 TO SQL-SQHSTL(17)
       MOVE 150 TO SQL-SQHSTS(17)
       MOVE 0 TO SQL-SQINDV(17)
       MOVE 0 TO SQL-SQINDS(17)
       MOVE 0 TO SQL-SQHARM(17)
       CALL "SQLADR" USING
           DS01-CENTREADDRESS2 IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(18)
       MOVE 36 TO SQL-SQHSTL(18)
       MOVE 36 TO SQL-SQHSTS(18)
       MOVE 0 TO SQL-SQINDV(18)
       MOVE 0 TO SQL-SQINDS(18)
       MOVE 0 TO SQL-SQHARM(18)
       CALL "SQLADR" USING
           DS01-CENTREADDRESS3 IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(19)
       MOVE 30 TO SQL-SQHSTL(19)
       MOVE 30 TO SQL-SQHSTS(19)
       MOVE 0 TO SQL-SQINDV(19)
       MOVE 0 TO SQL-SQINDS(19)
       MOVE 0 TO SQL-SQHARM(19)
       CALL "SQLADR" USING
           DS01-CENTREADDRESS4 IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(20)
       MOVE 25 TO SQL-SQHSTL(20)
       MOVE 25 TO SQL-SQHSTS(20)
       MOVE 0 TO SQL-SQINDV(20)
       MOVE 0 TO SQL-SQINDS(20)
       MOVE 0 TO SQL-SQHARM(20)
       CALL "SQLADR" USING
           DS01-CENTREPOSTCODE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(21)
       MOVE 10 TO SQL-SQHSTL(21)
       MOVE 10 TO SQL-SQHSTS(21)
       MOVE 0 TO SQL-SQINDV(21)
       MOVE 0 TO SQL-SQINDS(21)
       MOVE 0 TO SQL-SQHARM(21)
       CALL "SQLADR" USING
           DS01-CENTRETYPE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(22)
       MOVE 2 TO SQL-SQHSTL(22)
       MOVE 2 TO SQL-SQHSTS(22)
       MOVE 0 TO SQL-SQINDV(22)
       MOVE 0 TO SQL-SQINDS(22)
       MOVE 0 TO SQL-SQHARM(22)
       CALL "SQLADR" USING
           DS01-QUAL-NUMBER IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(23)
       MOVE 10 TO SQL-SQHSTL(23)
       MOVE 10 TO SQL-SQHSTS(23)
       MOVE 0 TO SQL-SQINDV(23)
       MOVE 0 TO SQL-SQINDS(23)
       MOVE 0 TO SQL-SQHARM(23)
       CALL "SQLADR" USING
           DS01-SPEC-CODE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(24)
       MOVE 8 TO SQL-SQHSTL(24)
       MOVE 8 TO SQL-SQHSTS(24)
       MOVE 0 TO SQL-SQINDV(24)
       MOVE 0 TO SQL-SQINDS(24)
       MOVE 0 TO SQL-SQHARM(24)
       CALL "SQLADR" USING
           DS01-SPEC-TITLE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(25)
       MOVE 150 TO SQL-SQHSTL(25)
       MOVE 150 TO SQL-SQHSTS(25)
       MOVE 0 TO SQL-SQINDV(25)
       MOVE 0 TO SQL-SQINDS(25)
       MOVE 0 TO SQL-SQHARM(25)
       CALL "SQLADR" USING
           DS01-QUAL-TYPE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(26)
       MOVE 100 TO SQL-SQHSTL(26)
       MOVE 100 TO SQL-SQHSTS(26)
       MOVE 0 TO SQL-SQINDV(26)
       MOVE 0 TO SQL-SQINDS(26)
       MOVE 0 TO SQL-SQHARM(26)
       CALL "SQLADR" USING
           DS01-EXAMSERIES IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(27)
       MOVE 2 TO SQL-SQHSTL(27)
       MOVE 2 TO SQL-SQHSTS(27)
       MOVE 0 TO SQL-SQINDV(27)
       MOVE 0 TO SQL-SQINDS(27)
       MOVE 0 TO SQL-SQHARM(27)
       CALL "SQLADR" USING
           DS01-REG-DATE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(28)
       MOVE 10 TO SQL-SQHSTL(28)
       MOVE 10 TO SQL-SQHSTS(28)
       MOVE 0 TO SQL-SQINDV(28)
       MOVE 0 TO SQL-SQINDS(28)
       MOVE 0 TO SQL-SQHARM(28)
       CALL "SQLADR" USING
           DS01-FIRST-ENTRY-DATE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(29)
       MOVE 10 TO SQL-SQHSTL(29)
       MOVE 10 TO SQL-SQHSTS(29)
       MOVE 0 TO SQL-SQINDV(29)
       MOVE 0 TO SQL-SQINDS(29)
       MOVE 0 TO SQL-SQHARM(29)
       CALL "SQLADR" USING
           DS01-AWARD-DATE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(30)
       MOVE 10 TO SQL-SQHSTL(30)
       MOVE 10 TO SQL-SQHSTS(30)
       MOVE 0 TO SQL-SQINDV(30)
       MOVE 0 TO SQL-SQINDS(30)
       MOVE 0 TO SQL-SQHARM(30)
       CALL "SQLADR" USING
           DS01-QUAL-GRADE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(31)
       MOVE 3 TO SQL-SQHSTL(31)
       MOVE 3 TO SQL-SQHSTS(31)
       MOVE 0 TO SQL-SQINDV(31)
       MOVE 0 TO SQL-SQINDS(31)
       MOVE 0 TO SQL-SQHARM(31)
       CALL "SQLADR" USING
           DS01-PRIVATE-CANDIDATE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(32)
       MOVE 2 TO SQL-SQHSTL(32)
       MOVE 2 TO SQL-SQHSTS(32)
       MOVE 0 TO SQL-SQINDV(32)
       MOVE 0 TO SQL-SQINDS(32)
       MOVE 0 TO SQL-SQHARM(32)
       CALL "SQLADR" USING
           DS01-PARTIAL-ABSENCE IN
           DS01-COURSE-DETAILS(1)
           SQL-SQHSTV(33)
       MOVE 2 TO SQL-SQHSTL(33)
       MOVE 2 TO SQL-SQHSTS(33)
       MOVE 0 TO SQL-SQINDV(33)
       MOVE 0 TO SQL-SQINDS(33)
       MOVE 0 TO SQL-SQHARM(33)
       CALL "SQLADR" USING
           DS02-REC-TYPE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(34)
       MOVE 9 TO SQL-SQHSTL(34)
       MOVE 9 TO SQL-SQHSTS(34)
       MOVE 0 TO SQL-SQINDV(34)
       MOVE 0 TO SQL-SQINDS(34)
       MOVE 0 TO SQL-SQHARM(34)
       CALL "SQLADR" USING
           DS02-CANDIDATE-IDR-OTHER IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(35)
       MOVE 7 TO SQL-SQHSTL(35)
       MOVE 7 TO SQL-SQHSTS(35)
       MOVE 0 TO SQL-SQINDV(35)
       MOVE 0 TO SQL-SQINDS(35)
       MOVE 0 TO SQL-SQHARM(35)
       CALL "SQLADR" USING
           DS02-FIRSTNAME-DB IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(36)
       MOVE 35 TO SQL-SQHSTL(36)
       MOVE 35 TO SQL-SQHSTS(36)
       MOVE 0 TO SQL-SQINDV(36)
       MOVE 0 TO SQL-SQINDS(36)
       MOVE 0 TO SQL-SQHARM(36)
       CALL "SQLADR" USING
           DS02-SURNAME-DB IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(37)
       MOVE 35 TO SQL-SQHSTL(37)
       MOVE 35 TO SQL-SQHSTS(37)
       MOVE 0 TO SQL-SQINDV(37)
       MOVE 0 TO SQL-SQINDS(37)
       MOVE 0 TO SQL-SQHARM(37)
       CALL "SQLADR" USING
           DS02-GENDER IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(38)
       MOVE 2 TO SQL-SQHSTL(38)
       MOVE 2 TO SQL-SQHSTS(38)
       MOVE 0 TO SQL-SQINDV(38)
       MOVE 0 TO SQL-SQINDS(38)
       MOVE 0 TO SQL-SQHARM(38)
       CALL "SQLADR" USING
           DS02-DOB IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(39)
       MOVE 10 TO SQL-SQHSTL(39)
       MOVE 10 TO SQL-SQHSTS(39)
       MOVE 0 TO SQL-SQINDV(39)
       MOVE 0 TO SQL-SQINDS(39)
       MOVE 0 TO SQL-SQHARM(39)
       CALL "SQLADR" USING
           DS02-NCN IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(40)
       MOVE 6 TO SQL-SQHSTL(40)
       MOVE 6 TO SQL-SQHSTS(40)
       MOVE 0 TO SQL-SQINDV(40)
       MOVE 0 TO SQL-SQINDS(40)
       MOVE 0 TO SQL-SQHARM(40)
       CALL "SQLADR" USING
           DS02-CENTREURN IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(41)
       MOVE 4 TO SQL-SQHSTL(41)
       MOVE 4 TO SQL-SQHSTS(41)
       MOVE 0 TO SQL-SQINDV(41)
       MOVE 0 TO SQL-SQINDS(41)
       MOVE 0 TO SQL-SQHARM(41)
       CALL "SQLADR" USING
           DS02-CENTRE-IDR-OTHER IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(42)
       MOVE 6 TO SQL-SQHSTL(42)
       MOVE 6 TO SQL-SQHSTS(42)
       MOVE 0 TO SQL-SQINDV(42)
       MOVE 0 TO SQL-SQINDS(42)
       MOVE 0 TO SQL-SQHARM(42)
       CALL "SQLADR" USING
           DS02-UKPRN IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(43)
       MOVE 4 TO SQL-SQHSTL(43)
       MOVE 4 TO SQL-SQHSTS(43)
       MOVE 0 TO SQL-SQINDV(43)
       MOVE 0 TO SQL-SQINDS(43)
       MOVE 0 TO SQL-SQHARM(43)
       CALL "SQLADR" USING
           DS02-CENTRENAME IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(44)
       MOVE 65 TO SQL-SQHSTL(44)
       MOVE 65 TO SQL-SQHSTS(44)
       MOVE 0 TO SQL-SQINDV(44)
       MOVE 0 TO SQL-SQINDS(44)
       MOVE 0 TO SQL-SQHARM(44)
       CALL "SQLADR" USING
           DS02-CENTREADDRESS1 IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(45)
       MOVE 150 TO SQL-SQHSTL(45)
       MOVE 150 TO SQL-SQHSTS(45)
       MOVE 0 TO SQL-SQINDV(45)
       MOVE 0 TO SQL-SQINDS(45)
       MOVE 0 TO SQL-SQHARM(45)
       CALL "SQLADR" USING
           DS02-CENTREADDRESS2 IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(46)
       MOVE 36 TO SQL-SQHSTL(46)
       MOVE 36 TO SQL-SQHSTS(46)
       MOVE 0 TO SQL-SQINDV(46)
       MOVE 0 TO SQL-SQINDS(46)
       MOVE 0 TO SQL-SQHARM(46)
       CALL "SQLADR" USING
           DS02-CENTREADDRESS3 IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(47)
       MOVE 30 TO SQL-SQHSTL(47)
       MOVE 30 TO SQL-SQHSTS(47)
       MOVE 0 TO SQL-SQINDV(47)
       MOVE 0 TO SQL-SQINDS(47)
       MOVE 0 TO SQL-SQHARM(47)
       CALL "SQLADR" USING
           DS02-CENTREADDRESS4 IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(48)
       MOVE 25 TO SQL-SQHSTL(48)
       MOVE 25 TO SQL-SQHSTS(48)
       MOVE 0 TO SQL-SQINDV(48)
       MOVE 0 TO SQL-SQINDS(48)
       MOVE 0 TO SQL-SQHARM(48)
       CALL "SQLADR" USING
           DS02-CENTREPOSTCODE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(49)
       MOVE 10 TO SQL-SQHSTL(49)
       MOVE 10 TO SQL-SQHSTS(49)
       MOVE 0 TO SQL-SQINDV(49)
       MOVE 0 TO SQL-SQINDS(49)
       MOVE 0 TO SQL-SQHARM(49)
       CALL "SQLADR" USING
           DS02-CENTRETYPE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(50)
       MOVE 2 TO SQL-SQHSTL(50)
       MOVE 2 TO SQL-SQHSTS(50)
       MOVE 0 TO SQL-SQINDV(50)
       MOVE 0 TO SQL-SQINDS(50)
       MOVE 0 TO SQL-SQHARM(50)
       CALL "SQLADR" USING
           DS02-QUAL-NUMBER-TYPE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(51)
       MOVE 5 TO SQL-SQHSTL(51)
       MOVE 5 TO SQL-SQHSTS(51)
       MOVE 0 TO SQL-SQINDV(51)
       MOVE 0 TO SQL-SQINDS(51)
       MOVE 0 TO SQL-SQHARM(51)
       CALL "SQLADR" USING
           DS02-QUAL-NUMBER IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(52)
       MOVE 10 TO SQL-SQHSTL(52)
       MOVE 10 TO SQL-SQHSTS(52)
       MOVE 0 TO SQL-SQINDV(52)
       MOVE 0 TO SQL-SQINDS(52)
       MOVE 0 TO SQL-SQHARM(52)
       CALL "SQLADR" USING
           DS02-SPEC-CODE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(53)
       MOVE 8 TO SQL-SQHSTL(53)
       MOVE 8 TO SQL-SQHSTS(53)
       MOVE 0 TO SQL-SQINDV(53)
       MOVE 0 TO SQL-SQINDS(53)
       MOVE 0 TO SQL-SQHARM(53)
       CALL "SQLADR" USING
           DS02-SPEC-TITLE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(54)
       MOVE 150 TO SQL-SQHSTL(54)
       MOVE 150 TO SQL-SQHSTS(54)
       MOVE 0 TO SQL-SQINDV(54)
       MOVE 0 TO SQL-SQINDS(54)
       MOVE 0 TO SQL-SQHARM(54)
       CALL "SQLADR" USING
           DS02-QUAL-TYPE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(55)
       MOVE 100 TO SQL-SQHSTL(55)
       MOVE 100 TO SQL-SQHSTS(55)
       MOVE 0 TO SQL-SQINDV(55)
       MOVE 0 TO SQL-SQINDS(55)
       MOVE 0 TO SQL-SQHARM(55)
       CALL "SQLADR" USING
           DS02-REG-DATE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(56)
       MOVE 10 TO SQL-SQHSTL(56)
       MOVE 10 TO SQL-SQHSTS(56)
       MOVE 0 TO SQL-SQINDV(56)
       MOVE 0 TO SQL-SQINDS(56)
       MOVE 0 TO SQL-SQHARM(56)
       CALL "SQLADR" USING
           DS02-FIRST-ENTRY-DATE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(57)
       MOVE 10 TO SQL-SQHSTL(57)
       MOVE 10 TO SQL-SQHSTS(57)
       MOVE 0 TO SQL-SQINDV(57)
       MOVE 0 TO SQL-SQINDS(57)
       MOVE 0 TO SQL-SQHARM(57)
       CALL "SQLADR" USING
           DS02-AWARD-DATE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(58)
       MOVE 10 TO SQL-SQHSTL(58)
       MOVE 10 TO SQL-SQHSTS(58)
       MOVE 0 TO SQL-SQINDV(58)
       MOVE 0 TO SQL-SQINDS(58)
       MOVE 0 TO SQL-SQHARM(58)
       CALL "SQLADR" USING
           DS02-QUAL-GRADE IN
           DS02-COURSE-DETAILS(1)
           SQL-SQHSTV(59)
       MOVE 3 TO SQL-SQHSTL(59)
       MOVE 3 TO SQL-SQHSTS(59)
       MOVE 0 TO SQL-SQINDV(59)
       MOVE 0 TO SQL-SQINDS(59)
       MOVE 0 TO SQL-SQHARM(59)
       CALL "SQLADR" USING
           SQL-SQHSTV(1)
           SQL-SQPHSV
       CALL "SQLADR" USING
           SQL-SQHSTL(1)
           SQL-SQPHSL
       CALL "SQLADR" USING
           SQL-SQHSTS(1)
           SQL-SQPHSS
       CALL "SQLADR" USING
           SQL-SQINDV(1)
           SQL-SQPIND
       CALL "SQLADR" USING
           SQL-SQINDS(1)
           SQL-SQPINS
       CALL "SQLADR" USING
           SQL-SQHARM(1)
           SQL-SQPARM
       CALL "SQLADR" USING
           SQL-SQHARC(1)
           SQL-SQPARC

       CALL "SQLBEX" USING
           SQLCTX
           SQLEXD
           SQLFPN

       IF SQLCODE IN SQLCA IS LESS THAN 0
           THEN GO TO ZZ-ABORT END-IF.
*
DA-010.
        IF  SQLCODE IS POSITIVE THEN
            SET     WS01-EOF       TO  TRUE
        END-IF.

        SUBTRACT WS01-ROWS-TOTAL FROM  SQLERRD(3)
                               GIVING  WS01-ROWS-THIS-FETCH.
        MOVE    SQLERRD(3)         TO  WS01-ROWS-TOTAL.
    
        MOVE    WS01-ROWS-TOTAL    TO  WS-NVQ-ROWS-TOTAL
        DISPLAY 'NVQ TOTAL ROWS FETCHED : ' WS-NVQ-ROWS-TOTAL
    
        PERFORM VARYING WS01-INDEX
          FROM 1 BY 1
          UNTIL WS01-INDEX > WS01-ROWS-THIS-FETCH

          MOVE 'N'                 TO  WS-SKIP 

          MOVE DS01-CANDIDATE-IDR-OTHER(WS01-INDEX)
            TO WS-C-CANDIDATE-IDR-OTHER  WS-CANDIDATE

          PERFORM  E-MOVE-VALIDATE-DB-COLS

          IF  SKIP
              ADD  +1   TO  WS-NVQ-IGN-CNT
          ELSE
*LEARNER'S PREVIOUS DRD RECORD DETAILS THRU E-CONTINUE.

            IF  WS-P-CANDIDATE-IDR-OTHER = WS-C-CANDIDATE-IDR-OTHER
                IF  WS-C-QUAL-GRADE = '-2'
                    ADD  +1  TO  WS-NVQ-SKIPPED-CNT
                ELSE 
                    PERFORM M-CANDIDATE-REC-COMPARE
                END-IF
            ELSE
*INSERT LEARNERS INTO DFE_REPORT_DETAILS
              IF  WS-C-QUAL-GRADE = '-2'
                  MOVE 'Entry'      TO WS-REC-TYPE
              ELSE 
                  MOVE 'Result'     TO WS-REC-TYPE
              END-IF
              MOVE 'I'              TO WS-DFE-INS-UPDAT
              MOVE 'N'              TO WS-C-PROG-TYPE
              PERFORM N-DRD-INSERT-UPDAT
            END-IF
*IF SKIP -> END-IF
          END-IF
        END-PERFORM.

        MOVE  WS-NVQ-CNT  TO  WS-TR-DET-NVQ-TOTAL.
*                                   
DA-EXIT.                              
    EXIT.    
*
E-MOVE-VALIDATE-DB-COLS SECTION.
**********************************************************************
* Move & Validate the DB columns section common for both BTEC & NVQ
**********************************************************************
E-START.
*
        MOVE DS01-UNIQUE-CANDIDATE-IDR(WS01-INDEX)
          TO WS-C-UNIQUE-CANDIDATE-IDR

        MOVE DS01-UNIQUE-LEARNER-NUM(WS01-INDEX)
          TO WS-C-UNIQUE-LEARNER-NUM

        MOVE DS01-UNIQUE-PUPIL-NUM(WS01-INDEX)
          TO WS-C-UNIQUE-PUPIL-NUM

        MOVE DS01-FIRSTNAME-DB(WS01-INDEX)   
          TO WS-C-FIRSTNAME 
        MOVE DS01-FIRSTNAME-RPT(WS01-INDEX) 
          TO WS-RPT-FIRSTNAME

        MOVE DS01-SURNAME-DB(WS01-INDEX)
          TO WS-C-SURNAME
        MOVE DS01-SURNAME-RPT(WS01-INDEX)
          TO WS-RPT-SURNAME

        IF WS-RPT-FIRSTNAME = SPACES AND WS-RPT-SURNAME = SPACES
           MOVE 'x'              TO WS-RPT-FIRSTNAME WS-RPT-SURNAME
        ELSE 
           IF WS-RPT-FIRSTNAME NOT = SPACES AND WS-RPT-SURNAME = SPACES
              MOVE WS-RPT-FIRSTNAME TO WS-RPT-SURNAME
              MOVE 'x'              TO WS-RPT-FIRSTNAME
           ELSE 
              IF WS-RPT-FIRSTNAME = SPACES AND WS-RPT-SURNAME NOT = SPACES
                 MOVE 'x'           TO WS-RPT-FIRSTNAME
              END-IF
          END-IF 
        END-IF
              
        MOVE DS01-GENDER(WS01-INDEX)  TO  WS-C-GENDER      

        MOVE DS01-DOB(WS01-INDEX)     TO  WS-C-DOB        
  
        IF DS01-NCN(WS01-INDEX) = '00000'
           MOVE '-2'                 TO WS-C-NCN
        ELSE
           MOVE DS01-NCN(WS01-INDEX) TO WS-C-NCN
        END-IF

        MOVE DS01-CENTREURN(WS01-INDEX)
          TO WS-C-CENTREURN WS-RPT-CENTREURN

        MOVE DS01-LEA(WS01-INDEX)  TO  WS-C-LEA
 
        MOVE DS01-CENTRE-IDR-OTHER(WS01-INDEX)
          TO WS-C-CENTRE-IDR-OTHER

        MOVE DS01-UKPRN(WS01-INDEX)
          TO WS-C-UKPRN WS-RPT-UKPRN
*
*Centre Details
        MOVE DS01-CENTRENAME(WS01-INDEX)
          TO WS-C-CENTRENAME

        MOVE DS01-CENTREADDRESS1(WS01-INDEX) 
          TO WS-C-CENTREADDRESS1

        MOVE DS01-CENTREADDRESS2(WS01-INDEX) 
          TO WS-C-CENTREADDRESS2

        MOVE DS01-CENTREADDRESS3(WS01-INDEX)
          TO WS-C-CENTREADDRESS3

        MOVE DS01-CENTREADDRESS4(WS01-INDEX)
          TO WS-C-CENTREADDRESS4
        
        MOVE DS01-CENTRETYPE(WS01-INDEX)
          TO WS-C-CENTRETYPE

        MOVE DS01-CENTREPOSTCODE(WS01-INDEX)
          TO WS-C-CENTREPOSTCODE

*If centre type is foreign post code is -2          
        IF WS-C-CENTRETYPE = '12'
           MOVE  '-2'  TO  WS-RPT-CENTREPOSTCODE
        ELSE 
           MOVE WS-C-CENTREPOSTCODE
             TO WS-RPT-CENTREPOSTCODE
        END-IF

        MOVE DS01-QUAL-NUMBER(WS01-INDEX)
          TO WS-C-QUAL-NUMBER WS-RPT-QUAL-NUMBER

        IF WS-C-QUAL-NUMBER(1:3) = '100' OR '500' OR '501' 
                         OR '600' OR '601' OR '603' OR '610'
           MOVE 'QAN'  TO  WS-C-QUAL-NUMBER-TYPE
           STRING WS-C-QUAL-NUMBER(1:3) DELIMITED BY SIZE
             '/' DELIMITED BY SIZE
             WS-C-QUAL-NUMBER(4:4) DELIMITED BY SIZE   
             '/' DELIMITED BY SIZE
             WS-C-QUAL-NUMBER(8:1) DELIMITED BY SIZE
             INTO WS-RPT-QUAL-NUMBER
        ELSE 
          IF WS-C-QUAL-NUMBER(1:1) = 'R' OR 'G' OR 'F'
             MOVE 'SQN'  TO  WS-C-QUAL-NUMBER-TYPE
          ELSE 
            IF WS-C-QUAL-NUMBER(1:1) = 'C'
               MOVE 'QIW'  TO  WS-C-QUAL-NUMBER-TYPE
               STRING WS-C-QUAL-NUMBER(1:3) DELIMITED BY SIZE
                 '/' DELIMITED BY SIZE
                 WS-C-QUAL-NUMBER(4:4) DELIMITED BY SIZE   
                 '/' DELIMITED BY SIZE
                 WS-C-QUAL-NUMBER(8:1) DELIMITED BY SIZE
                 INTO WS-RPT-QUAL-NUMBER
            ELSE
*BUSINESS TEST QUAL NUMBER - SKIP
               IF  WS-C-QUAL-NUMBER(1:3) = 'EPA' OR 'ITU'
                   MOVE 'Y'     TO  WS-SKIP
                   GO TO E-EXIT
               ELSE 
                   MOVE 'Other' TO  WS-C-QUAL-NUMBER-TYPE
               END-IF
            END-IF
          END-IF
        END-IF

        MOVE DS01-SPEC-CODE(WS01-INDEX)  TO  WS-C-SPEC-CODE

        MOVE DS01-SPEC-TITLE(WS01-INDEX) TO  WS-C-SPEC-TITLE

        MOVE DS01-QUAL-TYPE(WS01-INDEX)
          TO WS-C-QUAL-TYPE WS-RPT-QUAL-TYPE

*Essential Skills Wales - ESW
        IF  WS-C-QUAL-TYPE = 'Essential Skills Wales'
            MOVE 'Y'     TO  WS-SKIP
            GO TO E-EXIT
        END-IF

*OGQ Check only for BTEC
        IF  BTEC-PROCESS
            IF  WS-C-QUAL-TYPE = 'Other General Qualification'
                MOVE 'Other Vocational Qualification'          
                  TO WS-RPT-QUAL-TYPE
            END-IF
        END-IF

        MOVE DS01-EXAMSERIES(WS01-INDEX)  TO  WS-C-EXAMSERIES

        MOVE DS01-REG-DATE(WS01-INDEX)    TO  WS-C-REG-DATE

        MOVE DS01-FIRST-ENTRY-DATE(WS01-INDEX) 
          TO WS-C-FIRST-ENTRY-DATE WS-C-AWARD-DATE 

        MOVE DS01-QUAL-GRADE(WS01-INDEX)  TO  WS-C-QUAL-GRADE

        MOVE DS01-PRIVATE-CANDIDATE(WS01-INDEX)
          TO WS-C-PRIVATE-CANDIDATE

        MOVE DS01-PARTIAL-ABSENCE(WS01-INDEX) 
          TO WS-C-PARTIAL-ABSENCE.
*
E-CONTINUE.
*LEARNER'S PREVIOUS DRD RECORD DETAILS
        MOVE DS02-REC-TYPE(WS01-INDEX)          
          TO WS-P-REC-TYPE
        MOVE DS02-CANDIDATE-IDR-OTHER(WS01-INDEX) 
          TO WS-P-CANDIDATE-IDR-OTHER
        MOVE DS02-FIRSTNAME-DB(WS01-INDEX)      TO WS-P-FIRSTNAME
        MOVE DS02-SURNAME-DB(WS01-INDEX)        TO WS-P-SURNAME
        MOVE DS02-GENDER(WS01-INDEX)            TO WS-P-GENDER
        MOVE DS02-DOB (WS01-INDEX)              TO WS-P-DOB
        MOVE DS02-NCN (WS01-INDEX)              TO WS-P-NCN
        MOVE DS02-CENTREURN(WS01-INDEX)         TO WS-P-CENTREURN
        MOVE DS02-CENTRE-IDR-OTHER(WS01-INDEX)
          TO WS-P-CENTRE-IDR-OTHER
        MOVE DS02-UKPRN(WS01-INDEX)             TO WS-P-UKPRN
        MOVE DS02-CENTRENAME(WS01-INDEX)        TO WS-P-CENTRENAME
        MOVE DS02-CENTREADDRESS1(WS01-INDEX)    
          TO WS-P-CENTREADDRESS1
        MOVE DS02-CENTREADDRESS2(WS01-INDEX)    
          TO WS-P-CENTREADDRESS2
        MOVE DS02-CENTREADDRESS3(WS01-INDEX)    
          TO WS-P-CENTREADDRESS3
        MOVE DS02-CENTREADDRESS4(WS01-INDEX)    
          TO WS-P-CENTREADDRESS4
        MOVE DS02-CENTREPOSTCODE(WS01-INDEX)    
          TO WS-P-CENTREPOSTCODE
        MOVE DS02-CENTRETYPE(WS01-INDEX)        
          TO WS-P-CENTRETYPE
        MOVE DS02-QUAL-NUMBER-TYPE(WS01-INDEX)
          TO WS-P-QUAL-NUMBER-TYPE
        MOVE DS02-QUAL-NUMBER(WS01-INDEX)       TO WS-P-QUAL-NUMBER
        MOVE DS02-SPEC-CODE(WS01-INDEX)         TO WS-P-SPEC-CODE
        MOVE DS02-SPEC-TITLE(WS01-INDEX)        TO WS-P-SPEC-TITLE
        MOVE DS02-QUAL-TYPE(WS01-INDEX)         TO WS-P-QUAL-TYPE
        MOVE DS02-REG-DATE(WS01-INDEX)          TO WS-P-REG-DATE
        MOVE DS02-FIRST-ENTRY-DATE(WS01-INDEX)  
          TO WS-P-FIRST-ENTRY-DATE
        MOVE DS02-AWARD-DATE(WS01-INDEX)        TO WS-P-AWARD-DATE
        MOVE DS02-QUAL-GRADE(WS01-INDEX)        TO WS-P-QUAL-GRADE.
*
E-EXIT.
      EXIT.
*
I-TERMINATE SECTION.                  
**********************************************************************
*                                     
*       Finish off and say goodbye.   
*                                     
**********************************************************************
I-START.                              
*
    MOVE WS-RUN-DATE              TO WS-TR-H1-RUN-DATE.
    MOVE WS-TR-HEAD-1             TO TOT-RECORD.
    WRITE TOT-RECORD AFTER PAGE.
    MOVE WS-TR-HEAD-2             TO TOT-RECORD.
    WRITE TOT-RECORD AFTER 1.
    MOVE WS-START-DATE            TO WS-TR-H3-START-DATE.
    MOVE WS-END-DATE              TO WS-TR-H3-END-DATE.
    MOVE WS-TR-HEAD-3             TO TOT-RECORD.
    WRITE TOT-RECORD AFTER 2.
    MOVE WS-TR-DETAIL             TO TOT-RECORD.
    WRITE TOT-RECORD AFTER 3.
*
    IF  WS-DFE-IGN-CNT = 0
        MOVE "No Learners Ignored."   TO  WS-DFE-IGNORE-RPT
        MOVE  20                      TO  WS-REC-LENGTH
        WRITE  DI-DETAIL-RECORD     FROM  WS-DFE-IGNORE-RPT
    END-IF
*
    CLOSE   CSV-FILE-B.
    CLOSE   CSV-FILE-N.
    CLOSE   IGNORE-RPT.
    CLOSE   TOTALS-RPT.

    PERFORM K-MAINTAIN-DAUD.

*   EXEC SQL
*        SELECT TO_CHAR (SYSDATE, 'DD-MON-YYYY:HH24:MI')
*        INTO   :WS-TIME-DATE
*        FROM   DUAL
*   END-EXEC.
    CALL "SQLADR" USING SQ0011 SQL-STMT
    MOVE 1 TO SQL-ITERS
    MOVE 934 TO SQL-OFFSET
    MOVE 0 TO SQL-OCCURS
    MOVE 1 TO SQL-SELERR
    MOVE 0 TO SQL-SQPMEM
    CALL "SQLADR" USING
        SQLCUD
        SQL-CUD
    CALL "SQLADR" USING
        SQLCA
        SQL-SQLEST
    MOVE 4352 TO SQL-SQLETY
    CALL "SQLADR" USING
        WS-TIME-DATE
        SQL-SQHSTV(1)
    MOVE 17 TO SQL-SQHSTL(1)
    MOVE 17 TO SQL-SQHSTS(1)
    MOVE 0 TO SQL-SQINDV(1)
    MOVE 0 TO SQL-SQINDS(1)
    MOVE 0 TO SQL-SQHARM(1)
    CALL "SQLADR" USING
        SQL-SQHSTV(1)
        SQL-SQPHSV
    CALL "SQLADR" USING
        SQL-SQHSTL(1)
        SQL-SQPHSL
    CALL "SQLADR" USING
        SQL-SQHSTS(1)
        SQL-SQPHSS
    CALL "SQLADR" USING
        SQL-SQINDV(1)
        SQL-SQPIND
    CALL "SQLADR" USING
        SQL-SQINDS(1)
        SQL-SQPINS
    CALL "SQLADR" USING
        SQL-SQHARM(1)
        SQL-SQPARM
    CALL "SQLADR" USING
        SQL-SQHARC(1)
        SQL-SQPARC

    CALL "SQLBEX" USING
        SQLCTX
        SQLEXD
        SQLFPN

    IF SQLCODE IN SQLCA IS LESS THAN 0
        THEN GO TO ZZ-ABORT END-IF.

    DISPLAY '                                                        '
    DISPLAY '                                                        '
    DISPLAY '********************************************************'
    DISPLAY '           BTEC Records Processed Details               '
    DISPLAY '********************************************************'
    DISPLAY 'Total Fetch Count                # ' WS-BTEC-ROWS-TOTAL
    DISPLAY 'Report Generation Count          # ' WS-BTEC-CNT
    DISPLAY 'Insert Count                     # ' WS-BTEC-INSERT-CNT
    DISPLAY 'Result Update Count (R)          # ' WS-BTEC-UPD-RESULT-CNT
    DISPLAY 'Amendment Update Count (A)       # ' WS-BTEC-UPD-AMEND-CNT
    DISPLAY 'Total (R) + (A) Update Count     # ' WS-BTEC-TOTAL-UPD-CNT
    DISPLAY "Skipped Learner's Count          # " WS-BTEC-SKIPPED-CNT
    DISPLAY "EPA/ITU/ESW Learner's Skip Count # " WS-BTEC-IGN-CNT
    DISPLAY "Blocked Learner's Count          # " WS-BLOCKED-LEARNER-CNT
    DISPLAY "BTEC Ignored Learner's Count     # " WS-DFE-IGN-CNT
    DISPLAY '********************************************************'
    DISPLAY "Blocked Check Call               # " WS-CHECK-BLOCKING-CNT
    DISPLAY '********************************************************'
    DISPLAY '                                                        '
    DISPLAY '                                                        '
    DISPLAY '********************************************************'
    DISPLAY '        NVQ Records Processed Details                   '
    DISPLAY '********************************************************'
    DISPLAY 'Total Fetch Count                # ' WS-NVQ-ROWS-TOTAL
    DISPLAY 'Report Generation Count          # ' WS-NVQ-CNT
    DISPLAY 'Insert Count                     # ' WS-NVQ-INSERT-CNT
    DISPLAY 'Result Update Count (R)          # ' WS-NVQ-UPD-RESULT-CNT
    DISPLAY 'Amendment Update Count (A)       # ' WS-NVQ-UPD-AMEND-CNT
    DISPLAY 'Total (R) + (A) Update Count     # ' WS-NVQ-TOTAL-UPD-CNT
    DISPLAY "Skipped Learner's Count          # " WS-NVQ-SKIPPED-CNT
    DISPLAY "EPA/ITU/ESW Learner's Skip Count # " WS-NVQ-IGN-CNT
    DISPLAY '********************************************************'
    DISPLAY '                                                        '

    DISPLAY ' SSPDFE ENDED AT : ' WS-TIME-DATE.

I-040.
*       EXEC SQL WHENEVER SQLERROR   GO TO I-050 END-EXEC.

*       EXEC SQL COMMIT WORK                     END-EXEC.
        MOVE 1 TO SQL-ITERS
        MOVE 953 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO I-050 END-IF.

        GO TO I-100.
I-050.
        MOVE 'COMMIT WORK FAILED' TO WS-ERR-MESSAGE.
        PERFORM ZZ-ABORT.
I-100.

        DISPLAY "SSPDFE - SUCCESSFULLY COMPLETED".
*
I-EXIT.
*
        EXIT.
*
K-MAINTAIN-DAUD SECTION.
**********************************************************************
* Datafeed Audits
**********************************************************************
K-START.

*       EXEC SQL WHENEVER SQLERROR GO TO K-040 END-EXEC.
*       EXEC SQL WHENEVER SQLWARNING CONTINUE  END-EXEC.
*       EXEC SQL WHENEVER NOT FOUND CONTINUE   END-EXEC.

        IF START-OF-RUN
        THEN
*          EXEC SQL
*            SELECT DAUD_SEQ.NEXTVAL
*            INTO   :WS-DAUD-SEQUENCE
*            FROM   DUAL
*          END-EXEC
           CALL "SQLADR" USING SQ0013 SQL-STMT
           MOVE 1 TO SQL-ITERS
           MOVE 968 TO SQL-OFFSET
           MOVE 0 TO SQL-OCCURS
           MOVE 1 TO SQL-SELERR
           MOVE 0 TO SQL-SQPMEM
           CALL "SQLADR" USING
               SQLCUD
               SQL-CUD
           CALL "SQLADR" USING
               SQLCA
               SQL-SQLEST
           MOVE 4352 TO SQL-SQLETY
           CALL "SQLADR" USING
               WS-DAUD-SEQUENCE IN
               DS02-COURSE-DETAILS
               SQL-SQHSTV(1)
           MOVE 4 TO SQL-SQHSTL(1)
           MOVE 4 TO SQL-SQHSTS(1)
           MOVE 0 TO SQL-SQINDV(1)
           MOVE 0 TO SQL-SQINDS(1)
           MOVE 0 TO SQL-SQHARM(1)
           CALL "SQLADR" USING
               SQL-SQHSTV(1)
               SQL-SQPHSV
           CALL "SQLADR" USING
               SQL-SQHSTL(1)
               SQL-SQPHSL
           CALL "SQLADR" USING
               SQL-SQHSTS(1)
               SQL-SQPHSS
           CALL "SQLADR" USING
               SQL-SQINDV(1)
               SQL-SQPIND
           CALL "SQLADR" USING
               SQL-SQINDS(1)
               SQL-SQPINS
           CALL "SQLADR" USING
               SQL-SQHARM(1)
               SQL-SQPARM
           CALL "SQLADR" USING
               SQL-SQHARC(1)
               SQL-SQPARC

           CALL "SQLBEX" USING
               SQLCTX
               SQLEXD
               SQLFPN

           IF SQLCODE IN SQLCA IS LESS THAN 0
               THEN GO TO K-040 END-IF
        END-IF.

*       EXEC SQL WHENEVER SQLERROR GO TO K-050 END-EXEC.
*       EXEC SQL WHENEVER SQLWARNING CONTINUE  END-EXEC.
*       EXEC SQL WHENEVER NOT FOUND CONTINUE   END-EXEC.

    IF START-OF-RUN
    THEN 
*     EXEC SQL
*       INSERT INTO DATAFEED_AUDITS
*       (DAUD_SEQUENCE,
*        DAUD_MODULE,
*        DAUD_MODULE_DESCR,
*        DAUD_START,
*        DAUD_END,
*        DAUD_AWARDED_FROM,
*        DAUD_AWARDED_TO,
*        DAUD_ACADEMIC_YEAR,
*        DAUD_BTEC_NG_GRADING_DATE,
*        DAUD_REGNS_FROM,
*        DAUD_REGNS_TO,
*        DAUD_OFQUAL_FROM,
*        DAUD_OFQUAL_TO
*       )
*       VALUES
*       (
*        :WS-DAUD-SEQUENCE,
*        'SSDDFE',
*        'BATH',
*        SYSDATE,
*        NULL,
*        :WS-START-DATE,
*        :WS-END-DATE,
*        NULL,
*        TO_DATE(:WS-NG-GRADING-DATE,'YYYY-MM-DD'),
*        :WS-REG-START-DATE,
*        :WS-REG-END-DATE,
*        NULL,
*        NULL
*       )
*     END-EXEC
      CALL "SQLADR" USING SQ0014 SQL-STMT
      MOVE 1 TO SQL-ITERS
      MOVE 987 TO SQL-OFFSET
      MOVE 0 TO SQL-OCCURS
      CALL "SQLADR" USING
          SQLCUD
          SQL-CUD
      CALL "SQLADR" USING
          SQLCA
          SQL-SQLEST
      MOVE 4352 TO SQL-SQLETY
      CALL "SQLADR" USING
          WS-DAUD-SEQUENCE IN
          DS02-COURSE-DETAILS
          SQL-SQHSTV(1)
      MOVE 4 TO SQL-SQHSTL(1)
      MOVE 4 TO SQL-SQHSTS(1)
      MOVE 0 TO SQL-SQINDV(1)
      MOVE 0 TO SQL-SQINDS(1)
      MOVE 0 TO SQL-SQHARM(1)
      CALL "SQLADR" USING
          WS-START-DATE IN
          DS02-COURSE-DETAILS
          SQL-SQHSTV(2)
      MOVE 11 TO SQL-SQHSTL(2)
      MOVE 11 TO SQL-SQHSTS(2)
      MOVE 0 TO SQL-SQINDV(2)
      MOVE 0 TO SQL-SQINDS(2)
      MOVE 0 TO SQL-SQHARM(2)
      CALL "SQLADR" USING
          WS-END-DATE IN
          DS02-COURSE-DETAILS
          SQL-SQHSTV(3)
      MOVE 11 TO SQL-SQHSTL(3)
      MOVE 11 TO SQL-SQHSTS(3)
      MOVE 0 TO SQL-SQINDV(3)
      MOVE 0 TO SQL-SQINDS(3)
      MOVE 0 TO SQL-SQHARM(3)
      CALL "SQLADR" USING
          WS-NG-GRADING-DATE IN
          DS02-COURSE-DETAILS
          SQL-SQHSTV(4)
      MOVE 10 TO SQL-SQHSTL(4)
      MOVE 10 TO SQL-SQHSTS(4)
      MOVE 0 TO SQL-SQINDV(4)
      MOVE 0 TO SQL-SQINDS(4)
      MOVE 0 TO SQL-SQHARM(4)
      CALL "SQLADR" USING
          WS-REG-START-DATE IN
          DS02-COURSE-DETAILS
          SQL-SQHSTV(5)
      MOVE 11 TO SQL-SQHSTL(5)
      MOVE 11 TO SQL-SQHSTS(5)
      MOVE 0 TO SQL-SQINDV(5)
      MOVE 0 TO SQL-SQINDS(5)
      MOVE 0 TO SQL-SQHARM(5)
      CALL "SQLADR" USING
          WS-REG-END-DATE IN
          DS02-COURSE-DETAILS
          SQL-SQHSTV(6)
      MOVE 11 TO SQL-SQHSTL(6)
      MOVE 11 TO SQL-SQHSTS(6)
      MOVE 0 TO SQL-SQINDV(6)
      MOVE 0 TO SQL-SQINDS(6)
      MOVE 0 TO SQL-SQHARM(6)
      CALL "SQLADR" USING
          SQL-SQHSTV(1)
          SQL-SQPHSV
      CALL "SQLADR" USING
          SQL-SQHSTL(1)
          SQL-SQPHSL
      CALL "SQLADR" USING
          SQL-SQHSTS(1)
          SQL-SQPHSS
      CALL "SQLADR" USING
          SQL-SQINDV(1)
          SQL-SQPIND
      CALL "SQLADR" USING
          SQL-SQINDS(1)
          SQL-SQPINS
      CALL "SQLADR" USING
          SQL-SQHARM(1)
          SQL-SQPARM
      CALL "SQLADR" USING
          SQL-SQHARC(1)
          SQL-SQPARC

      CALL "SQLBEX" USING
          SQLCTX
          SQLEXD
          SQLFPN

      IF SQLCODE IN SQLCA IS LESS THAN 0
          THEN GO TO K-050 END-IF

* Commit program start and parameters...

*       EXEC SQL
*         COMMIT WORK
*       END-EXEC
        MOVE 1 TO SQL-ITERS
        MOVE 1026 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO K-050 END-IF
        END-IF.

*       EXEC SQL WHENEVER SQLERROR GO TO K-060 END-EXEC.
*       EXEC SQL WHENEVER SQLWARNING CONTINUE    END-EXEC.
*       EXEC SQL WHENEVER NOT FOUND CONTINUE    END-EXEC.

        IF END-OF-RUN
        THEN 
*             EXEC SQL
*               UPDATE DATAFEED_AUDITS
*               SET    DAUD_END = SYSDATE
*               WHERE  DAUD_SEQUENCE = :WS-DAUD-SEQUENCE
*             END-EXEC
              CALL "SQLADR" USING SQ0016 SQL-STMT
              MOVE 1 TO SQL-ITERS
              MOVE 1041 TO SQL-OFFSET
              MOVE 0 TO SQL-OCCURS
              CALL "SQLADR" USING
                  SQLCUD
                  SQL-CUD
              CALL "SQLADR" USING
                  SQLCA
                  SQL-SQLEST
              MOVE 4352 TO SQL-SQLETY
              CALL "SQLADR" USING
                  WS-DAUD-SEQUENCE IN
                  DS02-COURSE-DETAILS
                  SQL-SQHSTV(1)
              MOVE 4 TO SQL-SQHSTL(1)
              MOVE 4 TO SQL-SQHSTS(1)
              MOVE 0 TO SQL-SQINDV(1)
              MOVE 0 TO SQL-SQINDS(1)
              MOVE 0 TO SQL-SQHARM(1)
              CALL "SQLADR" USING
                  SQL-SQHSTV(1)
                  SQL-SQPHSV
              CALL "SQLADR" USING
                  SQL-SQHSTL(1)
                  SQL-SQPHSL
              CALL "SQLADR" USING
                  SQL-SQHSTS(1)
                  SQL-SQPHSS
              CALL "SQLADR" USING
                  SQL-SQINDV(1)
                  SQL-SQPIND
              CALL "SQLADR" USING
                  SQL-SQINDS(1)
                  SQL-SQPINS
              CALL "SQLADR" USING
                  SQL-SQHARM(1)
                  SQL-SQPARM
              CALL "SQLADR" USING
                  SQL-SQHARC(1)
                  SQL-SQPARC

              CALL "SQLBEX" USING
                  SQLCTX
                  SQLEXD
                  SQLFPN

              IF SQLCODE IN SQLCA IS LESS THAN 0
                  THEN GO TO K-060 END-IF
        END-IF.

    GO TO K-EXIT.
K-040.
        MOVE   "K-040 : ERROR RETRIEVING DAUD SEQUENCE" TO WS01-ERR-MESSAGE.
        PERFORM ZZ-ABORT.
K-050.
        MOVE   "K-050 : ERROR INSERTING DATAFEED_AUDITS" TO WS01-ERR-MESSAGE.
        PERFORM ZZ-ABORT.
K-060.
        MOVE   "K-060 : ERROR UPDATING DATAFEED_AUDITS" TO WS01-ERR-MESSAGE.
        PERFORM ZZ-ABORT.
K-EXIT.
        EXIT.
*
L-CHECK-BLOCKING SECTION.
**********************************************************************
* For un-certificated BTEC NG do not output learner if blocked.
**********************************************************************
L-START.

*       EXEC SQL WHENEVER SQLERROR GO TO L-040 END-EXEC.
*       EXEC SQL WHENEVER SQLWARNING CONTINUE  END-EXEC.
*       EXEC SQL WHENEVER NOT FOUND CONTINUE    END-EXEC.
     
        MOVE +0 TO WS-BLOCK-STATUS-I
*
*       EXEC SQL EXECUTE
*        BEGIN
*         PK_PROVDEF.PR_CHECK_STUDENT_DEFERRAL
*                      (:WS-CANDIDATE
*                      ,:WS-CHECK-UNITS
*                      ,:WS-BLOCK-STATUS:WS-BLOCK-STATUS-I
*                      ,:WS-NPP-ID:WS-NPP-ID-I
*                      ,:WS-DECISION-DATE:WS-DECISION-DATE-I
*                      );
*        END;
*       END-EXEC
        CALL "SQLADR" USING SQ0017 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 1060 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            WS-CANDIDATE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(1)
        MOVE 7 TO SQL-SQHSTL(1)
        MOVE 7 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            WS-CHECK-UNITS
            SQL-SQHSTV(2)
        MOVE 1 TO SQL-SQHSTL(2)
        MOVE 1 TO SQL-SQHSTS(2)
        MOVE 0 TO SQL-SQINDV(2)
        MOVE 0 TO SQL-SQINDS(2)
        MOVE 0 TO SQL-SQHARM(2)
        CALL "SQLADR" USING
            WS-BLOCK-STATUS
            SQL-SQHSTV(3)
        MOVE 1 TO SQL-SQHSTL(3)
        MOVE 1 TO SQL-SQHSTS(3)
        CALL "SQLADR" USING
            WS-BLOCK-STATUS-I
            SQL-SQINDV(3)
        MOVE 0 TO SQL-SQINDS(3)
        MOVE 0 TO SQL-SQHARM(3)
        CALL "SQLADR" USING
            WS-NPP-ID
            SQL-SQHSTV(4)
        MOVE 4 TO SQL-SQHSTL(4)
        MOVE 4 TO SQL-SQHSTS(4)
        CALL "SQLADR" USING
            WS-NPP-ID-I
            SQL-SQINDV(4)
        MOVE 0 TO SQL-SQINDS(4)
        MOVE 0 TO SQL-SQHARM(4)
        CALL "SQLADR" USING
            WS-DECISION-DATE
            SQL-SQHSTV(5)
        MOVE 11 TO SQL-SQHSTL(5)
        MOVE 11 TO SQL-SQHSTS(5)
        CALL "SQLADR" USING
            WS-DECISION-DATE-I
            SQL-SQINDV(5)
        MOVE 0 TO SQL-SQINDS(5)
        MOVE 0 TO SQL-SQHARM(5)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO L-040 END-IF
*
        IF  WS-BLOCK-STATUS-I EQUAL -1
            MOVE  '7'          TO  WS-BLOCK-STATUS
        END-IF
        
        IF  WS-BLOCK-STATUS NOT = '0' THEN
            MOVE  'Y'          TO  WS-BLOCK-IND
            DISPLAY "Student Deferral Block " WS-CANDIDATE
            ADD 1              TO  WS-BLOCKED-LEARNER-CNT
        ELSE 

            MOVE +0 TO WS-STATUS-I
    
*           EXEC SQL EXECUTE
*             BEGIN
*               PK_OSCA1.PR_Q_CERT_STATUS
*                          (:WS-CANDIDATE,NULL,
*                           :WS-STATUS:WS-STATUS-I,
*                           :WS-STATUS2:WS-STATUS2-I,
*                           :WS-DECISION-DATE:WS-DECISION-DATE-I,
*                           :WS-MESSAGE:WS-MESSAGE-I);
*             END;
*           END-EXEC
            CALL "SQLADR" USING SQ0018 SQL-STMT
            MOVE 1 TO SQL-ITERS
            MOVE 1095 TO SQL-OFFSET
            MOVE 0 TO SQL-OCCURS
            CALL "SQLADR" USING
                SQLCUD
                SQL-CUD
            CALL "SQLADR" USING
                SQLCA
                SQL-SQLEST
            MOVE 4352 TO SQL-SQLETY
            CALL "SQLADR" USING
                WS-CANDIDATE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(1)
            MOVE 7 TO SQL-SQHSTL(1)
            MOVE 7 TO SQL-SQHSTS(1)
            MOVE 0 TO SQL-SQINDV(1)
            MOVE 0 TO SQL-SQINDS(1)
            MOVE 0 TO SQL-SQHARM(1)
            CALL "SQLADR" USING
                WS-STATUS
                SQL-SQHSTV(2)
            MOVE 1 TO SQL-SQHSTL(2)
            MOVE 1 TO SQL-SQHSTS(2)
            CALL "SQLADR" USING
                WS-STATUS-I
                SQL-SQINDV(2)
            MOVE 0 TO SQL-SQINDS(2)
            MOVE 0 TO SQL-SQHARM(2)
            CALL "SQLADR" USING
                WS-STATUS2
                SQL-SQHSTV(3)
            MOVE 10 TO SQL-SQHSTL(3)
            MOVE 10 TO SQL-SQHSTS(3)
            CALL "SQLADR" USING
                WS-STATUS2-I
                SQL-SQINDV(3)
            MOVE 0 TO SQL-SQINDS(3)
            MOVE 0 TO SQL-SQHARM(3)
            CALL "SQLADR" USING
                WS-DECISION-DATE
                SQL-SQHSTV(4)
            MOVE 11 TO SQL-SQHSTL(4)
            MOVE 11 TO SQL-SQHSTS(4)
            CALL "SQLADR" USING
                WS-DECISION-DATE-I
                SQL-SQINDV(4)
            MOVE 0 TO SQL-SQINDS(4)
            MOVE 0 TO SQL-SQHARM(4)
            CALL "SQLADR" USING
                WS-MESSAGE
                SQL-SQHSTV(5)
            MOVE 100 TO SQL-SQHSTL(5)
            MOVE 100 TO SQL-SQHSTS(5)
            CALL "SQLADR" USING
                WS-MESSAGE-I
                SQL-SQINDV(5)
            MOVE 0 TO SQL-SQINDS(5)
            MOVE 0 TO SQL-SQHARM(5)
            CALL "SQLADR" USING
                SQL-SQHSTV(1)
                SQL-SQPHSV
            CALL "SQLADR" USING
                SQL-SQHSTL(1)
                SQL-SQPHSL
            CALL "SQLADR" USING
                SQL-SQHSTS(1)
                SQL-SQPHSS
            CALL "SQLADR" USING
                SQL-SQINDV(1)
                SQL-SQPIND
            CALL "SQLADR" USING
                SQL-SQINDS(1)
                SQL-SQPINS
            CALL "SQLADR" USING
                SQL-SQHARM(1)
                SQL-SQPARM
            CALL "SQLADR" USING
                SQL-SQHARC(1)
                SQL-SQPARC

            CALL "SQLBEX" USING
                SQLCTX
                SQLEXD
                SQLFPN

            IF SQLCODE IN SQLCA IS LESS THAN 0
                THEN GO TO L-040 END-IF
    
            IF  WS-STATUS-I EQUAL -1
                MOVE '7'         TO  WS-STATUS
            END-IF
    
            IF  WS-STATUS NOT = '0' THEN
                MOVE 'Y'          TO  WS-BLOCK-IND
                DISPLAY "Certificate Block " WS-CANDIDATE
                ADD 1             TO  WS-BLOCKED-LEARNER-CNT
            END-IF

        END-IF.

        GO TO L-EXIT.
L-040.
    MOVE   "L-040 : ERROR CHECKING BLOCKING" TO WS01-ERR-MESSAGE.
    PERFORM ZZ-ABORT.
L-EXIT.
       EXIT.
*
M-CANDIDATE-REC-COMPARE SECTION.
**********************************************************************
* If a candidate already exists in DFE_REPORT_DETAILS table, compare if 
* any of the columns changed and update the record with the record type  
* either Result or Amendment and other modified columns.
**********************************************************************
M-START.
*
        MOVE 'N' TO WS-COL-UPDATE WS-RES-UPDATE

        IF  WS-P-REC-TYPE = 'Entry'
            IF  WS-P-QUAL-GRADE NOT = WS-C-QUAL-GRADE
                MOVE 'Result'     TO WS-REC-TYPE
                MOVE 'Y'          TO WS-RES-UPDATE
                MOVE 'U'  TO  WS-DFE-INS-UPDAT
                PERFORM N-DRD-INSERT-UPDAT
            ELSE
              IF  BTEC-PROCESS
                  ADD  1  TO  WS-BTEC-SKIPPED-CNT
              ELSE
                  ADD  1  TO  WS-NVQ-SKIPPED-CNT
              END-IF
            END-IF
            GO TO M-EXIT
        END-IF

        IF  WS-P-REC-TYPE = 'Result' OR 'Amendment'
            IF  WS-P-QUAL-GRADE       NOT = WS-C-QUAL-GRADE       
                MOVE 'Y'              TO WS-RES-UPDATE
            ELSE 
              IF  WS-P-FIRSTNAME        NOT = WS-C-FIRSTNAME        OR
                  WS-P-SURNAME          NOT = WS-C-SURNAME          OR
                  WS-P-GENDER           NOT = WS-C-GENDER           OR
                  WS-P-DOB              NOT = WS-C-DOB              OR
                  WS-P-NCN              NOT = WS-C-NCN              OR
                  WS-P-CENTREURN        NOT = WS-C-CENTREURN        OR
                  WS-P-CENTRE-IDR-OTHER NOT = WS-C-CENTRE-IDR-OTHER OR
                  WS-P-UKPRN            NOT = WS-C-UKPRN            OR
                  WS-P-CENTRENAME       NOT = WS-C-CENTRENAME       OR
                  WS-P-CENTREADDRESS1   NOT = WS-C-CENTREADDRESS1   OR
                  WS-P-CENTREADDRESS2   NOT = WS-C-CENTREADDRESS2   OR
                  WS-P-CENTREADDRESS3   NOT = WS-C-CENTREADDRESS3   OR
                  WS-P-CENTREADDRESS4   NOT = WS-C-CENTREADDRESS4   OR
                  WS-P-CENTREPOSTCODE   NOT = WS-C-CENTREPOSTCODE   OR
                  WS-P-CENTRETYPE       NOT = WS-C-CENTRETYPE       OR
                  WS-P-QUAL-NUMBER-TYPE NOT = WS-C-QUAL-NUMBER-TYPE OR
                  WS-P-QUAL-NUMBER      NOT = WS-C-QUAL-NUMBER      OR
                  WS-P-QUAL-TYPE        NOT = WS-C-QUAL-TYPE        OR
                  WS-P-SPEC-CODE        NOT = WS-C-SPEC-CODE        OR
                  WS-P-SPEC-TITLE       NOT = WS-C-SPEC-TITLE       OR
                  WS-P-REG-DATE         NOT = WS-C-REG-DATE         
                    MOVE  'Y'           TO WS-COL-UPDATE
              END-IF 
            END-IF 
        END-IF

        IF  RES-UPDATE
*           EXEC SQL
*                SELECT FN_GET_DFE_RECORD_TYPE(:WS-P-FIRST-ENTRY-DATE,
*                       :WS-C-FIRST-ENTRY-DATE)
*                INTO   :WS-REC-TYPE
*                FROM DUAL
*           END-EXEC
            CALL "SQLADR" USING SQ0019 SQL-STMT
            MOVE 1 TO SQL-ITERS
            MOVE 1130 TO SQL-OFFSET
            MOVE 0 TO SQL-OCCURS
            MOVE 1 TO SQL-SELERR
            MOVE 0 TO SQL-SQPMEM
            CALL "SQLADR" USING
                SQLCUD
                SQL-CUD
            CALL "SQLADR" USING
                SQLCA
                SQL-SQLEST
            MOVE 4352 TO SQL-SQLETY
            CALL "SQLADR" USING
                WS-P-FIRST-ENTRY-DATE IN
                WS-DRD-PREV-RECORD
                SQL-SQHSTV(1)
            MOVE 10 TO SQL-SQHSTL(1)
            MOVE 10 TO SQL-SQHSTS(1)
            MOVE 0 TO SQL-SQINDV(1)
            MOVE 0 TO SQL-SQINDS(1)
            MOVE 0 TO SQL-SQHARM(1)
            CALL "SQLADR" USING
                WS-C-FIRST-ENTRY-DATE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(2)
            MOVE 10 TO SQL-SQHSTL(2)
            MOVE 10 TO SQL-SQHSTS(2)
            MOVE 0 TO SQL-SQINDV(2)
            MOVE 0 TO SQL-SQINDS(2)
            MOVE 0 TO SQL-SQHARM(2)
            CALL "SQLADR" USING
                WS-REC-TYPE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(3)
            MOVE 9 TO SQL-SQHSTL(3)
            MOVE 9 TO SQL-SQHSTS(3)
            MOVE 0 TO SQL-SQINDV(3)
            MOVE 0 TO SQL-SQINDS(3)
            MOVE 0 TO SQL-SQHARM(3)
            CALL "SQLADR" USING
                SQL-SQHSTV(1)
                SQL-SQPHSV
            CALL "SQLADR" USING
                SQL-SQHSTL(1)
                SQL-SQPHSL
            CALL "SQLADR" USING
                SQL-SQHSTS(1)
                SQL-SQPHSS
            CALL "SQLADR" USING
                SQL-SQINDV(1)
                SQL-SQPIND
            CALL "SQLADR" USING
                SQL-SQINDS(1)
                SQL-SQPINS
            CALL "SQLADR" USING
                SQL-SQHARM(1)
                SQL-SQPARM
            CALL "SQLADR" USING
                SQL-SQHARC(1)
                SQL-SQPARC

            CALL "SQLBEX" USING
                SQLCTX
                SQLEXD
                SQLFPN

            IF SQLCODE IN SQLCA IS LESS THAN 0
                THEN GO TO L-040 END-IF
            MOVE 'U'           TO  WS-DFE-INS-UPDAT
            PERFORM N-DRD-INSERT-UPDAT
        ELSE  
          IF  COL-UPDATE
              MOVE 'Amendment'       TO WS-REC-TYPE
              MOVE 'U'  TO  WS-DFE-INS-UPDAT
              PERFORM N-DRD-INSERT-UPDAT
          ELSE
            IF  BTEC-PROCESS
                ADD  1  TO  WS-BTEC-SKIPPED-CNT
            ELSE
                ADD  1  TO  WS-NVQ-SKIPPED-CNT
            END-IF
          END-IF
        END-IF.
*
M-EXIT.
        EXIT.
*
N-DRD-INSERT-UPDAT SECTION.
**********************************************************************
* Insert DFE_REPORT_DETAILS for the first with the Record Type
* 'Entry' else Update 'Amendment' if there is any changes to any of the
* columns.
**********************************************************************
N-START.

        IF  DFE-UPDAT

*           EXEC SQL WHENEVER SQLERROR GO TO N-050 END-EXEC.
*           EXEC SQL WHENEVER SQLWARNING CONTINUE  END-EXEC.
*           EXEC SQL WHENEVER NOT FOUND CONTINUE   END-EXEC.
        
*           EXEC  SQL
*                 UPDATE  DFE_REPORT_DETAILS
*                 SET  DRD_REC_TYPE = :WS-REC-TYPE
*                     ,DRD_UCI_REF  = :WS-C-UNIQUE-CANDIDATE-IDR
*                     ,DRD_ULN = :WS-C-UNIQUE-LEARNER-NUM
*                     ,DRD_FORENAMES = DECODE(:WS-C-FIRSTNAME,
*                        ' ',NULL,:WS-C-FIRSTNAME)
*                     ,DRD_SURNAME = DECODE(:WS-C-SURNAME,
*                        ' ',NULL,:WS-C-SURNAME)
*                     ,DRD_SEX = :WS-C-GENDER
*                     ,DRD_BIRTH_DATE = :WS-C-DOB
*                     ,DRD_NCN = :WS-C-NCN      
*                     ,DRD_URN = :WS-C-CENTREURN
*                     ,DRD_CENTRE_ID = :WS-C-CENTRE-IDR-OTHER
*                     ,DRD_UKPRN = :WS-C-UKPRN
*                     ,DRD_CENTRE_NAME = :WS-C-CENTRENAME
*                     ,DRD_ADDRESS_1 = DECODE(:WS-C-CENTREADDRESS1,
*                        ' ',NULL,:WS-C-CENTREADDRESS1)
*                     ,DRD_ADDRESS_2 = DECODE(:WS-C-CENTREADDRESS2,
*                        ' ',NULL,:WS-C-CENTREADDRESS2)
*                     ,DRD_ADDRESS_3 = DECODE(:WS-C-CENTREADDRESS3,
*                        ' ',NULL,:WS-C-CENTREADDRESS3)
*                     ,DRD_ADDRESS_4 = DECODE(:WS-C-CENTREADDRESS4,
*                        ' ',NULL,:WS-C-CENTREADDRESS4)
*                     ,DRD_POSTCODE = :WS-C-CENTREPOSTCODE
*                     ,DRD_CENTRE_TYPE = :WS-C-CENTRETYPE
*                     ,DRD_QUAL_NUM_TYPE = :WS-C-QUAL-NUMBER-TYPE
*                     ,DRD_QUAL_NUMBER = :WS-C-QUAL-NUMBER
*                     ,DRD_SPEC_CODE = :WS-C-SPEC-CODE
*                     ,DRD_SPEC_TITLE = :WS-C-SPEC-TITLE
*                     ,DRD_QUAL_TYPE = :WS-C-QUAL-TYPE
*                     ,DRD_REG_DATE = :WS-C-REG-DATE
*                     ,DRD_FIRST_ENTRY_DATE = 
*                      DECODE(:WS-RES-UPDATE,'Y',:WS-C-FIRST-ENTRY-DATE,
*                             DRD_FIRST_ENTRY_DATE)  
*                     ,DRD_AWARD_DATE = 
*                      DECODE(:WS-RES-UPDATE,'Y',:WS-C-AWARD-DATE,
*                             DRD_AWARD_DATE) 
*                     ,DRD_QUAL_GRADE = :WS-C-QUAL-GRADE
*                     ,DRD_AMEND_CUTOFF_DATE = NVL(DRD_AMEND_CUTOFF_DATE,
*                      TO_DATE(:WS-AMEND-CUTOFF-DATE,'DD-MON-YYYY'))
*                     ,DRD_USER_NAME  = :WS-USER-NAME
*                     ,DRD_UPDATE_DATE = SYSDATE
*                 WHERE DRD_ST_REG_NO   = :WS-CANDIDATE
*           END-EXEC
            CALL "SQLADR" USING SQ0020 SQL-STMT
            MOVE 1 TO SQL-ITERS
            MOVE 1157 TO SQL-OFFSET
            MOVE 0 TO SQL-OCCURS
            CALL "SQLADR" USING
                SQLCUD
                SQL-CUD
            CALL "SQLADR" USING
                SQLCA
                SQL-SQLEST
            MOVE 4352 TO SQL-SQLETY
            CALL "SQLADR" USING
                WS-REC-TYPE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(1)
            MOVE 9 TO SQL-SQHSTL(1)
            MOVE 9 TO SQL-SQHSTS(1)
            MOVE 0 TO SQL-SQINDV(1)
            MOVE 0 TO SQL-SQINDS(1)
            MOVE 0 TO SQL-SQHARM(1)
            CALL "SQLADR" USING
                WS-C-UNIQUE-CANDIDATE-IDR IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(2)
            MOVE 13 TO SQL-SQHSTL(2)
            MOVE 13 TO SQL-SQHSTS(2)
            MOVE 0 TO SQL-SQINDV(2)
            MOVE 0 TO SQL-SQINDS(2)
            MOVE 0 TO SQL-SQHARM(2)
            CALL "SQLADR" USING
                WS-C-UNIQUE-LEARNER-NUM IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(3)
            MOVE 10 TO SQL-SQHSTL(3)
            MOVE 10 TO SQL-SQHSTS(3)
            MOVE 0 TO SQL-SQINDV(3)
            MOVE 0 TO SQL-SQINDS(3)
            MOVE 0 TO SQL-SQHARM(3)
            CALL "SQLADR" USING
                WS-C-FIRSTNAME IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(4)
            MOVE 35 TO SQL-SQHSTL(4)
            MOVE 35 TO SQL-SQHSTS(4)
            MOVE 0 TO SQL-SQINDV(4)
            MOVE 0 TO SQL-SQINDS(4)
            MOVE 0 TO SQL-SQHARM(4)
            CALL "SQLADR" USING
                WS-C-FIRSTNAME IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(5)
            MOVE 35 TO SQL-SQHSTL(5)
            MOVE 35 TO SQL-SQHSTS(5)
            MOVE 0 TO SQL-SQINDV(5)
            MOVE 0 TO SQL-SQINDS(5)
            MOVE 0 TO SQL-SQHARM(5)
            CALL "SQLADR" USING
                WS-C-SURNAME IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(6)
            MOVE 35 TO SQL-SQHSTL(6)
            MOVE 35 TO SQL-SQHSTS(6)
            MOVE 0 TO SQL-SQINDV(6)
            MOVE 0 TO SQL-SQINDS(6)
            MOVE 0 TO SQL-SQHARM(6)
            CALL "SQLADR" USING
                WS-C-SURNAME IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(7)
            MOVE 35 TO SQL-SQHSTL(7)
            MOVE 35 TO SQL-SQHSTS(7)
            MOVE 0 TO SQL-SQINDV(7)
            MOVE 0 TO SQL-SQINDS(7)
            MOVE 0 TO SQL-SQHARM(7)
            CALL "SQLADR" USING
                WS-C-GENDER IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(8)
            MOVE 2 TO SQL-SQHSTL(8)
            MOVE 2 TO SQL-SQHSTS(8)
            MOVE 0 TO SQL-SQINDV(8)
            MOVE 0 TO SQL-SQINDS(8)
            MOVE 0 TO SQL-SQHARM(8)
            CALL "SQLADR" USING
                WS-C-DOB IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(9)
            MOVE 10 TO SQL-SQHSTL(9)
            MOVE 10 TO SQL-SQHSTS(9)
            MOVE 0 TO SQL-SQINDV(9)
            MOVE 0 TO SQL-SQINDS(9)
            MOVE 0 TO SQL-SQHARM(9)
            CALL "SQLADR" USING
                WS-C-NCN IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(10)
            MOVE 6 TO SQL-SQHSTL(10)
            MOVE 6 TO SQL-SQHSTS(10)
            MOVE 0 TO SQL-SQINDV(10)
            MOVE 0 TO SQL-SQINDS(10)
            MOVE 0 TO SQL-SQHARM(10)
            CALL "SQLADR" USING
                WS-C-CENTREURN IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(11)
            MOVE 4 TO SQL-SQHSTL(11)
            MOVE 4 TO SQL-SQHSTS(11)
            MOVE 0 TO SQL-SQINDV(11)
            MOVE 0 TO SQL-SQINDS(11)
            MOVE 0 TO SQL-SQHARM(11)
            CALL "SQLADR" USING
                WS-C-CENTRE-IDR-OTHER IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(12)
            MOVE 6 TO SQL-SQHSTL(12)
            MOVE 6 TO SQL-SQHSTS(12)
            MOVE 0 TO SQL-SQINDV(12)
            MOVE 0 TO SQL-SQINDS(12)
            MOVE 0 TO SQL-SQHARM(12)
            CALL "SQLADR" USING
                WS-C-UKPRN IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(13)
            MOVE 4 TO SQL-SQHSTL(13)
            MOVE 4 TO SQL-SQHSTS(13)
            MOVE 0 TO SQL-SQINDV(13)
            MOVE 0 TO SQL-SQINDS(13)
            MOVE 0 TO SQL-SQHARM(13)
            CALL "SQLADR" USING
                WS-C-CENTRENAME IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(14)
            MOVE 65 TO SQL-SQHSTL(14)
            MOVE 65 TO SQL-SQHSTS(14)
            MOVE 0 TO SQL-SQINDV(14)
            MOVE 0 TO SQL-SQINDS(14)
            MOVE 0 TO SQL-SQHARM(14)
            CALL "SQLADR" USING
                WS-C-CENTREADDRESS1 IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(15)
            MOVE 150 TO SQL-SQHSTL(15)
            MOVE 150 TO SQL-SQHSTS(15)
            MOVE 0 TO SQL-SQINDV(15)
            MOVE 0 TO SQL-SQINDS(15)
            MOVE 0 TO SQL-SQHARM(15)
            CALL "SQLADR" USING
                WS-C-CENTREADDRESS1 IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(16)
            MOVE 150 TO SQL-SQHSTL(16)
            MOVE 150 TO SQL-SQHSTS(16)
            MOVE 0 TO SQL-SQINDV(16)
            MOVE 0 TO SQL-SQINDS(16)
            MOVE 0 TO SQL-SQHARM(16)
            CALL "SQLADR" USING
                WS-C-CENTREADDRESS2 IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(17)
            MOVE 36 TO SQL-SQHSTL(17)
            MOVE 36 TO SQL-SQHSTS(17)
            MOVE 0 TO SQL-SQINDV(17)
            MOVE 0 TO SQL-SQINDS(17)
            MOVE 0 TO SQL-SQHARM(17)
            CALL "SQLADR" USING
                WS-C-CENTREADDRESS2 IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(18)
            MOVE 36 TO SQL-SQHSTL(18)
            MOVE 36 TO SQL-SQHSTS(18)
            MOVE 0 TO SQL-SQINDV(18)
            MOVE 0 TO SQL-SQINDS(18)
            MOVE 0 TO SQL-SQHARM(18)
            CALL "SQLADR" USING
                WS-C-CENTREADDRESS3 IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(19)
            MOVE 30 TO SQL-SQHSTL(19)
            MOVE 30 TO SQL-SQHSTS(19)
            MOVE 0 TO SQL-SQINDV(19)
            MOVE 0 TO SQL-SQINDS(19)
            MOVE 0 TO SQL-SQHARM(19)
            CALL "SQLADR" USING
                WS-C-CENTREADDRESS3 IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(20)
            MOVE 30 TO SQL-SQHSTL(20)
            MOVE 30 TO SQL-SQHSTS(20)
            MOVE 0 TO SQL-SQINDV(20)
            MOVE 0 TO SQL-SQINDS(20)
            MOVE 0 TO SQL-SQHARM(20)
            CALL "SQLADR" USING
                WS-C-CENTREADDRESS4 IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(21)
            MOVE 25 TO SQL-SQHSTL(21)
            MOVE 25 TO SQL-SQHSTS(21)
            MOVE 0 TO SQL-SQINDV(21)
            MOVE 0 TO SQL-SQINDS(21)
            MOVE 0 TO SQL-SQHARM(21)
            CALL "SQLADR" USING
                WS-C-CENTREADDRESS4 IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(22)
            MOVE 25 TO SQL-SQHSTL(22)
            MOVE 25 TO SQL-SQHSTS(22)
            MOVE 0 TO SQL-SQINDV(22)
            MOVE 0 TO SQL-SQINDS(22)
            MOVE 0 TO SQL-SQHARM(22)
            CALL "SQLADR" USING
                WS-C-CENTREPOSTCODE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(23)
            MOVE 10 TO SQL-SQHSTL(23)
            MOVE 10 TO SQL-SQHSTS(23)
            MOVE 0 TO SQL-SQINDV(23)
            MOVE 0 TO SQL-SQINDS(23)
            MOVE 0 TO SQL-SQHARM(23)
            CALL "SQLADR" USING
                WS-C-CENTRETYPE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(24)
            MOVE 2 TO SQL-SQHSTL(24)
            MOVE 2 TO SQL-SQHSTS(24)
            MOVE 0 TO SQL-SQINDV(24)
            MOVE 0 TO SQL-SQINDS(24)
            MOVE 0 TO SQL-SQHARM(24)
            CALL "SQLADR" USING
                WS-C-QUAL-NUMBER-TYPE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(25)
            MOVE 5 TO SQL-SQHSTL(25)
            MOVE 5 TO SQL-SQHSTS(25)
            MOVE 0 TO SQL-SQINDV(25)
            MOVE 0 TO SQL-SQINDS(25)
            MOVE 0 TO SQL-SQHARM(25)
            CALL "SQLADR" USING
                WS-C-QUAL-NUMBER IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(26)
            MOVE 10 TO SQL-SQHSTL(26)
            MOVE 10 TO SQL-SQHSTS(26)
            MOVE 0 TO SQL-SQINDV(26)
            MOVE 0 TO SQL-SQINDS(26)
            MOVE 0 TO SQL-SQHARM(26)
            CALL "SQLADR" USING
                WS-C-SPEC-CODE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(27)
            MOVE 8 TO SQL-SQHSTL(27)
            MOVE 8 TO SQL-SQHSTS(27)
            MOVE 0 TO SQL-SQINDV(27)
            MOVE 0 TO SQL-SQINDS(27)
            MOVE 0 TO SQL-SQHARM(27)
            CALL "SQLADR" USING
                WS-C-SPEC-TITLE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(28)
            MOVE 150 TO SQL-SQHSTL(28)
            MOVE 150 TO SQL-SQHSTS(28)
            MOVE 0 TO SQL-SQINDV(28)
            MOVE 0 TO SQL-SQINDS(28)
            MOVE 0 TO SQL-SQHARM(28)
            CALL "SQLADR" USING
                WS-C-QUAL-TYPE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(29)
            MOVE 100 TO SQL-SQHSTL(29)
            MOVE 100 TO SQL-SQHSTS(29)
            MOVE 0 TO SQL-SQINDV(29)
            MOVE 0 TO SQL-SQINDS(29)
            MOVE 0 TO SQL-SQHARM(29)
            CALL "SQLADR" USING
                WS-C-REG-DATE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(30)
            MOVE 10 TO SQL-SQHSTL(30)
            MOVE 10 TO SQL-SQHSTS(30)
            MOVE 0 TO SQL-SQINDV(30)
            MOVE 0 TO SQL-SQINDS(30)
            MOVE 0 TO SQL-SQHARM(30)
            CALL "SQLADR" USING
                WS-RES-UPDATE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(31)
            MOVE 1 TO SQL-SQHSTL(31)
            MOVE 1 TO SQL-SQHSTS(31)
            MOVE 0 TO SQL-SQINDV(31)
            MOVE 0 TO SQL-SQINDS(31)
            MOVE 0 TO SQL-SQHARM(31)
            CALL "SQLADR" USING
                WS-C-FIRST-ENTRY-DATE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(32)
            MOVE 10 TO SQL-SQHSTL(32)
            MOVE 10 TO SQL-SQHSTS(32)
            MOVE 0 TO SQL-SQINDV(32)
            MOVE 0 TO SQL-SQINDS(32)
            MOVE 0 TO SQL-SQHARM(32)
            CALL "SQLADR" USING
                WS-RES-UPDATE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(33)
            MOVE 1 TO SQL-SQHSTL(33)
            MOVE 1 TO SQL-SQHSTS(33)
            MOVE 0 TO SQL-SQINDV(33)
            MOVE 0 TO SQL-SQINDS(33)
            MOVE 0 TO SQL-SQHARM(33)
            CALL "SQLADR" USING
                WS-C-AWARD-DATE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(34)
            MOVE 10 TO SQL-SQHSTL(34)
            MOVE 10 TO SQL-SQHSTS(34)
            MOVE 0 TO SQL-SQINDV(34)
            MOVE 0 TO SQL-SQINDS(34)
            MOVE 0 TO SQL-SQHARM(34)
            CALL "SQLADR" USING
                WS-C-QUAL-GRADE IN
                WS-DRD-CURR-RECORD
                SQL-SQHSTV(35)
            MOVE 3 TO SQL-SQHSTL(35)
            MOVE 3 TO SQL-SQHSTS(35)
            MOVE 0 TO SQL-SQINDV(35)
            MOVE 0 TO SQL-SQINDS(35)
            MOVE 0 TO SQL-SQHARM(35)
            CALL "SQLADR" USING
                WS-AMEND-CUTOFF-DATE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(36)
            MOVE 11 TO SQL-SQHSTL(36)
            MOVE 11 TO SQL-SQHSTS(36)
            MOVE 0 TO SQL-SQINDV(36)
            MOVE 0 TO SQL-SQINDS(36)
            MOVE 0 TO SQL-SQHARM(36)
            CALL "SQLADR" USING
                WS-USER-NAME
                SQL-SQHSTV(37)
            MOVE 15 TO SQL-SQHSTL(37)
            MOVE 15 TO SQL-SQHSTS(37)
            MOVE 0 TO SQL-SQINDV(37)
            MOVE 0 TO SQL-SQINDS(37)
            MOVE 0 TO SQL-SQHARM(37)
            CALL "SQLADR" USING
                WS-CANDIDATE IN
                DS02-COURSE-DETAILS
                SQL-SQHSTV(38)
            MOVE 7 TO SQL-SQHSTL(38)
            MOVE 7 TO SQL-SQHSTS(38)
            MOVE 0 TO SQL-SQINDV(38)
            MOVE 0 TO SQL-SQINDS(38)
            MOVE 0 TO SQL-SQHARM(38)
            CALL "SQLADR" USING
                SQL-SQHSTV(1)
                SQL-SQPHSV
            CALL "SQLADR" USING
                SQL-SQHSTL(1)
                SQL-SQPHSL
            CALL "SQLADR" USING
                SQL-SQHSTS(1)
                SQL-SQPHSS
            CALL "SQLADR" USING
                SQL-SQINDV(1)
                SQL-SQPIND
            CALL "SQLADR" USING
                SQL-SQINDS(1)
                SQL-SQPINS
            CALL "SQLADR" USING
                SQL-SQHARM(1)
                SQL-SQPARM
            CALL "SQLADR" USING
                SQL-SQHARC(1)
                SQL-SQPARC

            CALL "SQLBEX" USING
                SQLCTX
                SQLEXD
                SQLFPN

            IF SQLCODE IN SQLCA IS LESS THAN 0
                THEN GO TO N-050 END-IF

            IF  BTEC-PROCESS
                ADD  +1  TO  WS-BTEC-TOTAL-UPD-CNT
                IF  WS-REC-TYPE = 'Result'
                    ADD  +1  TO  WS-BTEC-UPD-RESULT-CNT
                ELSE 
                    ADD  +1  TO  WS-BTEC-UPD-AMEND-CNT
                END-IF
            ELSE
                ADD  +1  TO  WS-NVQ-TOTAL-UPD-CNT
                IF  WS-REC-TYPE = 'Result'
                    ADD  +1  TO  WS-NVQ-UPD-RESULT-CNT
                ELSE 
                    ADD  +1  TO  WS-NVQ-UPD-AMEND-CNT
                END-IF
            END-IF

        ELSE 
        
*           EXEC SQL WHENEVER SQLERROR GO TO N-060 END-EXEC.
*           EXEC SQL WHENEVER SQLWARNING CONTINUE  END-EXEC.
*           EXEC SQL WHENEVER NOT FOUND CONTINUE   END-EXEC.
            
            IF  WS-REC-TYPE = 'Entry' OR 'Result'
*               EXEC SQL
*                 INSERT INTO DFE_REPORT_DETAILS VALUES
*                   (:WS-REC-TYPE
*                   ,:WS-C-UNIQUE-CANDIDATE-IDR
*                   ,:WS-C-UNIQUE-LEARNER-NUM
*                   ,:WS-C-UNIQUE-PUPIL-NUM
*                   ,:WS-C-CANDIDATE-IDR-OTHER
*                   ,DECODE(:WS-C-FIRSTNAME,' ',NULL,:WS-C-FIRSTNAME)
*                   ,NULL
*                   ,DECODE(:WS-C-SURNAME,' ',NULL,:WS-C-SURNAME)
*                   ,:WS-C-GENDER
*                   ,:WS-C-DOB
*                   ,:WS-C-NCN
*                   ,:WS-C-CENTREURN
*                   ,:WS-C-LEA
*                   ,:WS-C-CENTRE-IDR-OTHER
*                   ,:WS-C-UKPRN
*                   ,:WS-C-CENTRENAME
*                   ,DECODE(:WS-C-CENTREADDRESS1,' ',NULL,
*                    :WS-C-CENTREADDRESS1)
*                   ,DECODE(:WS-C-CENTREADDRESS2,' ',NULL,
*                    :WS-C-CENTREADDRESS2)
*                   ,DECODE(:WS-C-CENTREADDRESS3,' ',NULL,
*                    :WS-C-CENTREADDRESS3)
*                   ,DECODE(:WS-C-CENTREADDRESS4,' ',NULL,
*                    :WS-C-CENTREADDRESS4)
*                   ,:WS-C-CENTREPOSTCODE
*                   ,:WS-C-CENTRETYPE
*                   ,:WS-C-QUAL-NUMBER-TYPE
*                   ,:WS-C-QUAL-NUMBER
*                   ,:WS-C-SPEC-CODE
*                   ,:WS-C-SPEC-TITLE
*                   ,:WS-C-QUAL-TYPE
*                   ,:WS-C-EXAMSERIES
*                   ,:WS-C-REG-DATE
*                   ,:WS-C-FIRST-ENTRY-DATE
*                   ,:WS-C-AWARD-DATE
*                   ,:WS-C-QUAL-GRADE
*                   ,:WS-C-PRIVATE-CANDIDATE
*                   ,:WS-C-PARTIAL-ABSENCE
*                   ,DECODE(:WS-REC-TYPE,'Result',
*                    TO_DATE(:WS-AMEND-CUTOFF-DATE,'DD-MON-YYYY'),NULL)
*                   ,:WS-C-PROG-TYPE
*                   ,:WS-USER-NAME
*                   ,SYSDATE
*                   ,NULL
*                   )
*               END-EXEC
                CALL "SQLADR" USING SQ0021 SQL-STMT
                MOVE 1 TO SQL-ITERS
                MOVE 1324 TO SQL-OFFSET
                MOVE 0 TO SQL-OCCURS
                CALL "SQLADR" USING
                    SQLCUD
                    SQL-CUD
                CALL "SQLADR" USING
                    SQLCA
                    SQL-SQLEST
                MOVE 4352 TO SQL-SQLETY
                CALL "SQLADR" USING
                    WS-REC-TYPE IN
                    DS02-COURSE-DETAILS
                    SQL-SQHSTV(1)
                MOVE 9 TO SQL-SQHSTL(1)
                MOVE 9 TO SQL-SQHSTS(1)
                MOVE 0 TO SQL-SQINDV(1)
                MOVE 0 TO SQL-SQINDS(1)
                MOVE 0 TO SQL-SQHARM(1)
                CALL "SQLADR" USING
                    WS-C-UNIQUE-CANDIDATE-IDR IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(2)
                MOVE 13 TO SQL-SQHSTL(2)
                MOVE 13 TO SQL-SQHSTS(2)
                MOVE 0 TO SQL-SQINDV(2)
                MOVE 0 TO SQL-SQINDS(2)
                MOVE 0 TO SQL-SQHARM(2)
                CALL "SQLADR" USING
                    WS-C-UNIQUE-LEARNER-NUM IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(3)
                MOVE 10 TO SQL-SQHSTL(3)
                MOVE 10 TO SQL-SQHSTS(3)
                MOVE 0 TO SQL-SQINDV(3)
                MOVE 0 TO SQL-SQINDS(3)
                MOVE 0 TO SQL-SQHARM(3)
                CALL "SQLADR" USING
                    WS-C-UNIQUE-PUPIL-NUM IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(4)
                MOVE 2 TO SQL-SQHSTL(4)
                MOVE 2 TO SQL-SQHSTS(4)
                MOVE 0 TO SQL-SQINDV(4)
                MOVE 0 TO SQL-SQINDS(4)
                MOVE 0 TO SQL-SQHARM(4)
                CALL "SQLADR" USING
                    WS-C-CANDIDATE-IDR-OTHER IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(5)
                MOVE 7 TO SQL-SQHSTL(5)
                MOVE 7 TO SQL-SQHSTS(5)
                MOVE 0 TO SQL-SQINDV(5)
                MOVE 0 TO SQL-SQINDS(5)
                MOVE 0 TO SQL-SQHARM(5)
                CALL "SQLADR" USING
                    WS-C-FIRSTNAME IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(6)
                MOVE 35 TO SQL-SQHSTL(6)
                MOVE 35 TO SQL-SQHSTS(6)
                MOVE 0 TO SQL-SQINDV(6)
                MOVE 0 TO SQL-SQINDS(6)
                MOVE 0 TO SQL-SQHARM(6)
                CALL "SQLADR" USING
                    WS-C-FIRSTNAME IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(7)
                MOVE 35 TO SQL-SQHSTL(7)
                MOVE 35 TO SQL-SQHSTS(7)
                MOVE 0 TO SQL-SQINDV(7)
                MOVE 0 TO SQL-SQINDS(7)
                MOVE 0 TO SQL-SQHARM(7)
                CALL "SQLADR" USING
                    WS-C-SURNAME IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(8)
                MOVE 35 TO SQL-SQHSTL(8)
                MOVE 35 TO SQL-SQHSTS(8)
                MOVE 0 TO SQL-SQINDV(8)
                MOVE 0 TO SQL-SQINDS(8)
                MOVE 0 TO SQL-SQHARM(8)
                CALL "SQLADR" USING
                    WS-C-SURNAME IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(9)
                MOVE 35 TO SQL-SQHSTL(9)
                MOVE 35 TO SQL-SQHSTS(9)
                MOVE 0 TO SQL-SQINDV(9)
                MOVE 0 TO SQL-SQINDS(9)
                MOVE 0 TO SQL-SQHARM(9)
                CALL "SQLADR" USING
                    WS-C-GENDER IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(10)
                MOVE 2 TO SQL-SQHSTL(10)
                MOVE 2 TO SQL-SQHSTS(10)
                MOVE 0 TO SQL-SQINDV(10)
                MOVE 0 TO SQL-SQINDS(10)
                MOVE 0 TO SQL-SQHARM(10)
                CALL "SQLADR" USING
                    WS-C-DOB IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(11)
                MOVE 10 TO SQL-SQHSTL(11)
                MOVE 10 TO SQL-SQHSTS(11)
                MOVE 0 TO SQL-SQINDV(11)
                MOVE 0 TO SQL-SQINDS(11)
                MOVE 0 TO SQL-SQHARM(11)
                CALL "SQLADR" USING
                    WS-C-NCN IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(12)
                MOVE 6 TO SQL-SQHSTL(12)
                MOVE 6 TO SQL-SQHSTS(12)
                MOVE 0 TO SQL-SQINDV(12)
                MOVE 0 TO SQL-SQINDS(12)
                MOVE 0 TO SQL-SQHARM(12)
                CALL "SQLADR" USING
                    WS-C-CENTREURN IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(13)
                MOVE 4 TO SQL-SQHSTL(13)
                MOVE 4 TO SQL-SQHSTS(13)
                MOVE 0 TO SQL-SQINDV(13)
                MOVE 0 TO SQL-SQINDS(13)
                MOVE 0 TO SQL-SQHARM(13)
                CALL "SQLADR" USING
                    WS-C-LEA IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(14)
                MOVE 3 TO SQL-SQHSTL(14)
                MOVE 3 TO SQL-SQHSTS(14)
                MOVE 0 TO SQL-SQINDV(14)
                MOVE 0 TO SQL-SQINDS(14)
                MOVE 0 TO SQL-SQHARM(14)
                CALL "SQLADR" USING
                    WS-C-CENTRE-IDR-OTHER IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(15)
                MOVE 6 TO SQL-SQHSTL(15)
                MOVE 6 TO SQL-SQHSTS(15)
                MOVE 0 TO SQL-SQINDV(15)
                MOVE 0 TO SQL-SQINDS(15)
                MOVE 0 TO SQL-SQHARM(15)
                CALL "SQLADR" USING
                    WS-C-UKPRN IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(16)
                MOVE 4 TO SQL-SQHSTL(16)
                MOVE 4 TO SQL-SQHSTS(16)
                MOVE 0 TO SQL-SQINDV(16)
                MOVE 0 TO SQL-SQINDS(16)
                MOVE 0 TO SQL-SQHARM(16)
                CALL "SQLADR" USING
                    WS-C-CENTRENAME IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(17)
                MOVE 65 TO SQL-SQHSTL(17)
                MOVE 65 TO SQL-SQHSTS(17)
                MOVE 0 TO SQL-SQINDV(17)
                MOVE 0 TO SQL-SQINDS(17)
                MOVE 0 TO SQL-SQHARM(17)
                CALL "SQLADR" USING
                    WS-C-CENTREADDRESS1 IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(18)
                MOVE 150 TO SQL-SQHSTL(18)
                MOVE 150 TO SQL-SQHSTS(18)
                MOVE 0 TO SQL-SQINDV(18)
                MOVE 0 TO SQL-SQINDS(18)
                MOVE 0 TO SQL-SQHARM(18)
                CALL "SQLADR" USING
                    WS-C-CENTREADDRESS1 IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(19)
                MOVE 150 TO SQL-SQHSTL(19)
                MOVE 150 TO SQL-SQHSTS(19)
                MOVE 0 TO SQL-SQINDV(19)
                MOVE 0 TO SQL-SQINDS(19)
                MOVE 0 TO SQL-SQHARM(19)
                CALL "SQLADR" USING
                    WS-C-CENTREADDRESS2 IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(20)
                MOVE 36 TO SQL-SQHSTL(20)
                MOVE 36 TO SQL-SQHSTS(20)
                MOVE 0 TO SQL-SQINDV(20)
                MOVE 0 TO SQL-SQINDS(20)
                MOVE 0 TO SQL-SQHARM(20)
                CALL "SQLADR" USING
                    WS-C-CENTREADDRESS2 IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(21)
                MOVE 36 TO SQL-SQHSTL(21)
                MOVE 36 TO SQL-SQHSTS(21)
                MOVE 0 TO SQL-SQINDV(21)
                MOVE 0 TO SQL-SQINDS(21)
                MOVE 0 TO SQL-SQHARM(21)
                CALL "SQLADR" USING
                    WS-C-CENTREADDRESS3 IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(22)
                MOVE 30 TO SQL-SQHSTL(22)
                MOVE 30 TO SQL-SQHSTS(22)
                MOVE 0 TO SQL-SQINDV(22)
                MOVE 0 TO SQL-SQINDS(22)
                MOVE 0 TO SQL-SQHARM(22)
                CALL "SQLADR" USING
                    WS-C-CENTREADDRESS3 IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(23)
                MOVE 30 TO SQL-SQHSTL(23)
                MOVE 30 TO SQL-SQHSTS(23)
                MOVE 0 TO SQL-SQINDV(23)
                MOVE 0 TO SQL-SQINDS(23)
                MOVE 0 TO SQL-SQHARM(23)
                CALL "SQLADR" USING
                    WS-C-CENTREADDRESS4 IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(24)
                MOVE 25 TO SQL-SQHSTL(24)
                MOVE 25 TO SQL-SQHSTS(24)
                MOVE 0 TO SQL-SQINDV(24)
                MOVE 0 TO SQL-SQINDS(24)
                MOVE 0 TO SQL-SQHARM(24)
                CALL "SQLADR" USING
                    WS-C-CENTREADDRESS4 IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(25)
                MOVE 25 TO SQL-SQHSTL(25)
                MOVE 25 TO SQL-SQHSTS(25)
                MOVE 0 TO SQL-SQINDV(25)
                MOVE 0 TO SQL-SQINDS(25)
                MOVE 0 TO SQL-SQHARM(25)
                CALL "SQLADR" USING
                    WS-C-CENTREPOSTCODE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(26)
                MOVE 10 TO SQL-SQHSTL(26)
                MOVE 10 TO SQL-SQHSTS(26)
                MOVE 0 TO SQL-SQINDV(26)
                MOVE 0 TO SQL-SQINDS(26)
                MOVE 0 TO SQL-SQHARM(26)
                CALL "SQLADR" USING
                    WS-C-CENTRETYPE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(27)
                MOVE 2 TO SQL-SQHSTL(27)
                MOVE 2 TO SQL-SQHSTS(27)
                MOVE 0 TO SQL-SQINDV(27)
                MOVE 0 TO SQL-SQINDS(27)
                MOVE 0 TO SQL-SQHARM(27)
                CALL "SQLADR" USING
                    WS-C-QUAL-NUMBER-TYPE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(28)
                MOVE 5 TO SQL-SQHSTL(28)
                MOVE 5 TO SQL-SQHSTS(28)
                MOVE 0 TO SQL-SQINDV(28)
                MOVE 0 TO SQL-SQINDS(28)
                MOVE 0 TO SQL-SQHARM(28)
                CALL "SQLADR" USING
                    WS-C-QUAL-NUMBER IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(29)
                MOVE 10 TO SQL-SQHSTL(29)
                MOVE 10 TO SQL-SQHSTS(29)
                MOVE 0 TO SQL-SQINDV(29)
                MOVE 0 TO SQL-SQINDS(29)
                MOVE 0 TO SQL-SQHARM(29)
                CALL "SQLADR" USING
                    WS-C-SPEC-CODE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(30)
                MOVE 8 TO SQL-SQHSTL(30)
                MOVE 8 TO SQL-SQHSTS(30)
                MOVE 0 TO SQL-SQINDV(30)
                MOVE 0 TO SQL-SQINDS(30)
                MOVE 0 TO SQL-SQHARM(30)
                CALL "SQLADR" USING
                    WS-C-SPEC-TITLE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(31)
                MOVE 150 TO SQL-SQHSTL(31)
                MOVE 150 TO SQL-SQHSTS(31)
                MOVE 0 TO SQL-SQINDV(31)
                MOVE 0 TO SQL-SQINDS(31)
                MOVE 0 TO SQL-SQHARM(31)
                CALL "SQLADR" USING
                    WS-C-QUAL-TYPE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(32)
                MOVE 100 TO SQL-SQHSTL(32)
                MOVE 100 TO SQL-SQHSTS(32)
                MOVE 0 TO SQL-SQINDV(32)
                MOVE 0 TO SQL-SQINDS(32)
                MOVE 0 TO SQL-SQHARM(32)
                CALL "SQLADR" USING
                    WS-C-EXAMSERIES IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(33)
                MOVE 2 TO SQL-SQHSTL(33)
                MOVE 2 TO SQL-SQHSTS(33)
                MOVE 0 TO SQL-SQINDV(33)
                MOVE 0 TO SQL-SQINDS(33)
                MOVE 0 TO SQL-SQHARM(33)
                CALL "SQLADR" USING
                    WS-C-REG-DATE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(34)
                MOVE 10 TO SQL-SQHSTL(34)
                MOVE 10 TO SQL-SQHSTS(34)
                MOVE 0 TO SQL-SQINDV(34)
                MOVE 0 TO SQL-SQINDS(34)
                MOVE 0 TO SQL-SQHARM(34)
                CALL "SQLADR" USING
                    WS-C-FIRST-ENTRY-DATE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(35)
                MOVE 10 TO SQL-SQHSTL(35)
                MOVE 10 TO SQL-SQHSTS(35)
                MOVE 0 TO SQL-SQINDV(35)
                MOVE 0 TO SQL-SQINDS(35)
                MOVE 0 TO SQL-SQHARM(35)
                CALL "SQLADR" USING
                    WS-C-AWARD-DATE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(36)
                MOVE 10 TO SQL-SQHSTL(36)
                MOVE 10 TO SQL-SQHSTS(36)
                MOVE 0 TO SQL-SQINDV(36)
                MOVE 0 TO SQL-SQINDS(36)
                MOVE 0 TO SQL-SQHARM(36)
                CALL "SQLADR" USING
                    WS-C-QUAL-GRADE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(37)
                MOVE 3 TO SQL-SQHSTL(37)
                MOVE 3 TO SQL-SQHSTS(37)
                MOVE 0 TO SQL-SQINDV(37)
                MOVE 0 TO SQL-SQINDS(37)
                MOVE 0 TO SQL-SQHARM(37)
                CALL "SQLADR" USING
                    WS-C-PRIVATE-CANDIDATE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(38)
                MOVE 2 TO SQL-SQHSTL(38)
                MOVE 2 TO SQL-SQHSTS(38)
                MOVE 0 TO SQL-SQINDV(38)
                MOVE 0 TO SQL-SQINDS(38)
                MOVE 0 TO SQL-SQHARM(38)
                CALL "SQLADR" USING
                    WS-C-PARTIAL-ABSENCE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(39)
                MOVE 2 TO SQL-SQHSTL(39)
                MOVE 2 TO SQL-SQHSTS(39)
                MOVE 0 TO SQL-SQINDV(39)
                MOVE 0 TO SQL-SQINDS(39)
                MOVE 0 TO SQL-SQHARM(39)
                CALL "SQLADR" USING
                    WS-REC-TYPE IN
                    DS02-COURSE-DETAILS
                    SQL-SQHSTV(40)
                MOVE 9 TO SQL-SQHSTL(40)
                MOVE 9 TO SQL-SQHSTS(40)
                MOVE 0 TO SQL-SQINDV(40)
                MOVE 0 TO SQL-SQINDS(40)
                MOVE 0 TO SQL-SQHARM(40)
                CALL "SQLADR" USING
                    WS-AMEND-CUTOFF-DATE IN
                    DS02-COURSE-DETAILS
                    SQL-SQHSTV(41)
                MOVE 11 TO SQL-SQHSTL(41)
                MOVE 11 TO SQL-SQHSTS(41)
                MOVE 0 TO SQL-SQINDV(41)
                MOVE 0 TO SQL-SQINDS(41)
                MOVE 0 TO SQL-SQHARM(41)
                CALL "SQLADR" USING
                    WS-C-PROG-TYPE IN
                    WS-DRD-CURR-RECORD
                    SQL-SQHSTV(42)
                MOVE 1 TO SQL-SQHSTL(42)
                MOVE 1 TO SQL-SQHSTS(42)
                MOVE 0 TO SQL-SQINDV(42)
                MOVE 0 TO SQL-SQINDS(42)
                MOVE 0 TO SQL-SQHARM(42)
                CALL "SQLADR" USING
                    WS-USER-NAME
                    SQL-SQHSTV(43)
                MOVE 15 TO SQL-SQHSTL(43)
                MOVE 15 TO SQL-SQHSTS(43)
                MOVE 0 TO SQL-SQINDV(43)
                MOVE 0 TO SQL-SQINDS(43)
                MOVE 0 TO SQL-SQHARM(43)
                CALL "SQLADR" USING
                    SQL-SQHSTV(1)
                    SQL-SQPHSV
                CALL "SQLADR" USING
                    SQL-SQHSTL(1)
                    SQL-SQPHSL
                CALL "SQLADR" USING
                    SQL-SQHSTS(1)
                    SQL-SQPHSS
                CALL "SQLADR" USING
                    SQL-SQINDV(1)
                    SQL-SQPIND
                CALL "SQLADR" USING
                    SQL-SQINDS(1)
                    SQL-SQPINS
                CALL "SQLADR" USING
                    SQL-SQHARM(1)
                    SQL-SQPARM
                CALL "SQLADR" USING
                    SQL-SQHARC(1)
                    SQL-SQPARC

                CALL "SQLBEX" USING
                    SQLCTX
                    SQLEXD
                    SQLFPN

                IF SQLCODE IN SQLCA IS LESS THAN 0
                    THEN GO TO N-060 END-IF
            END-IF

            IF  BTEC-PROCESS
                ADD  +1  TO  WS-BTEC-INSERT-CNT
            ELSE
                ADD  +1  TO  WS-NVQ-INSERT-CNT
            END-IF

        END-IF.

        IF  BTEC-PROCESS                    
            IF  FIRST-TIME
                MOVE 520                 TO WS-REC-LENGTH
                WRITE  DB-DETAIL-RECORD  FROM  WS-DFE-REPORT-HDR
                MOVE  'N'                TO WS-FIRST-TIME
            END-IF
            PERFORM P-STRING-COLS
            WRITE  DB-DETAIL-RECORD    FROM  WS-DFE-REPORT-DETAIL
            ADD    +1                  TO    WS-BTEC-CNT
        ELSE 
            IF FIRST-TIME
               MOVE 520                 TO WS-REC-LENGTH
               WRITE  DN-DETAIL-RECORD  FROM  WS-DFE-REPORT-HDR
               MOVE  'N'                TO WS-FIRST-TIME
            END-IF
            PERFORM P-STRING-COLS
            WRITE  DN-DETAIL-RECORD  FROM  WS-DFE-REPORT-DETAIL
            ADD  +1                  TO    WS-NVQ-CNT
        END-IF
        
        GO TO N-EXIT.
N-050.
        MOVE   "N-050 : ERROR UPDATING DFE_REPORT_DETAILS" TO WS01-ERR-MESSAGE.
        PERFORM ZZ-ABORT.
N-060.
        DISPLAY 'ERROR Inserting the candidate : ' WS-C-CANDIDATE-IDR-OTHER
        MOVE   "N-060 : ERROR INSERTING DFE_REPORT_DETAILS" TO WS01-ERR-MESSAGE.
        PERFORM ZZ-ABORT.
N-EXIT.
        EXIT.
*
**********************************************************************
* To concatenate the column values without leading and trailing spaces
* for the CSV report.
**********************************************************************
P-STRING-COLS SECTION.
P-START.

        INITIALIZE WS-REC-LENGTH WS-DFE-REPORT-DETAIL.

*       EXEC SQL
*           SELECT :WS-REC-TYPE||','||
*               :WS-C-UNIQUE-CANDIDATE-IDR||','||
*               :WS-C-UNIQUE-LEARNER-NUM||','||
*               '-2'||','||
*               :WS-C-CANDIDATE-IDR-OTHER||','||
*               :WS-RPT-FIRSTNAME||','||
*               ''||','||
*               :WS-RPT-SURNAME||','||
*               :WS-C-GENDER||','||
*               :WS-C-DOB||','||
*               :WS-C-NCN||','||
*               :WS-RPT-CENTREURN||','||
*               '-2'||','||
*               :WS-C-CENTRE-IDR-OTHER||','||
*               :WS-RPT-UKPRN||','||
*               TRANSLATE(:WS-C-CENTRENAME,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               TRANSLATE(:WS-C-CENTREADDRESS1,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               TRANSLATE(:WS-C-CENTREADDRESS2,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               TRANSLATE(:WS-C-CENTREADDRESS3,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               TRANSLATE(:WS-C-CENTREADDRESS4,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               REPLACE(:WS-RPT-CENTREPOSTCODE,',',NULL)||','||
*               :WS-C-CENTRETYPE||','||
*               :WS-C-QUAL-NUMBER-TYPE||','||
*               REPLACE(:WS-RPT-QUAL-NUMBER,'  ',' ')||','||
*               :WS-C-SPEC-CODE||','||
*               TRANSLATE(:WS-C-SPEC-TITLE,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               :WS-RPT-QUAL-TYPE||','||
*               '-2'||','||
*               :WS-C-REG-DATE||','||
*               :WS-C-FIRST-ENTRY-DATE||','||
*               :WS-C-AWARD-DATE||','||
*               :WS-C-QUAL-GRADE||','||
*               '-2'||','||
*               '-2',
*               LENGTH(:WS-REC-TYPE||','||
*               :WS-C-UNIQUE-CANDIDATE-IDR||','||
*               :WS-C-UNIQUE-LEARNER-NUM||','||
*               '-2'||','||
*               :WS-C-CANDIDATE-IDR-OTHER||','||
*               :WS-RPT-FIRSTNAME||','||
*               ''||','||
*               :WS-RPT-SURNAME||','||
*               :WS-C-GENDER||','||
*               :WS-C-DOB||','||
*               :WS-C-NCN||','||
*               :WS-RPT-CENTREURN||','||
*               '-2'||','||
*               :WS-C-CENTRE-IDR-OTHER||','||
*               :WS-RPT-UKPRN||','||
*               TRANSLATE(:WS-C-CENTRENAME,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               TRANSLATE(:WS-C-CENTREADDRESS1,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               TRANSLATE(:WS-C-CENTREADDRESS2,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               TRANSLATE(:WS-C-CENTREADDRESS3,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               TRANSLATE(:WS-C-CENTREADDRESS4,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               REPLACE(:WS-RPT-CENTREPOSTCODE,',',NULL)||','||
*               :WS-C-CENTRETYPE||','||
*               :WS-C-QUAL-NUMBER-TYPE||','||
*               REPLACE(:WS-RPT-QUAL-NUMBER,'  ',' ')||','||
*               :WS-C-SPEC-CODE||','||
*               TRANSLATE(:WS-C-SPEC-TITLE,
*                         :WS-RESTRICT-SPL-CHARS,' ')||','||
*               :WS-RPT-QUAL-TYPE||','||
*               '-2'||','||
*               :WS-C-REG-DATE||','||
*               :WS-C-FIRST-ENTRY-DATE||','||
*               :WS-C-AWARD-DATE||','||
*               :WS-C-QUAL-GRADE||','||
*               '-2'||','||
*               '-2')
*           INTO  :WS-DFE-REPORT-DETAIL,
*                 :WS-REC-LENGTH
*           FROM  DUAL
*       END-EXEC.
        CALL "SQLADR" USING SQ0022 SQL-STMT
        MOVE 1 TO SQL-ITERS
        MOVE 1511 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        MOVE 1 TO SQL-SELERR
        MOVE 0 TO SQL-SQPMEM
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY
        CALL "SQLADR" USING
            WS-REC-TYPE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(1)
        MOVE 9 TO SQL-SQHSTL(1)
        MOVE 9 TO SQL-SQHSTS(1)
        MOVE 0 TO SQL-SQINDV(1)
        MOVE 0 TO SQL-SQINDS(1)
        MOVE 0 TO SQL-SQHARM(1)
        CALL "SQLADR" USING
            WS-C-UNIQUE-CANDIDATE-IDR IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(2)
        MOVE 13 TO SQL-SQHSTL(2)
        MOVE 13 TO SQL-SQHSTS(2)
        MOVE 0 TO SQL-SQINDV(2)
        MOVE 0 TO SQL-SQINDS(2)
        MOVE 0 TO SQL-SQHARM(2)
        CALL "SQLADR" USING
            WS-C-UNIQUE-LEARNER-NUM IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(3)
        MOVE 10 TO SQL-SQHSTL(3)
        MOVE 10 TO SQL-SQHSTS(3)
        MOVE 0 TO SQL-SQINDV(3)
        MOVE 0 TO SQL-SQINDS(3)
        MOVE 0 TO SQL-SQHARM(3)
        CALL "SQLADR" USING
            WS-C-CANDIDATE-IDR-OTHER IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(4)
        MOVE 7 TO SQL-SQHSTL(4)
        MOVE 7 TO SQL-SQHSTS(4)
        MOVE 0 TO SQL-SQINDV(4)
        MOVE 0 TO SQL-SQINDS(4)
        MOVE 0 TO SQL-SQHARM(4)
        CALL "SQLADR" USING
            WS-RPT-FIRSTNAME IN
            WS-RPT-COLS
            SQL-SQHSTV(5)
        MOVE 35 TO SQL-SQHSTL(5)
        MOVE 35 TO SQL-SQHSTS(5)
        MOVE 0 TO SQL-SQINDV(5)
        MOVE 0 TO SQL-SQINDS(5)
        MOVE 0 TO SQL-SQHARM(5)
        CALL "SQLADR" USING
            WS-RPT-SURNAME IN
            WS-RPT-COLS
            SQL-SQHSTV(6)
        MOVE 35 TO SQL-SQHSTL(6)
        MOVE 35 TO SQL-SQHSTS(6)
        MOVE 0 TO SQL-SQINDV(6)
        MOVE 0 TO SQL-SQINDS(6)
        MOVE 0 TO SQL-SQHARM(6)
        CALL "SQLADR" USING
            WS-C-GENDER IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(7)
        MOVE 2 TO SQL-SQHSTL(7)
        MOVE 2 TO SQL-SQHSTS(7)
        MOVE 0 TO SQL-SQINDV(7)
        MOVE 0 TO SQL-SQINDS(7)
        MOVE 0 TO SQL-SQHARM(7)
        CALL "SQLADR" USING
            WS-C-DOB IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(8)
        MOVE 10 TO SQL-SQHSTL(8)
        MOVE 10 TO SQL-SQHSTS(8)
        MOVE 0 TO SQL-SQINDV(8)
        MOVE 0 TO SQL-SQINDS(8)
        MOVE 0 TO SQL-SQHARM(8)
        CALL "SQLADR" USING
            WS-C-NCN IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(9)
        MOVE 6 TO SQL-SQHSTL(9)
        MOVE 6 TO SQL-SQHSTS(9)
        MOVE 0 TO SQL-SQINDV(9)
        MOVE 0 TO SQL-SQINDS(9)
        MOVE 0 TO SQL-SQHARM(9)
        CALL "SQLADR" USING
            WS-RPT-CENTREURN IN
            WS-RPT-COLS
            SQL-SQHSTV(10)
        MOVE 7 TO SQL-SQHSTL(10)
        MOVE 7 TO SQL-SQHSTS(10)
        MOVE 0 TO SQL-SQINDV(10)
        MOVE 0 TO SQL-SQINDS(10)
        MOVE 0 TO SQL-SQHARM(10)
        CALL "SQLADR" USING
            WS-C-CENTRE-IDR-OTHER IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(11)
        MOVE 6 TO SQL-SQHSTL(11)
        MOVE 6 TO SQL-SQHSTS(11)
        MOVE 0 TO SQL-SQINDV(11)
        MOVE 0 TO SQL-SQINDS(11)
        MOVE 0 TO SQL-SQHARM(11)
        CALL "SQLADR" USING
            WS-RPT-UKPRN IN
            WS-RPT-COLS
            SQL-SQHSTV(12)
        MOVE 9 TO SQL-SQHSTL(12)
        MOVE 9 TO SQL-SQHSTS(12)
        MOVE 0 TO SQL-SQINDV(12)
        MOVE 0 TO SQL-SQINDS(12)
        MOVE 0 TO SQL-SQHARM(12)
        CALL "SQLADR" USING
            WS-C-CENTRENAME IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(13)
        MOVE 65 TO SQL-SQHSTL(13)
        MOVE 65 TO SQL-SQHSTS(13)
        MOVE 0 TO SQL-SQINDV(13)
        MOVE 0 TO SQL-SQINDS(13)
        MOVE 0 TO SQL-SQHARM(13)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(14)
        MOVE 80 TO SQL-SQHSTL(14)
        MOVE 80 TO SQL-SQHSTS(14)
        MOVE 0 TO SQL-SQINDV(14)
        MOVE 0 TO SQL-SQINDS(14)
        MOVE 0 TO SQL-SQHARM(14)
        CALL "SQLADR" USING
            WS-C-CENTREADDRESS1 IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(15)
        MOVE 150 TO SQL-SQHSTL(15)
        MOVE 150 TO SQL-SQHSTS(15)
        MOVE 0 TO SQL-SQINDV(15)
        MOVE 0 TO SQL-SQINDS(15)
        MOVE 0 TO SQL-SQHARM(15)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(16)
        MOVE 80 TO SQL-SQHSTL(16)
        MOVE 80 TO SQL-SQHSTS(16)
        MOVE 0 TO SQL-SQINDV(16)
        MOVE 0 TO SQL-SQINDS(16)
        MOVE 0 TO SQL-SQHARM(16)
        CALL "SQLADR" USING
            WS-C-CENTREADDRESS2 IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(17)
        MOVE 36 TO SQL-SQHSTL(17)
        MOVE 36 TO SQL-SQHSTS(17)
        MOVE 0 TO SQL-SQINDV(17)
        MOVE 0 TO SQL-SQINDS(17)
        MOVE 0 TO SQL-SQHARM(17)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(18)
        MOVE 80 TO SQL-SQHSTL(18)
        MOVE 80 TO SQL-SQHSTS(18)
        MOVE 0 TO SQL-SQINDV(18)
        MOVE 0 TO SQL-SQINDS(18)
        MOVE 0 TO SQL-SQHARM(18)
        CALL "SQLADR" USING
            WS-C-CENTREADDRESS3 IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(19)
        MOVE 30 TO SQL-SQHSTL(19)
        MOVE 30 TO SQL-SQHSTS(19)
        MOVE 0 TO SQL-SQINDV(19)
        MOVE 0 TO SQL-SQINDS(19)
        MOVE 0 TO SQL-SQHARM(19)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(20)
        MOVE 80 TO SQL-SQHSTL(20)
        MOVE 80 TO SQL-SQHSTS(20)
        MOVE 0 TO SQL-SQINDV(20)
        MOVE 0 TO SQL-SQINDS(20)
        MOVE 0 TO SQL-SQHARM(20)
        CALL "SQLADR" USING
            WS-C-CENTREADDRESS4 IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(21)
        MOVE 25 TO SQL-SQHSTL(21)
        MOVE 25 TO SQL-SQHSTS(21)
        MOVE 0 TO SQL-SQINDV(21)
        MOVE 0 TO SQL-SQINDS(21)
        MOVE 0 TO SQL-SQHARM(21)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(22)
        MOVE 80 TO SQL-SQHSTL(22)
        MOVE 80 TO SQL-SQHSTS(22)
        MOVE 0 TO SQL-SQINDV(22)
        MOVE 0 TO SQL-SQINDS(22)
        MOVE 0 TO SQL-SQHARM(22)
        CALL "SQLADR" USING
            WS-RPT-CENTREPOSTCODE IN
            WS-RPT-COLS
            SQL-SQHSTV(23)
        MOVE 10 TO SQL-SQHSTL(23)
        MOVE 10 TO SQL-SQHSTS(23)
        MOVE 0 TO SQL-SQINDV(23)
        MOVE 0 TO SQL-SQINDS(23)
        MOVE 0 TO SQL-SQHARM(23)
        CALL "SQLADR" USING
            WS-C-CENTRETYPE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(24)
        MOVE 2 TO SQL-SQHSTL(24)
        MOVE 2 TO SQL-SQHSTS(24)
        MOVE 0 TO SQL-SQINDV(24)
        MOVE 0 TO SQL-SQINDS(24)
        MOVE 0 TO SQL-SQHARM(24)
        CALL "SQLADR" USING
            WS-C-QUAL-NUMBER-TYPE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(25)
        MOVE 5 TO SQL-SQHSTL(25)
        MOVE 5 TO SQL-SQHSTS(25)
        MOVE 0 TO SQL-SQINDV(25)
        MOVE 0 TO SQL-SQINDS(25)
        MOVE 0 TO SQL-SQHARM(25)
        CALL "SQLADR" USING
            WS-RPT-QUAL-NUMBER IN
            WS-RPT-COLS
            SQL-SQHSTV(26)
        MOVE 10 TO SQL-SQHSTL(26)
        MOVE 10 TO SQL-SQHSTS(26)
        MOVE 0 TO SQL-SQINDV(26)
        MOVE 0 TO SQL-SQINDS(26)
        MOVE 0 TO SQL-SQHARM(26)
        CALL "SQLADR" USING
            WS-C-SPEC-CODE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(27)
        MOVE 8 TO SQL-SQHSTL(27)
        MOVE 8 TO SQL-SQHSTS(27)
        MOVE 0 TO SQL-SQINDV(27)
        MOVE 0 TO SQL-SQINDS(27)
        MOVE 0 TO SQL-SQHARM(27)
        CALL "SQLADR" USING
            WS-C-SPEC-TITLE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(28)
        MOVE 150 TO SQL-SQHSTL(28)
        MOVE 150 TO SQL-SQHSTS(28)
        MOVE 0 TO SQL-SQINDV(28)
        MOVE 0 TO SQL-SQINDS(28)
        MOVE 0 TO SQL-SQHARM(28)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(29)
        MOVE 80 TO SQL-SQHSTL(29)
        MOVE 80 TO SQL-SQHSTS(29)
        MOVE 0 TO SQL-SQINDV(29)
        MOVE 0 TO SQL-SQINDS(29)
        MOVE 0 TO SQL-SQHARM(29)
        CALL "SQLADR" USING
            WS-RPT-QUAL-TYPE IN
            WS-RPT-COLS
            SQL-SQHSTV(30)
        MOVE 100 TO SQL-SQHSTL(30)
        MOVE 100 TO SQL-SQHSTS(30)
        MOVE 0 TO SQL-SQINDV(30)
        MOVE 0 TO SQL-SQINDS(30)
        MOVE 0 TO SQL-SQHARM(30)
        CALL "SQLADR" USING
            WS-C-REG-DATE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(31)
        MOVE 10 TO SQL-SQHSTL(31)
        MOVE 10 TO SQL-SQHSTS(31)
        MOVE 0 TO SQL-SQINDV(31)
        MOVE 0 TO SQL-SQINDS(31)
        MOVE 0 TO SQL-SQHARM(31)
        CALL "SQLADR" USING
            WS-C-FIRST-ENTRY-DATE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(32)
        MOVE 10 TO SQL-SQHSTL(32)
        MOVE 10 TO SQL-SQHSTS(32)
        MOVE 0 TO SQL-SQINDV(32)
        MOVE 0 TO SQL-SQINDS(32)
        MOVE 0 TO SQL-SQHARM(32)
        CALL "SQLADR" USING
            WS-C-AWARD-DATE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(33)
        MOVE 10 TO SQL-SQHSTL(33)
        MOVE 10 TO SQL-SQHSTS(33)
        MOVE 0 TO SQL-SQINDV(33)
        MOVE 0 TO SQL-SQINDS(33)
        MOVE 0 TO SQL-SQHARM(33)
        CALL "SQLADR" USING
            WS-C-QUAL-GRADE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(34)
        MOVE 3 TO SQL-SQHSTL(34)
        MOVE 3 TO SQL-SQHSTS(34)
        MOVE 0 TO SQL-SQINDV(34)
        MOVE 0 TO SQL-SQINDS(34)
        MOVE 0 TO SQL-SQHARM(34)
        CALL "SQLADR" USING
            WS-REC-TYPE IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(35)
        MOVE 9 TO SQL-SQHSTL(35)
        MOVE 9 TO SQL-SQHSTS(35)
        MOVE 0 TO SQL-SQINDV(35)
        MOVE 0 TO SQL-SQINDS(35)
        MOVE 0 TO SQL-SQHARM(35)
        CALL "SQLADR" USING
            WS-C-UNIQUE-CANDIDATE-IDR IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(36)
        MOVE 13 TO SQL-SQHSTL(36)
        MOVE 13 TO SQL-SQHSTS(36)
        MOVE 0 TO SQL-SQINDV(36)
        MOVE 0 TO SQL-SQINDS(36)
        MOVE 0 TO SQL-SQHARM(36)
        CALL "SQLADR" USING
            WS-C-UNIQUE-LEARNER-NUM IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(37)
        MOVE 10 TO SQL-SQHSTL(37)
        MOVE 10 TO SQL-SQHSTS(37)
        MOVE 0 TO SQL-SQINDV(37)
        MOVE 0 TO SQL-SQINDS(37)
        MOVE 0 TO SQL-SQHARM(37)
        CALL "SQLADR" USING
            WS-C-CANDIDATE-IDR-OTHER IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(38)
        MOVE 7 TO SQL-SQHSTL(38)
        MOVE 7 TO SQL-SQHSTS(38)
        MOVE 0 TO SQL-SQINDV(38)
        MOVE 0 TO SQL-SQINDS(38)
        MOVE 0 TO SQL-SQHARM(38)
        CALL "SQLADR" USING
            WS-RPT-FIRSTNAME IN
            WS-RPT-COLS
            SQL-SQHSTV(39)
        MOVE 35 TO SQL-SQHSTL(39)
        MOVE 35 TO SQL-SQHSTS(39)
        MOVE 0 TO SQL-SQINDV(39)
        MOVE 0 TO SQL-SQINDS(39)
        MOVE 0 TO SQL-SQHARM(39)
        CALL "SQLADR" USING
            WS-RPT-SURNAME IN
            WS-RPT-COLS
            SQL-SQHSTV(40)
        MOVE 35 TO SQL-SQHSTL(40)
        MOVE 35 TO SQL-SQHSTS(40)
        MOVE 0 TO SQL-SQINDV(40)
        MOVE 0 TO SQL-SQINDS(40)
        MOVE 0 TO SQL-SQHARM(40)
        CALL "SQLADR" USING
            WS-C-GENDER IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(41)
        MOVE 2 TO SQL-SQHSTL(41)
        MOVE 2 TO SQL-SQHSTS(41)
        MOVE 0 TO SQL-SQINDV(41)
        MOVE 0 TO SQL-SQINDS(41)
        MOVE 0 TO SQL-SQHARM(41)
        CALL "SQLADR" USING
            WS-C-DOB IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(42)
        MOVE 10 TO SQL-SQHSTL(42)
        MOVE 10 TO SQL-SQHSTS(42)
        MOVE 0 TO SQL-SQINDV(42)
        MOVE 0 TO SQL-SQINDS(42)
        MOVE 0 TO SQL-SQHARM(42)
        CALL "SQLADR" USING
            WS-C-NCN IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(43)
        MOVE 6 TO SQL-SQHSTL(43)
        MOVE 6 TO SQL-SQHSTS(43)
        MOVE 0 TO SQL-SQINDV(43)
        MOVE 0 TO SQL-SQINDS(43)
        MOVE 0 TO SQL-SQHARM(43)
        CALL "SQLADR" USING
            WS-RPT-CENTREURN IN
            WS-RPT-COLS
            SQL-SQHSTV(44)
        MOVE 7 TO SQL-SQHSTL(44)
        MOVE 7 TO SQL-SQHSTS(44)
        MOVE 0 TO SQL-SQINDV(44)
        MOVE 0 TO SQL-SQINDS(44)
        MOVE 0 TO SQL-SQHARM(44)
        CALL "SQLADR" USING
            WS-C-CENTRE-IDR-OTHER IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(45)
        MOVE 6 TO SQL-SQHSTL(45)
        MOVE 6 TO SQL-SQHSTS(45)
        MOVE 0 TO SQL-SQINDV(45)
        MOVE 0 TO SQL-SQINDS(45)
        MOVE 0 TO SQL-SQHARM(45)
        CALL "SQLADR" USING
            WS-RPT-UKPRN IN
            WS-RPT-COLS
            SQL-SQHSTV(46)
        MOVE 9 TO SQL-SQHSTL(46)
        MOVE 9 TO SQL-SQHSTS(46)
        MOVE 0 TO SQL-SQINDV(46)
        MOVE 0 TO SQL-SQINDS(46)
        MOVE 0 TO SQL-SQHARM(46)
        CALL "SQLADR" USING
            WS-C-CENTRENAME IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(47)
        MOVE 65 TO SQL-SQHSTL(47)
        MOVE 65 TO SQL-SQHSTS(47)
        MOVE 0 TO SQL-SQINDV(47)
        MOVE 0 TO SQL-SQINDS(47)
        MOVE 0 TO SQL-SQHARM(47)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(48)
        MOVE 80 TO SQL-SQHSTL(48)
        MOVE 80 TO SQL-SQHSTS(48)
        MOVE 0 TO SQL-SQINDV(48)
        MOVE 0 TO SQL-SQINDS(48)
        MOVE 0 TO SQL-SQHARM(48)
        CALL "SQLADR" USING
            WS-C-CENTREADDRESS1 IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(49)
        MOVE 150 TO SQL-SQHSTL(49)
        MOVE 150 TO SQL-SQHSTS(49)
        MOVE 0 TO SQL-SQINDV(49)
        MOVE 0 TO SQL-SQINDS(49)
        MOVE 0 TO SQL-SQHARM(49)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(50)
        MOVE 80 TO SQL-SQHSTL(50)
        MOVE 80 TO SQL-SQHSTS(50)
        MOVE 0 TO SQL-SQINDV(50)
        MOVE 0 TO SQL-SQINDS(50)
        MOVE 0 TO SQL-SQHARM(50)
        CALL "SQLADR" USING
            WS-C-CENTREADDRESS2 IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(51)
        MOVE 36 TO SQL-SQHSTL(51)
        MOVE 36 TO SQL-SQHSTS(51)
        MOVE 0 TO SQL-SQINDV(51)
        MOVE 0 TO SQL-SQINDS(51)
        MOVE 0 TO SQL-SQHARM(51)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(52)
        MOVE 80 TO SQL-SQHSTL(52)
        MOVE 80 TO SQL-SQHSTS(52)
        MOVE 0 TO SQL-SQINDV(52)
        MOVE 0 TO SQL-SQINDS(52)
        MOVE 0 TO SQL-SQHARM(52)
        CALL "SQLADR" USING
            WS-C-CENTREADDRESS3 IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(53)
        MOVE 30 TO SQL-SQHSTL(53)
        MOVE 30 TO SQL-SQHSTS(53)
        MOVE 0 TO SQL-SQINDV(53)
        MOVE 0 TO SQL-SQINDS(53)
        MOVE 0 TO SQL-SQHARM(53)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(54)
        MOVE 80 TO SQL-SQHSTL(54)
        MOVE 80 TO SQL-SQHSTS(54)
        MOVE 0 TO SQL-SQINDV(54)
        MOVE 0 TO SQL-SQINDS(54)
        MOVE 0 TO SQL-SQHARM(54)
        CALL "SQLADR" USING
            WS-C-CENTREADDRESS4 IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(55)
        MOVE 25 TO SQL-SQHSTL(55)
        MOVE 25 TO SQL-SQHSTS(55)
        MOVE 0 TO SQL-SQINDV(55)
        MOVE 0 TO SQL-SQINDS(55)
        MOVE 0 TO SQL-SQHARM(55)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(56)
        MOVE 80 TO SQL-SQHSTL(56)
        MOVE 80 TO SQL-SQHSTS(56)
        MOVE 0 TO SQL-SQINDV(56)
        MOVE 0 TO SQL-SQINDS(56)
        MOVE 0 TO SQL-SQHARM(56)
        CALL "SQLADR" USING
            WS-RPT-CENTREPOSTCODE IN
            WS-RPT-COLS
            SQL-SQHSTV(57)
        MOVE 10 TO SQL-SQHSTL(57)
        MOVE 10 TO SQL-SQHSTS(57)
        MOVE 0 TO SQL-SQINDV(57)
        MOVE 0 TO SQL-SQINDS(57)
        MOVE 0 TO SQL-SQHARM(57)
        CALL "SQLADR" USING
            WS-C-CENTRETYPE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(58)
        MOVE 2 TO SQL-SQHSTL(58)
        MOVE 2 TO SQL-SQHSTS(58)
        MOVE 0 TO SQL-SQINDV(58)
        MOVE 0 TO SQL-SQINDS(58)
        MOVE 0 TO SQL-SQHARM(58)
        CALL "SQLADR" USING
            WS-C-QUAL-NUMBER-TYPE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(59)
        MOVE 5 TO SQL-SQHSTL(59)
        MOVE 5 TO SQL-SQHSTS(59)
        MOVE 0 TO SQL-SQINDV(59)
        MOVE 0 TO SQL-SQINDS(59)
        MOVE 0 TO SQL-SQHARM(59)
        CALL "SQLADR" USING
            WS-RPT-QUAL-NUMBER IN
            WS-RPT-COLS
            SQL-SQHSTV(60)
        MOVE 10 TO SQL-SQHSTL(60)
        MOVE 10 TO SQL-SQHSTS(60)
        MOVE 0 TO SQL-SQINDV(60)
        MOVE 0 TO SQL-SQINDS(60)
        MOVE 0 TO SQL-SQHARM(60)
        CALL "SQLADR" USING
            WS-C-SPEC-CODE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(61)
        MOVE 8 TO SQL-SQHSTL(61)
        MOVE 8 TO SQL-SQHSTS(61)
        MOVE 0 TO SQL-SQINDV(61)
        MOVE 0 TO SQL-SQINDS(61)
        MOVE 0 TO SQL-SQHARM(61)
        CALL "SQLADR" USING
            WS-C-SPEC-TITLE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(62)
        MOVE 150 TO SQL-SQHSTL(62)
        MOVE 150 TO SQL-SQHSTS(62)
        MOVE 0 TO SQL-SQINDV(62)
        MOVE 0 TO SQL-SQINDS(62)
        MOVE 0 TO SQL-SQHARM(62)
        CALL "SQLADR" USING
            WS-RESTRICT-SPL-CHARS IN
            DS02-COURSE-DETAILS
            SQL-SQHSTV(63)
        MOVE 80 TO SQL-SQHSTL(63)
        MOVE 80 TO SQL-SQHSTS(63)
        MOVE 0 TO SQL-SQINDV(63)
        MOVE 0 TO SQL-SQINDS(63)
        MOVE 0 TO SQL-SQHARM(63)
        CALL "SQLADR" USING
            WS-RPT-QUAL-TYPE IN
            WS-RPT-COLS
            SQL-SQHSTV(64)
        MOVE 100 TO SQL-SQHSTL(64)
        MOVE 100 TO SQL-SQHSTS(64)
        MOVE 0 TO SQL-SQINDV(64)
        MOVE 0 TO SQL-SQINDS(64)
        MOVE 0 TO SQL-SQHARM(64)
        CALL "SQLADR" USING
            WS-C-REG-DATE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(65)
        MOVE 10 TO SQL-SQHSTL(65)
        MOVE 10 TO SQL-SQHSTS(65)
        MOVE 0 TO SQL-SQINDV(65)
        MOVE 0 TO SQL-SQINDS(65)
        MOVE 0 TO SQL-SQHARM(65)
        CALL "SQLADR" USING
            WS-C-FIRST-ENTRY-DATE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(66)
        MOVE 10 TO SQL-SQHSTL(66)
        MOVE 10 TO SQL-SQHSTS(66)
        MOVE 0 TO SQL-SQINDV(66)
        MOVE 0 TO SQL-SQINDS(66)
        MOVE 0 TO SQL-SQHARM(66)
        CALL "SQLADR" USING
            WS-C-AWARD-DATE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(67)
        MOVE 10 TO SQL-SQHSTL(67)
        MOVE 10 TO SQL-SQHSTS(67)
        MOVE 0 TO SQL-SQINDV(67)
        MOVE 0 TO SQL-SQINDS(67)
        MOVE 0 TO SQL-SQHARM(67)
        CALL "SQLADR" USING
            WS-C-QUAL-GRADE IN
            WS-DRD-CURR-RECORD
            SQL-SQHSTV(68)
        MOVE 3 TO SQL-SQHSTL(68)
        MOVE 3 TO SQL-SQHSTS(68)
        MOVE 0 TO SQL-SQINDV(68)
        MOVE 0 TO SQL-SQINDS(68)
        MOVE 0 TO SQL-SQHARM(68)
        CALL "SQLADR" USING
            WS-DFE-REPORT-DETAIL
            SQL-SQHSTV(69)
        MOVE 850 TO SQL-SQHSTL(69)
        MOVE 850 TO SQL-SQHSTS(69)
        MOVE 0 TO SQL-SQINDV(69)
        MOVE 0 TO SQL-SQINDS(69)
        MOVE 0 TO SQL-SQHARM(69)
        CALL "SQLADR" USING
            WS-REC-LENGTH
            SQL-SQHSTV(70)
        MOVE 2 TO SQL-SQHSTL(70)
        MOVE 2 TO SQL-SQHSTS(70)
        MOVE 0 TO SQL-SQINDV(70)
        MOVE 0 TO SQL-SQINDS(70)
        MOVE 0 TO SQL-SQHARM(70)
        CALL "SQLADR" USING
            SQL-SQHSTV(1)
            SQL-SQPHSV
        CALL "SQLADR" USING
            SQL-SQHSTL(1)
            SQL-SQPHSL
        CALL "SQLADR" USING
            SQL-SQHSTS(1)
            SQL-SQPHSS
        CALL "SQLADR" USING
            SQL-SQINDV(1)
            SQL-SQPIND
        CALL "SQLADR" USING
            SQL-SQINDS(1)
            SQL-SQPINS
        CALL "SQLADR" USING
            SQL-SQHARM(1)
            SQL-SQPARM
        CALL "SQLADR" USING
            SQL-SQHARC(1)
            SQL-SQPARC

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO N-060 END-IF.
*
P-EXIT.
        EXIT.
*
* WRITE IGNORED LEARNERS TO THE FILE  
*
Q-WRITE-IGNORED-LNR SECTION.
*
Q-START.
*
        INITIALIZE WS-DFE-IGNORE-LNR-DTL.

        IF  IGN-FIRST-TIME
            MOVE  16               TO  WS-REC-LENGTH
            WRITE DI-DETAIL-RECORD FROM  WS-DFE-IGNORE-LNR-HDR
            MOVE 'N'               TO  WS-IGN-FIRST-TIME
        END-IF 

        MOVE  7                    TO  WS-REC-LENGTH 
        MOVE  WS-CANDIDATE         TO  WS-DFE-IGN-REG-NO
        ADD   1                    TO  WS-DFE-IGN-CNT
 
        WRITE  DI-DETAIL-RECORD    FROM  WS-DFE-IGNORE-LNR-DTL.
*
Q-EXIT.
        EXIT.
*
ZZ-ABORT SECTION.
**********************************************************************
*
*       Report error and expire.
*
**********************************************************************
ZZ-START.
*
        DISPLAY "SSPDFE ERROR".
        DISPLAY WS01-ERR-MESSAGE.

        IF  SQLCODE IS NOT ZERO THEN
            DISPLAY SQLERRMC
        END-IF.
*
*       EXEC SQL WHENEVER SQLERROR   GO TO ZZ-050 END-EXEC.

*       EXEC SQL ROLLBACK WORK                    END-EXEC.
        MOVE 1 TO SQL-ITERS
        MOVE 1806 TO SQL-OFFSET
        MOVE 0 TO SQL-OCCURS
        CALL "SQLADR" USING
            SQLCUD
            SQL-CUD
        CALL "SQLADR" USING
            SQLCA
            SQL-SQLEST
        MOVE 4352 TO SQL-SQLETY

        CALL "SQLBEX" USING
            SQLCTX
            SQLEXD
            SQLFPN

        IF SQLCODE IN SQLCA IS LESS THAN 0
            THEN GO TO ZZ-050 END-IF.
*
        GO TO ZZ-EXIT.

ZZ-050.
        MOVE 'FAILED DURING PROGRAM ABORT' TO WS-ERR-MESSAGE.

        CALL   "SYS$EXIT"
          USING BY VALUE WS01-ABORT.
*
ZZ-EXIT.
*
        STOP RUN.
